<eos>
1-0
0-1
1/2-1/2

*
Rhc7
B7xa2
Qd4e3
Bb2b1
Bg6xd2
Q2g8
Qf3h1
Be5a4
Nca6
Qf8g3
Rf7xc5
Qe3c2
Rb5g7
Nh8xc1
Rhb3
Rg7d3
Qd2a3
Qc8f4
Bd1xg3
N7xh7
Qg6d1
N5h1
Q3xg8
Bc5xb2
N1xd3
Qd7c5
Be8xd4
Re7b6
Na2xa3
Nf6xb8
Nf2xg3
Qc7xd6
Rf1xd4
Rb4xc3
R1h6
Rg1h2
Ne1d7
B5xb2
Qb2d1
Qg1xd4
Ncxe5
Nbe4
Rb8xg7
Rf5xe7
Rc1c8
Rh6g5
Rb8xc1
Rxh3
Bf3c7
Nc7xa5
Re5g1
Na2f1
Rf3xd2
Ne3xc3
Bb1c5
Qa3b3
Rb1xh6
f8=R
Nf7c1
Rg3xb4
Bha1
B6g8
Qd6c6
Qg4xg4
Nf1xd4
Bb3d8
Qb5b3
N2xa1
Re5xb3
Qb8f2
Qa7a8
Qf6b6
Rh7d3
Rb7e6
Qb3d4
Bdxd3
Rc3e1
Rd3e3
Na5xg1
Qh6xa2
Bc5a4
Qa5xd8
Ba7a5
Nc4xc7
Ba6c5
Qa4h5
Rg8d7
Ng5xd2
N8xe2
N2xg4
Qb1xh1
Ng8xd4
Ne8f5
Re7b4
Rexh8
Na5b6
Qd5xd3
Bg7f7
Bc6xg7
Re8c2
Ng5c7
Bg3xc7
Rd7xf1
Rd8xc6
Rd3xh6
Nc4xe8
Nf2b5
Bg4xb2
Ng8xf4
Bc6xh8
Bf7a2
Ng7g4
Nd4b2
Rb7xe1
Q2f2
Nd3a7
Qf3xa1
Ng2xe5
Ra7a2
Qf1g3
Qd8xf2
Bh6a3
Bd8xc7
Ra3xd6
Bc1c4
Bg8d5
Bd7g7
Ng7xd8
Ng5xf6
Qe8f8
Bd5f4
Qe8xc7
Qg1xa4
Nb8b5
Q1xf2
Qhc7
Bb1f2
Nd2xh5
Qc7e6
Bc6xe3
Rg8xe2
Qg5e2
Bf6f1
Qb5xb8
Bc1h1
Qbd4
Na2h3
R5xf2
Nc4a5
Qa8xa4
Rf1d7
Nc1h4
Bc4c1
Rf4d8
Rd1f6
Qfxa3
Qc5b6
Rd4xf4
Ba1xe5
Qb6xa3
Q6g3
Qc4a1
Qg5g1
Qh6c2
Nd7xe4
N4xf4
Rh4xb1
Rxg6
Rc3xe3
Nb1xh2
Ne8a1
Ra7d4
Bd2xa3
Bh7h3
R3xd7
Bg2c1
Rc1xg7
Rg7xb4
Qg2a8
Rh3d8
Qfb2
Ba3c4
Be4e2
Qh1xh1
Nf7f6
Rc8xg6
Qd2h6
Bb5b7
Bf8xh4
N1b5
Rc3xc8
Nf5xf8
gxh2
Rg4b6
Bf8e2
Qb2xh2
Ba8f2
Qc2d7
B1c1
Nexc6
Nb3xh1
Be5g7
Bh2e4
Qc4xd1
Ndxd2
Qd7xd2
N7xh3
R4b7
Ra5g5
Ng7b7
fxg1=R
Nb1xd1
Bg4e3
Bb4xd3
Bbxb7
Bh5h1
Qg8h3
Q7c6
Qhd2
Qb8f7
Rh3xd7
Bh6xe8
Rc7xf1
Qh7c2
Bb3g4
Kxg6
Rd5b5
N3xe6
Re2c8
Bd1h6
Nf2e1
Rha3
Bg4xf2
Qe2f4
Be3g8
Nf6b7
N6c6
N6d7
Nh6xa6
Nfg7
Rd3xa8
Re2d3
Nh2e6
Qa3c3
Bf6xf2
Ra4c1
Nb4xh7
R1xa3
Ra2xc4
Nac6
Rc7a2
Na8xg5
Nf1g4
Ne8g7
Ngxa7
Ba4e3
Qgf4
Qc2b6
Qed8
R8g6
Nh3b2
Rcxg8
Ncg1
Bh2xd6
Nb6xd3
Qf6xc8
Nb8xa7
Bdxh6
Bd3xh5
Rf6xa3
Qg5c4
Qe2xf6
R8xc5
Bf4xe2
Q3a1
dxe1=N
Rb1xd3
R5xd2
Ng5xb6
Qhg4
Nb6d3
Qf1a6
Rh3f1
B2xb2
Rc1xf8
Bhxe8
Qe2xa5
Qe7xb7
Qb2xh8
Na5e3
Nfd4
Ne2b7
Nd6xg6
Q6xg8
Rh7e3
R6h3
Rf8xh8
Nhxh6
Qb4c8
Rc1g2
Rg3xg8
Qh1d7
Qf5xe1
Ra6h6
Rb3e5
Rc7c6
Bf5xc7
Rgc2
Rg7xd1
Rexb4
Be8xh1
Ra3xc3
Qc8c5
Qfxd3
Qda7
Qb6d5
Rd1a5
Ba2a5
Qh2c5
Nc1xa6
Bg5e4
Rc2xb8
Rh6xc1
Rh2
Qd1xf8
Qa2xa5
B8h3
Ngf8
Ne6c4
N3xf8
B1h3
Rf2g4
Ng5xh5
Qe1b3
Be5xg8
Qh3xd1
Bdh3
Qh3xd7
Bb3xe5
Q4xd8
Rd6e3
Bd3
Rc1e7
Bd3xa1
Rg3f4
Nda5
Qfd5
Rd4g2
Re7xb7
B8xh4
Bb8xg8
Qe6d8
Bc3a8
Ba1xb6
Rg6xe1
Q4xb5
B2g3
Rb8xb5
Rh3g1
Re4xh6
Qc8xa3
Baxc2
Bh8xf3
Reh5
Qc4g1
Na3g5
Bc7xg6
Bh4h5
Ne6xg3
Bg8xc5
Qa4b2
Qf1xf4
B7c7
Bd4c6
Nc7xg1
Na3a4
Rg4h7
Bf8xd6
Bge5
Re3h6
Nf5xe1
Be5c1
Qg2c4
Rc6xa7
Rg6e8
Bf7xd3
Qf8xb5
Bgxe5
Bc7h4
e1=Q
Nb2xc4
Qf3c8
Bg7g4
Be5xa8
Ng8b7
Ng6f1
Nb2h1
B1xe6
R7xb2
Qf1xd8
Qh3xf2
Qh8xh5
Ra7xb5
Qb5h2
Nf3xb5
Bg5g6
Rh1a2
Nd8xg8
Nfh8
Rc6g3
Nf3xd2
Ne4f6
Nch8
Nd7xd5
Qg1xf4
Nd1d5
Na8xd8
Bf7xc2
Qcxf6
Nc3xd6
Naxf7
Qg6xh1
Rf3c8
Qg3xh5
Bg3g4
Qf7e2
Qb7h1
Rd6xg3
Bh8h1
Rb1f6
Nh5xb7
Ba7c7
Rh1e7
Qe1f3
Rexb7
Bexc8
R5xe1
Bh1d6
Nfe4
Ne2xd4
Kxc3
Qd6xd2
Qe2e4
Ba6xf1
Qa5c5
Rf2xg7
R6xc3
Rc8h7
Bgg7
Qf3b4
Qh2f8
Rb6h5
R7d3
Bb2xc3
Be2d7
Rf2b8
Nc1b5
Qbd6
Ng6xd2
Qh5d4
Qfg5
Re4xb4
Ra4h2
Raxe4
Nb3xc3
Nd6xc3
Qh3xa3
Nbe3
Ne6xh5
Nexe1
Re8xf7
Bac8
R4c6
Ne6xh8
Ne3f6
Nb2f6
Na4xe8
Qh6xg4
Nb1xe5
Qd4xg2
R5xa3
Rgg7
Bh7f6
Bf5d8
B5a3
Rdxd3
Bh6xc5
N8xe5
Bh1d8
Rhh3
Ngxf3
Bf2xd1
Nd6xd7
Qh8g2
Na6xc3
Qcxa2
Qf2xg6
Bg7xf4
Ra6xa5
Rb4b5
Bhb3
Na6g8
Bg2xa5
Bb7b4
Bd1g3
Nae3
Qfxc4
Qc5xe5
Qe7xd5
Bg2f1
Ngf7
a5
Nc7xc3
Rc6d7
Nexf8
Be4a6
Qc7a1
R2xb5
Bb7g1
Nfb5
Rg8xg8
Ba5xe1
Nd1xe4
Rf8xa4
Rh8xa2
Ba7xg6
Qc5xh1
Qc1xe6
Rf6f8
Qh5xe5
Qd4d4
Be6f3
Rc2xh4
Nd2a2
Nh5xc3
Ng6xf5
Beb4
Ncxg8
Qa5xa8
Qb3xg7
Nf1xe2
Rf5c6
Qf2xb3
Bg4xc5
Bh4xg3
Ba6g1
Bf8h8
Ba6xh3
Rb2xd7
Nf5xe5
Qf6xd8
Rc6xb1
Bd5xc1
Ng7xe3
Ba8d2
Naxa6
Bh2f2
N4g7
Qf1xh2
Rb5d3
Bfg5
Bg7xg6
Nb3b7
Qf6g2
Nb6
Qd1xb4
Bg2xg1
Qg6xb4
Be7h6
Qd6xf6
B4f5
Rb5xg1
Bg4f8
Qd7d2
Nb6e3
Nb1xh5
Qf4a7
Rc7d7
Bh4c4
Qe4d3
Bc7xc4
Qg7d2
Qh7xb6
B4e8
Qc5xd7
Re1xf2
N4xb7
Rb2xd3
Bb2a1
Bf1b6
Qg7e8
Bc2xe6
Bg1xe6
Ng7g7
Nh6d5
Qg3g5
Ba4h8
Rc5xd4
Qd8h3
Nc3xd8
Qa8b6
Qb2b5
Qh3a7
Ra7e1
Rd5
Qc2xc6
N2b5
Rg1d2
Nd5xg1
Qe6xh7
Bb6g4
Rd5xg8
Ne1xb8
Bg3e2
Nh6xg2
Be4f7
Re1g5
Nc6xb1
Bh1f7
B2d4
Rg7xg5
Qd4d3
Bb4xa5
Nc6f5
Bbxa2
Qb3h7
Bh1a5
Rf8xd8
Nf7d3
Nb5xb5
Qb4c7
Re2a1
Qe2xb1
Rh1c4
Q6xc7
Ng6a2
Bea3
Nh6xc4
Ba1f6
Be3xh4
Qf7a5
Qf5h4
B7xh4
Qa8xh3
Na7xf7
Ra6xe4
Rg7g7
Qe2a7
Nf7h2
Rcd3
Rc6g2
Ba3xe2
Bb6b2
Bb2xh3
N2xb8
Qg2a4
Nb7xb1
N5d1
Rd5g8
Nd1xe5
Qg6xg1
Qa7a7
Q2xa7
R5e4
Qe5
Ngc5
Rg5c5
Nf6xg3
Bg5b7
Q4xh7
Ba6a8
Bfb8
Ng5xf7
Bc6a8
Qb1e1
Bh8c4
N3d4
N2h5
Bg7xd4
Ne5xe2
Rf1h8
Qd5xc1
Rbxh4
Qg4xh3
Raxb8
Qg5xd1
Rb5f8
Ne8xh3
Bd1e6
Qb1b5
Rc3d3
Bh6e4
Qb4xg7
Rb1b2
Nc1xd8
Ra4xh1
Ng7c3
Qd8xd4
Re3a6
Ng4e5
Bh3h1
Nh8xf5
Bb5xf6
Ndb2
Nc2xb5
Qh7xg5
Nf2xd2
Bd8xc8
Be5xe2
Bb8e3
Be3xg1
Nbxh3
Qh6b1
Qg1e5
Bb8xf4
Bdg1
Nb7a8
Rb6c8
R2f6
N3xe5
Bd1xd3
Rb1xf8
Nh6xd4
Bf4xd1
Qf8xa7
R8e7
Rc8g3
Bc4g6
Nh1xa4
Ba4g2
Rd1c2
Qb1h1
Qe6a4
R7e6
Re7xb5
Qcxa6
Qg3c4
Ba5c5
Nh1xf8
Rf2e2
Ra5a6
Rh6h2
Rc5e6
Bh7xg8
Q3h2
Ndh4
Rh6c6
Na4xd8
Rdxe8
Bg7f6
Qb7xb2
Rc6xb2
Bg3xc8
Rg6xd6
Bh3xc8
Ra8xf3
Re5a4
Qb4xd3
R8xf5
Qc5b7
Rf4xe8
Rf6xe1
Nc1g5
Qh5g6
Rf4c7
Bb4c1
Be8xh7
Nd1xf6
Qh5xb7
Be2e6
Nhxg4
Bg4c4
Bc1xb1
Nd8e5
Bc3xe7
Rf2f7
N3d7
Qd4xe1
Be2xe3
Ng7h3
Qcg8
Ra7g7
f1=N
Rb5xa6
Na8xa2
Qe7xf6
Bexa8
Ne3xg7
Na3c8
N2g2
Rf7g3
R1g3
Bb7xc7
N1b7
Nh8c8
Qa1h2
Qh4b1
Rb4xa3
Qd1xd7
Nh4xa5
Ba1xg5
Rg3xe3
Ra3f1
R2xe1
Bh1g8
Qe2xg2
Be7xf6
Qexb2
B6e4
Q6xf1
Ra3h4
Bb6d2
R3xc4
Ng1g1
Na7xc5
Nf5xf4
Bf4a7
Rh8xa5
Ba8e2
Qh3xc2
Qa6xb3
Naxd2
Nb3f5
Qd1a5
Qd1a2
N1b6
Rh4f8
Nh6b4
Nd1xh6
Rh4xh1
Re7xh1
Rb1c4
Rg1b2
Bgxd8
Qh1xb8
Bh7e1
Rdc4
Qf3xf7
Nc5b7
Qe2xg4
Rg5xc1
Bd8xg2
Bh3g5
Na4xb7
Rf2xc6
Ndxh4
Qb3xh4
Qf2xb6
Ne4xc3
Ba6xc3
Qgxe5
Nb2xc6
Nd7f5
Nf2g8
Bh1b6
Ra6xb7
Nd5c3
Ne4xd7
Nf3xe1
Na7a6
Rd6f2
Rd2xf8
R4f7
Qd7xg4
Rb6a5
Bg5xh1
Nf6xb7
Bf6xa7
Rb8xb8
Na2a3
Qf3a8
Bh2e7
Rad1
Rf5xc8
Rd4xh6
Na5c7
Qf6b5
Nba1
Qd1e6
Rc2xh1
B5f8
Nd3c3
Rd7xg1
Bh7f1
Bc3xf4
Ra8xc2
Re2xf5
Bh8a2
Ba5f1
Nb2xg2
Rf3xe6
Nhxd2
Qe4xb4
N2d1
Ra5xe1
Rf5d6
Nc6xf7
Rg3g5
Bg5c1
Beg6
Qd5xh2
Be8f6
Q7xc2
Bh1xg6
Rf4xd3
Qgc2
Rg4xh6
Ra3a8
Nb3xa7
Rg5d6
Ne2xe5
Rh7h7
Nxa3
Rb7f4
Ng1xd2
Qg3xb5
Qc5xc2
Bed8
Bb1xb2
Qfxb6
Qg2h4
Rg4xe7
Bc3e8
Ba8f7
B4e5
Na1a3
Re6xf4
Nc5xa7
Nf5f6
N2xh8
Bc8f1
Rh3b8
Ra2xc1
Bg8b2
Nha8
Qc7xe7
Rc3d1
B6b4
Raa1
Na7xf2
Nh1c7
Qh7xh2
Rg2c8
Rd1f7
Nh4
Qh1xg7
Re4xg3
Qc2b5
Re6xh8
Bh2xe4
Bc8g7
Qf2b3
Rb6g8
Rc7xa5
B3xh4
Bf7xh2
Nc4xg8
R8e2
Nf2c4
Qe2xc5
Qc1b5
Nc2xc2
Rb4xe8
Nd2
Bh3xf2
Bc8f3
Qbxa6
Nxc8
Re5c4
Bg3xd8
Rg6xa5
Bd4d4
Rh5a7
Qg8xb5
Nc4c7
Q5xa6
Qb2e6
Rf4f7
Nf7xb3
Bc3a5
Nh4xc2
Nh5d7
Nh7f1
B3xa5
Qe2xe5
Bg5xg8
Rd7d8
Qb3e3
Qh1a2
Nc8xf1
Ndxc4
R4xa1
Rfxd2
Nc3e4
Qh3e2
Nb6xa2
Bc8d6
Bd6xg4
Nb5xh5
N4xh3
Qh2xd2
Ba4b4
Bd8xh1
Bc5d1
Na4xe7
Ba1b2
Rc1b4
Rf1xa4
Ng5g3
B3xf7
Bc8xa3
Na1g1
Ne5xf4
Rg2xa7
B8xg1
Ra2c4
R8xb7
Qah8
Beb5
Bxh7
Qa3xf5
Be7xb5
Ba3g6
Nee4
Ne3g3
Qd7f5
Bb1c1
Be6xd4
Rf6xf1
Raxg6
Qh4b8
Rdxa1
Rd2xa4
Qd2xh1
Qcxb3
Ba8c8
Bexh6
B7f4
Na2b1
Bg3xd5
Qf2e3
Nd2e8
Nb7b5
Nc6xa2
Rf7xb7
Qh6xg3
Ra8d8
Nb8f7
Nf8xb7
Qb5h5
Rc6xc2
Nf3xe6
Q3xb7
Rg1xb2
B3xf2
Qc1xc5
Rexa1
Bcxh5
Bfxc8
Qb6xd2
Qh7xg1
Be1xb5
Ra2h1
Qcxh7
Rff8
Re5a6
Rh7a2
Nb7xb5
Bh8xh7
Bg5xh8
Rh7e7
Nh5xb3
Qg2xb7
Qd8xf1
Bf4xh6
Rac5
Rf8g2
Na7e7
Ra1f3
R8f8
Qc1h1
Qa5xg8
Nc8h6
Rd7d1
Nf3xa4
Q7xg2
Rg8xh7
Nb5xb6
Qc3g5
Bh4b8
Bg4h8
Rf7f8
Nd4xe2
Rc6f6
Rd7b7
Nf6e2
Bg7xb2
Be6xf6
Ne6xe8
Re2g8
Rd5a1
Nf1xc1
Re6xg1
Nd7d7
Nb7a2
Rh8xa4
Re2g4
Nd4xc6
N4d2
Bb6xg1
Bb8xe6
Rc3e6
Bc3e6
Qc5xd6
Qb3c5
Qa4xf5
Bcb2
Bd4xe4
Bfxa7
Rg1xe7
Nc3xa1
Ne4xa3
Nc1e3
Bg7c1
Bh8h3
Qf5xg3
Rd1xf7
Bgxe4
Qg6h8
Bc8xc7
Bh1xd3
Bb7e6
Nd3d2
R3a6
Bhd3
Bg8h3
Qc7xa6
N1b4
Ne3xa6
Qf3xb7
Qa8xg4
Ng6xe1
Bh6xg6
Bh2xe7
Nd5d3
Nc6f1
Bh8xa4
Qf1c4
Qc4h5
R3c5
Rg6xc5
Bh1xg1
Qe6xe3
Qh3xf8
Nc1xc5
Qb5xb5
Bc8h1
Na1c1
Qe5xh6
Qc8xc5
Ndd2
Rh6h7
Bh1xb2
Ba7xf4
Qf1f6
Rc1c5
Q1xc7
Rd7h6
Qg2a5
Bh8xd1
Rg3f3
Rf8h8
Nc1g6
Bd7a5
N5xb6
Qe8g7
Ng8xd2
Qb5xd4
Ng5b4
Qf7h2
Bf7xb2
Nc6xf2
Bxb5
Nb3xa5
Ba2xf3
Rg8xh8
Ng7c8
Q4c7
Bg8xb6
Bce2
N4h7
Rd1xc1
Nc8xc7
Qc6g5
Ne5b1
Nb6xb6
Qe8e4
Bf6xd5
Nb8f8
Bc5e8
Qhxd8
Q7b6
Qa6f4
Qd1e2
Na8b8
Bd5xa7
Rh2xb3
Bh6xa8
Bc5xh8
Rh1xa6
Rc2xe2
Na1xd6
Qh1e6
Nc1h8
Qa8a8
Bg6a6
Bd1d3
R1xh1
Q4a5
Ra1xh3
Nh4f2
B8h1
Ra1xd2
Qf6xe1
Bd7xh5
Bf4h8
Rf6e8
Be5xb1
Qdd2
Bf1d7
Nad2
Ba6c3
Naa3
Nf1xf3
Qb1xf3
Bfh7
Bb7e3
Qh2a2
Rf1xe8
Nf3xe8
Nh8a4
Qh2xb8
Re1g7
B2e2
Bc3xg7
Nb2xd1
Qh3xg1
Qd1g7
N6e7
Rb1f4
Qa2xe8
Q2h3
Bb3xd5
Bb2h5
Bc3xh5
Qae6
Bd6xb3
Na5xg8
Raxe8
Re7xa8
Ncxh5
Qa3e7
Ra4xg3
Reb5
Ra7xb3
Qh5h2
Qd4a7
Qc7xg6
Ba5a5
N4xe8
Qb7xe4
Ra2xe1
Rg2xh6
Rd7e2
Be1c5
Qc1xf4
Be8xa4
Bg4g6
Nb7g6
Be4g1
Ba8f4
Neh8
Rb1xc2
Nh8e5
Bb1xh5
Qf5d7
Ng4d4
Bhh1
Qexh8
Nxa5
Qc4xg3
Ne7xg2
Ra1xd7
Ra3xh6
Qe6g6
Re8a8
Rc7d3
B4f6
Qb1xg6
Na1b3
Rf4e2
R1b1
Qch5
Re8e4
Q1f3
Nb2xd8
N5e5
Qa3xa5
Q2xb8
Q5xg7
Nh6b7
Rc8g5
Qe3d8
Bh4xh6
Qd3xa8
Bh6xa1
Qh3xa8
a4
Qb1xd8
Qe7xc3
Bd8b5
Bf7f1
Nc6a5
Rd1xf1
Rd6xd1
Qd4f4
Qg6xh6
Rb3e4
N1g5
Ba2e1
Rf8xa3
Rh3xb4
Bgxg2
Ne8xa2
B4xb7
Qd7a2
Nc1xa8
Nd5a8
Bc3xg5
Rb4c2
Bc8xe3
Bc7a1
Nc1xb2
Rf8e4
Rc1xg5
Qg4xe5
Bb4d4
Bf3xf3
Nb3xf4
Ne2h1
Bd2b3
Qc4e1
Rgxb8
Ba5xc6
Ra5xh2
Be5xc2
Bxf8
Nf1g8
Rh4b8
Ng6a1
Nb6xc2
Nd8d8
Rc6g5
Qf3xe3
Qf2a2
Qc4xg2
Qc7xc7
Rb3a1
Rc6e6
Qc1c7
Nd5a6
Qf8g8
Rb2xf2
Rb1xb8
Qf8xa3
R5xb8
Rd3xd4
Bg3d6
Nb3f7
Qe8b1
Qa6xf7
Rh6f8
Qa2xa3
Nb4xc1
Rc4xe2
Ne5h2
Nh7xc6
Qd4xd8
Rf2h3
Bg8f1
Ng8xc7
Nc4xe7
Qc5f5
fxe8=R
Qh1xf8
Be6xa2
Na2xe4
Rh3xg8
Rh4xf3
Qc1g6
Re8xb4
Bf5d2
Ng2c4
Nd4h1
Rc3c7
Ba8xa1
Ra8e3
Bxb7
Qaxc2
Qh3c2
Qf4xf7
Bed5
Bh1g3
Nb7d4
Be6xc4
Qf1xf1
Nh3a4
Nd4xd2
Rg3d8
Nf2e7
Ba3e3
Bf6xc7
Nd3xb5
Qd1b1
Rg2xa5
N1a4
Rh5h8
Rb4xa2
Nd3xh2
Q5xf3
Qa4c6
Qc3xc7
Rh2xg2
N8b8
Naxd4
Bh5xb4
Q2e5
Rb1g1
Qba5
Bf8d4
Bc8xa4
Nc6b8
R4xb5
Bc6xa5
Ng3e8
Nh4c3
Bdf3
Be6f1
B1e3
Ne6xc4
cxd1=Q
Bb4h6
Qh2xf7
Rg6a3
Qa1xh3
Bb7
Bc8xe6
g4
Bcxa1
Na1xf4
Bc5xh6
Qf2a4
Be7d7
Be5xb5
Qb7g3
Rexa2
Rc7xe3
Qg1e1
Bg6xe5
Bf2xh7
Qe1a1
Qb6xc5
Rfxc2
Bc1xd8
Qe7e6
Bh8xg5
Bf2xh6
Q4xa2
Na4xd7
Bg3h1
Nc3g3
Nd1g4
Rg4xe1
Rc6xa8
Rc6b2
Ra7xd8
Nb8a5
Ng2xh4
R4xb3
R4f1
Qa1xh4
Qa5b1
R8xd1
Re8f7
Qf8
Bd7d2
Nb4a6
Bb8xd2
Be2xg2
Ng8e2
Qe8f3
Qd5xe1
Ra2xg2
Re6b2
Bd2xe3
Ng8g4
Ra6c7
Qe2xe3
Qg5a4
Bd2xb5
Bd7xg5
Rg6xd2
R4xc8
Qb3xa3
R4h8
Bh4xg2
Bd6xf4
Qe7xg7
Qc6xd2
Rg1xg1
Rf8xg1
Bf4xf6
Qb3xc4
Nh8xf4
Rb2b3
Qb4d3
Rh4xd1
Rb8xe7
Rh4f5
Nh1xc8
Bh7xf5
Qe2d4
Ba4xf7
N6d1
Qe5xc1
Rb7f8
Nga5
Qe4xc7
Bd6f5
Qb8g8
N5xf5
Q2d1
Rbxb4
Rcxg1
Nc1d4
Nb7e2
Qh7xf4
Rb3d1
Rg5g8
Bc1e4
Q4xb8
Bh4a7
Na2f8
Qh8a4
Rexg8
Bg1e2
Ng2xf5
Nh4g7
Nc6e3
Rb3xb2
Qd3c5
Qdg7
Qh5
Qf2xd5
Rg8xa1
Qb5xd1
Rg2xf4
R2b6
Bb8xb1
Nf8d1
Na5xc3
Qg4xb6
Bd8xd1
Ba8g3
Qh8f6
Bb2xh8
Rd6xa5
Re2xg7
Qe6d7
Na4xc5
Nc7xd8
Bg8e6
Rd6h5
N4f5
Rg4a7
Re4xc6
Nc7a8
Nd8d4
Qd1d7
Rgf8
Qcxe8
Bc5xh3
Rb4xa8
Qe1a8
Qh5xa7
Qce8
Ne5xf2
B5d3
B3xg1
Qf3xf6
Bd7xg2
Ng8xc2
Bg2xa7
Be4xg6
Bd3a2
Nd7b5
Nh6xf8
Q8xh2
Qd3h7
Qc2xc8
Bh2h8
Nc7xa8
Nb3d5
Naxg1
Ra1b6
Nc7b4
Qxe6
Rf6xe6
Be3xb6
Na4xh1
bxa5
Rbxc2
Qa6d5
Qd5xa1
Qe5xf6
Qh7d5
Qb2d2
Ng1h1
Nc3xh6
Qd7xh3
Qf4xf3
Ne1h7
Qd7f8
Ra8xd2
Re8xb2
Na2b2
Ra7xd4
Rf3xc8
Red6
Bc5a7
R4g4
Q1d8
Nf5f2
Bh7xb4
Nb6e4
Q2f5
Bxd2
N2a4
Ne2xg7
Rf5xh8
Rf2xc3
Qh1xc7
Qc1f7
Ra7d8
Qa3c6
Rh6h5
Nf8xf6
Nc4g3
Qh1xa6
Rc4h2
Nh8xe6
Naxf8
Bh1a4
Be2xg5
N4xc4
Nb5c8
Qd1xg8
Nc6e8
Rb4xf1
Nc7g3
Qc1c2
Be8d4
Bd1b2
Qc7h2
Qd5f1
Bcxa4
Qe2b6
Bf3xg2
Nc5
Qh3xh6
Bb2c6
Bd2g7
Qe7a2
Rh3xh7
Rf3f2
Qb2g6
Ng5g6
Nfxc6
Rh5xa5
Bc3xg3
Rb3xf3
Nb2e7
Bd2xa4
Re7d7
Re7a2
Qd8g8
R5e5
Bf1xc8
Nd2xh3
Na2f7
Qb2xd1
Qe4e5
Qf2xg1
Rf3xb6
Bb2e5
Bgg5
Rg4g6
Ba6xh4
Rc7xb5
Q4g8
Rh6b2
Reg4
Nd5xe4
h8=N
Rh2h4
Rb1xe4
Bg8xe1
Ngxb2
Bc7
Qa5xa7
N4a7
Bhh7
Qd1xg7
R2d1
Nd3xc4
Qe5g8
Nb4c8
Nf4b8
R4xc3
Bf8b8
Qb1xh6
Bh6c2
Bg2xd1
Rc1c3
Qa5f7
Baf7
Bhxg6
Qh4e5
Bfxf7
Bxe6
Qd5h8
Be3xg3
Ne1h6
Nc8xb8
Nh2xa6
Qg3c1
Ne6c3
Nb4xa2
Baxg2
Nc3xc8
N4d1
Qf8b1
Ba5f5
Na1c4
Bd1f3
Qd3xc8
Rg7xe5
Ra7e6
Qeh7
Na4a2
Ba1b5
Rxb2
Na2xf7
Nd1e3
Na3f4
Qff6
Qa8xd4
Bc5h1
Qg2xf8
Ng6xa3
B3xb3
Ra5b5
Bc2f2
Qcg6
Rc2c4
Bdc7
R2xa7
Kxd6
Ba5g2
Bc2d7
Qa7xd4
Qa1xb1
Ra1xb6
Nb5g2
Rf3c4
Ra4f5
Na8d3
N5xf2
R3xe2
Ra6xa1
Ba2xc7
Nb2h6
Bc6a2
Bg4xe1
Ra7a6
Rd7xg3
Rb1xf1
Be8h2
B6xc7
Qexa8
Be6g5
Ra6b6
Rc7d5
Bc8xd2
Nh6b5
R2xb8
Bb6d3
Qh8xd8
Qc8xd4
Qd1h5
Bb7f3
Qd2c7
Rc4e8
Qe2xe1
Bg1xb4
Rc5xh8
Qe3xh5
Ng4xh3
Nexc1
Nd6xd3
Qh6xf2
Q4e8
Be1xd6
Qe6xh2
Be7xa1
Qc6a2
Qe7xe5
Qfxf8
Qb4a6
Bc2f7
Bh3a8
Rf4xe2
Bd7g1
Be7xf4
Qc3xe6
Bf4xh1
Rf5xf4
Q8d3
Qh7xe7
R4xd7
Qdxd3
Qf1a4
Qb5d3
Nd1xb8
Bd2xd4
Nf7e3
R8xd4
Ne7xg5
N5g6
Qf4xh1
Qb7xc2
Q1d4
Bh3h2
Nc7xh3
R6xh4
Ra2xg7
Rc2g4
Nh3xa8
N3xc7
Ne6xf3
Nb6g1
Rc3xe8
Na4xc3
Rd8xe1
Bh5xa7
Bg2xa3
N5h3
Qef3
Ra4xa2
Ba4d4
Bc1xc7
Q6f2
Be5g3
B6xe5
Rbxg1
Na8xa8
Bd8e8
Bc2c7
Rc8xc2
Rc1e2
Ng1h2
B2xd3
Nb5d7
Bf5xe4
Rcc2
Qe8xb2
Rd7xh5
Re7h5
Bc4xb3
Qf7xe5
Baxf7
Ne8a7
Qg1c8
Bd6h4
Rh1e8
Rf4f4
Be1a8
Ne5xh4
Qe4h2
Ne3xg4
Q2c2
Nb1xf6
Nh3xc6
Bc8b8
Qd6g6
Nb8xc2
Nh8xe8
Bg7d5
Bcg6
Ne1xh4
Rh6xd1
Qa6c3
Ng8xe8
Nh7xg4
Bb2xh7
Rg6f5
Bd3e1
Rf8xg8
Nh4xa6
Rb7xc1
Ng1c2
Qh1g7
Nb3xa6
Nf7e6
Na6d6
Bh5d4
Q8xd4
Ra4c6
Qe6e2
Bf4e5
Bh2xh6
B5xg4
Qb5g4
Qd3xf3
Nd1b6
Bd1xd8
Rc3xd8
Rh6c7
Rh1g8
Qf8xe7
Rc4h7
Bd6e7
Nc3xe6
Qf6a3
Qf5xb5
Na3b3
Bfxh7
Bh2xc1
Re2g1
Rg5xc5
Rd5a7
Baxd6
Bfxa4
Qg5c5
Rgxd1
Rg2c5
Nd1b8
R6xa3
Na7xa6
Qd1e4
Qh7h6
Qe2c5
Kxa3
Ng6c7
Ra3a6
Bb4f3
Qe6xg1
Nc4e2
Nc2xf5
Qa2xf3
Qe3a2
Qc7xc1
Rd2xh6
Rg6xb7
Nf1xg5
Nc4a4
Bd6d2
B3xg7
Ba6xg1
Qf6d1
Qg8xh6
Rd4xh3
Be2f5
Rh6d4
Bg3xb4
Raxb7
Ng4d7
R7f2
R5f3
Ncxb6
Qf6a7
Bb8xg5
Qd8xh3
Re3xd3
Q4a6
Rc4xd2
Ra1e1
Rb2xb4
Re3xc8
Na6xf4
Bc8c2
Nb6a6
Qg6a1
Ba2a1
Re8xf1
Ba1xe2
Re6xd4
Rf6a1
Rhxe7
Bexc4
N5b7
N6b8
Rh3xc2
Qe8e6
Bc3h3
Qf1g5
Nc7g5
Q7xe2
Rf4g8
Bh5xa6
Qf2f3
Ba2a2
Nc2xa1
Qc7xg1
Nha3
Nef6
Bc7xf1
Qd8xb4
Qg5d8
Re7c3
Rf8c7
Bhxa7
Bxb1
Rg7xh7
B2e5
Qb5e7
N1a5
Re5h1
R1a4
Q3xh4
Qg8g8
Bg2xe8
Qf2h4
Rc5xd8
Bc5f5
Ne5xb2
Re1xa6
Nf7h5
Bh7xa7
Bg4xa4
Ng4e4
Bbb8
Qaxb1
Nf6e5
Nc2xb8
Bah7
Qh7xe4
Rd8b7
Rg8xc2
Be2f6
R4xb8
Nd7xf6
Bb7xf6
Qd5g1
Ng8b8
Qf3xg1
Nd6h6
Raxe7
Rh2xg1
Re8f4
Q6g7
Bc7xd4
Bg8e7
Rg8a5
Rf7e7
Qc1xh1
Bg3d8
Bd1xe7
Rh3f4
Qd7xc5
Be3b5
Rfe7
Qhxb1
Nf2xb4
Na4h6
Rh4c6
Bd7f3
Nc1c2
Qf3b2
Qf1g2
Rah8
Bc2xb6
R5g3
Bb1e3
N6xc8
B8c1
Rh1d1
Rc5g1
Bb2xe1
Qh2xh5
Be4g3
Qe8xc3
Rf7h4
R6h8
Rc8d7
Bac6
Nb3a3
Nd7g1
Rg1c6
Re1xd7
Na7h8
Qb7g5
Rb2c5
Re2d5
Bh8xa6
B2g6
Bfxd1
B3xc8
Qe4d7
Qa6xf5
Bdf1
Nc6e5
Ne8f4
Nf4xg7
Qe4c1
Bh4h7
Rg1e8
Qf1xa3
Bd5xd1
Ne4h5
Ra7b4
Qb4xb6
Re2xe2
Bb3xf6
Rg6d1
Bfh1
Ng4xd4
Ra6a3
Rf5xe6
Bfxe2
Rc3xe4
Nh1xe6
Qf7xb7
Bb1xa1
Qc3e3
Qc1xg8
Qgc4
Nd5e6
Ba6a5
Qd8xb8
Nfxf7
Rf5b3
Q3b6
Bg5b6
Rgxg1
Naxg2
B6g5
Rdxd7
Ng2xc8
Ng2xh5
Be2xe5
Nh8xd4
Rb5d4
Qc2d2
Qd7xe6
Qg3xh2
Ra3xc2
Ba1xh4
Na1xh3
Bd5a8
Rc4xe6
Nf8e3
Rh4h4
Nd7f6
Rxd5
Bc1g2
Q8xh3
Bce7
Qc1b1
Ra3xg7
Rf5h8
Bb8xe3
Bh4d1
Nh2c1
Rd3b7
N5xa1
Bc2xd2
Na5xa4
Bc6d5
Qc6xb3
Bf2g5
Bexg7
Rgxh8
B3xh8
Qe5xf2
R8h7
Na1xa6
N7xa6
Qf7e4
Q4xh6
Ba5xe8
B4b4
Qc4xg5
Rc6xd2
B5e2
Re5g4
Rh2xc7
Bf3xf4
Rf1e5
Qhxd6
Bcxh7
Ne8xb7
Bf5g3
Bc3e7
Bf1a6
Bb5e5
Rh1xc7
R1d6
Rh5xh2
Rd4xb8
Ba2d6
Ngxe3
Na4xf8
Rd6xd8
Nh4g8
Qc5d5
Rf3xh5
N2b3
Na7xb2
Na3b8
Rh6xa3
Bh4xh1
B2h8
Rc4xd6
Bh5xd7
Rh6xd4
R5h4
Be7xa5
Bh2xg3
Bd1d7
N7xb3
Nd8xb3
Qb4xf1
Rf3b8
R5xf5
Qh4d8
B7h4
Rhxd5
Bh8xb2
Rg8xb5
Ngxf1
Ba1xf6
Rd3xh4
B3g8
Bhxe7
Bdg6
Re2f2
Nd1c8
Nd8xd5
Ba6d7
Re8xh3
Qe1xg1
Rf6a7
Qe2xc2
Ncxf4
Ng6f7
Ba4h1
Rf3xg1
Qb2g4
Bc7b3
Bxg1
Nb1xh7
Qa1e5
Qc6e7
Rc8xh4
Ne8c5
Qg3xd6
Be8b8
Rg6h6
Na3d4
Nf7xd5
Be6xh2
Qb3d3
N3d5
Bc8b4
Qg2xc5
Rf7xa5
Nc6xf5
Qh8xg1
Qh2xa3
Nh7h7
Re1d3
Q7xb8
Qe2d3
Rf4b6
Qbg6
Qc1f1
Rh6xg1
Ba6b3
Nc1xg7
Qh2xa2
Bc2xd7
Bh7xb5
Bc6xe1
Nf5xe4
Qg7xh2
Nc2xd7
B5xe5
Nh3xg5
Nd2h2
Qb5d6
Bh6a8
Bc1xc6
Ng6xg4
Rf2xf4
Bh3e7
Nb2xh7
Kxe7
Ne1e4
Nd5xe3
Nf3xe2
Rf3xa7
N5f7
Bg5xc8
Na3xf3
Bd2g5
Qf8c2
Bd4xb7
R5xd3
Bc1h8
Bd3g5
Ng5d1
Rexb3
N2h3
R3e5
Rfc7
Qf7c1
Be6xh3
Be2e8
Ne4g3
Bg5xg3
Qe1xc2
Bcf1
Rf1xc4
Bh7d8
Nh5xg4
Ng1b3
Nf7xf3
Qd2e5
Nh3h6
Rf2d4
Bb5xg4
Ba6d5
Q1a3
Qbxe3
Bd6xa3
Bdxf2
Re7xf5
Rg1d5
Qf5xg1
Bb1f1
Naf8
Qf1xb4
Qd4xg1
R2xf5
Q8a5
Qc2xg8
Rc7xf7
Rg7
Re8xa7
Rh8c5
B3xe6
B5xg8
Ne4f5
Nd1xe3
R8xh4
Qg5xd3
B7f7
Bga4
Qfb5
Qg8xb4
Nh3b4
Nb8xc7
Q7xd7
B6f5
Bdxg5
Bd4f2
Rbf2
Nc3b8
Rh2f2
Bd7b5
Bbxb1
Rb6a8
Nh2g6
Qa8d7
Rh1f7
N5xc8
Bf2xa6
Ng7f8
Nge6
Qe5xg6
Re7a7
Na1xg1
Ra7xg1
Bg3a7
Rf1xh3
Naxg6
Nb4h2
Rgxg3
N3xf6
Be3d5
Q3xd5
Bcg8
R5xh1
Rc8xe6
Rh2xe4
Rh6xb1
Rg7xh3
Qg6e3
Ba2c7
Nb1e5
Qd8xc4
Qc1e7
Qbxf8
Qf7xc4
Bd7d6
Na6xa2
Ne3f3
Bg8xc7
N4xa2
Rb7a6
Bd2xc6
Re2xf7
Qc5xb8
Rb6b1
R2xf2
Rexe7
Nf8e7
Qe7xa8
Bbxf2
Re8h3
Bb6xf7
Be4d6
Qxd4
Bc4h2
Rc7xd1
Bb4xa2
Qfxd2
Qh6g3
N4xg7
R3b3
Ba3f6
Rd4xb7
R1xc7
Bf4c4
Q5xe6
Rc5h2
Qe1h3
Bf1c5
Nb1a5
Nb4h5
Q7b4
Q6xc8
Nd2xg7
Bg4b5
Nh5d1
Qd6f8
Rg1xf2
Bc4g5
Ba7xa5
Ba8xd3
R6c3
Rbxe6
Na6d2
Rab3
Beh3
Nf2xd1
Bc8xc4
Bh8xh6
Bf5xc8
Bd8h6
N2e7
Rg4xa6
Nhxf7
Qh4g3
Bf2xb2
Nd8d3
Nb2xe2
Rh8e6
Bf3h1
Qe5g7
Na3xf5
Bdxb8
Nb8xe5
Qe5xe1
Rh2d1
Bd7xd2
Rg4xe4
Bc2xd5
Bb2g5
Rg1xa7
Bb7xa7
Bd1a8
Be4a8
Bd3h6
Rhxg4
Qe6g5
Re6xb1
Bf6e1
Ba7xg4
Q5xe3
a3
Qf6a2
Nh7b6
Nb8h1
N1f7
Bd8b6
Qd2xb7
Qg7d5
Qc2xc1
Naxc3
Ba6xf7
Ncxg4
Qh8a3
Bf5h7
Qa5xe6
Nd3f2
N4c2
Bg8a1
Bh1h1
Ba6xa6
Bd1h1
Rdc1
N3xf7
Bg3xc1
Q7xh3
Nc3xf2
Bf1xd5
Bf6e6
Ra4e5
Qf1xg8
Qg2xg3
Qgh1
Qg5xa2
Ra1xg7
Qb8xg5
Bgd7
Ng8f8
Nf7xe7
Qa3xb5
Ra7g3
Na6h8
Qb2xd6
Rd2a3
Rb4d4
Bf4xc5
Qc3c7
N2xg1
Nb1h4
Bh1xc1
Nd7xd1
Nc8xd1
Qd3a6
Qdxg7
Rd4d4
Bh6a4
Bh3xb5
Bfe6
Qg2xe5
R6xf4
B1f8
Qe3xc6
Qd7xb1
Qg4e4
Rc2d2
Be4xc2
Bfxa5
Qf6a4
Nh2b3
B3b1
Bb5b2
Nc3f3
Qe2g6
Qc8a4
Ngxa6
Q1xh1
Rg4a4
Nf6e8
Be2xc6
Rg3b7
Rd3h2
Nh2f8
Qa4xa1
Ra7b1
Bg5xg4
Be7xh2
Bc5h5
Rh1xa1
Ng8e8
Nhg7
cxb3
Na7xd3
Ne2xa7
Qb6xd6
Rb8xc5
Nae1
B7d7
Re5e7
Rb8d1
Nee6
Ng5g2
Bh7xh7
Rb6f2
Rd5e1
Nf3b7
Nc8e6
Qa5xf2
Q5e5
Nh2f5
Q1xe8
B1xh7
Qa4a3
Qd8d6
Bbxa8
R6xf7
Na8xc8
Rb4xh4
Nb5xc8
Ra1xb2
Na5xe5
Ne5h6
Qe6xh1
B8xa1
Na3c6
Nf8xf2
Qh2xd8
Be7xc6
Qg7c6
Rdxe2
Ng1xf6
Nc7b3
Rh5xe8
Nf6c5
Rb2xe3
Bc1a7
Rf7xe3
B1xc5
Be5xh2
Q7xh4
Rd3b2
Re6h1
Bg1d4
Qha7
Qf6f4
Rf1c1
Rg2h2
Bb6f3
Nd3a1
Na2a5
Nc3xh3
Na5c5
Qe4xe7
Be7xg8
Re7xa5
Bh2b7
Nh5xf8
Qdc2
Rh3xb3
Bff7
Qa8xh1
Re6xb5
Nc5g2
Nb6xh6
Nc2c1
Nb1c8
Be1e1
Qaxg7
Raxa8
Nb7xg7
Rf5xf2
Qa3xh3
Qxc7
Qh3g6
Qb2c1
Nf6xh5
Bh1xh6
Nb7xc8
Rf5c4
Rg4f3
Rff7
Nh4xf3
R6b6
N6xa1
Rb6e5
Nf4d2
Rf2xf5
Nd5f5
Rd3g2
Rg4xf2
Ne3h5
N8xf7
Ng6h4
Qa6e7
Qh3xc4
Rh7b8
Bd6h2
Rd6a5
Re3c4
Ba3xh4
Qe7d1
Bg3g8
Rb1xe7
Nd8xg1
Re3e6
Bd1xh5
Qg8e2
Ng1xg2
Qg1d4
Ra6a2
Qfa7
Bg1xa4
Nc1g2
Ra6a8
Nb8g2
Ne5f2
Bf8xd8
Qa8b3
Nc4c8
Nf3xg7
Qd8d7
Qf4d6
Rg3h6
Bexc5
Bb5d2
Na8g4
Rf4xg4
N7g6
Rf4xc3
R6xc6
Qa4xg3
Rf8a8
Nh2a4
Nd5xa8
Qb3a8
Qb1f1
Qb3h2
Be6xh7
Rf1xa5
Bd3xe2
Qd3h3
Qe2xd2
B2xa1
Nd5xg5
Qgxg7
Nfe8
Qe6a7
Rd5xc4
Rf6xb8
Rb4g5
Na7a2
Qf6xd4
Qb3xc1
Rg2xf7
Ba4xe1
Nb2xf3
Reg8
Rh8h8
Nc2xf6
Bb6xh1
Bg7a3
Qe7xc1
Ne5xc4
Qh1xh3
Bd2e6
Nc4a2
Qe6a6
Qa1g5
Rb4c8
R4xh3
Nh2b6
Rb7b5
Nf4g7
Nc7h5
Rf1e8
Bg5d1
Nb4b7
Ra5xb7
B3f6
Ng2xc7
Nc1xf8
Nc8c3
Nb3g1
N5xh4
Qg7c5
Bg6b6
Qa5xf4
Ba4f6
Ra5b6
Nb2xa3
Qe6xe1
R3xa7
Ra6xh6
Bb4xa7
Na6g2
Qa6h1
Ng7c1
Qg6f8
Rb1d7
Bb3xb5
Rc4xc2
Bb5a6
Ng5g1
Na8h7
Bc4e7
Re7c1
Qg7b1
Qg7xf4
Rh6g8
Bf6xa8
Rg1g6
Bd6e2
Nc3c8
Nc8xe6
Qh8xb5
Q4f4
Qef8
Qb3xe3
B8f6
Rb6a2
Nfxa7
Rc7c5
Qf4xa8
Be5h8
Qbxc2
Bd8f5
Q6xb5
Qxf2
Bb1
Qg6b4
Rd3c2
Qg4xa6
Nd8xg5
Ne6xe6
Ne1b3
Ne5b4
Bg2xe3
Qh4c5
Be1xb2
Nd2c3
N1c1
Nh5xd8
Nb2g3
Qf8a8
Be6xe4
Qf4xh7
Rc8xd5
Rcxe8
Bf2d7
Rd2g6
Qa8f4
B4h1
Bh5g4
Bb2xe8
Qe1xb3
Bb7f8
Rg1c1
Nc4f6
Nb6d7
Nh7xh1
Qb2xc5
Bf7xg7
Qg3f2
Bg5xc1
Ra7h5
h5
Qexd5
Qf7xg8
N1a8
Qh3f1
Rd2b1
Nf1xd7
Ne8xg1
Nd2h3
Rb1xg2
Qg6g2
Qc7c3
Rd5c1
Bf8xb2
Qh6xa3
Nba7
Ng8d4
Naxb6
Na3d6
Bf7xe3
Be2e3
Rag4
B8xe4
Rf4f2
Rc6xg3
Nf8xb2
Ba5xf4
N2h2
Qa1e3
Rf6f3
Qh3xg8
Qg3d3
Q1xg5
Na8f6
Rh6xa1
Bg4xg5
Rha6
Bd2f4
Rd2xa1
Na8c1
Qgxg5
Qaxh7
Bc4c6
Qd5xg3
Rg4e4
Nb8c2
Ng3xd6
Nexa6
R1xc2
Rdxc7
Ra1e2
Qe7xe3
Bh8b3
Rb8xe4
Nbh5
Bg4b1
Qa4xb6
Nc7xb5
Qh8e5
Q6h1
Rb5xe6
Rb1xf2
Na4xg4
R3xd6
Bexe4
Bh4d3
Ba7f6
Qc3f2
Q3xb4
Ne6xd3
Rg4a2
R6d7
Rh4d5
Bb1xh8
Rf6xd5
Nf5c2
Rc5g3
Qb5f1
Qa2f2
Be6d5
Nf6g7
Rf6d4
B8xf7
Qb8f6
Q8e7
Nhxe3
Qg5g8
Rd8h5
Nb4xc5
Qh4xc7
Qc3g1
Qf5xh5
Qd6f6
Ra1xg5
Qgh8
Bha6
Ne3a2
Rd6xg4
Qg1xb8
Qd4g2
Nc8d6
Qd5xe3
Re4a5
Ng7xg8
Qfxh7
Be6c6
Qd6e1
Rg8xc1
Qg6xf2
Re1xd5
Rb6xh3
Nd8a3
Nb8f1
Qb6xc4
Rg6e4
R3a2
Ba7h1
Nd2b3
Qh5a2
Be5b7
Ne1e2
Qexc8
Be6xd8
Nh8xh7
Re8g6
Nh4xc4
Rg1e1
Qb2xa4
Nf3xd8
Nh1xh6
Na1h5
Ra7xa4
Rf1xg2
Qhc4
Rb6g1
B1xh2
Ba8xd6
Qf4f7
Na8g2
Rd1xg7
Q3xe3
B7xe8
Rc5xe3
Nf3xg1
Nd7e4
Re4xg2
Bh7a8
Qb4e4
Bf3xe7
B4xa4
Nf5xc2
Rf1d5
Bf7d6
N1b1
Nf3a8
Qb7xh7
Rd3d4
Rc2xe5
Qb6a2
R7xd2
Ka5
Rhh6
Bb3c7
Nb3xh2
Qa8xa1
B1xc3
Nh6b3
Nh7xh4
Qb3h4
Qa7xc2
Qc6xc5
Qb7xc3
Rha7
Re4xg4
Bh7a2
Qg3b7
Rc1h3
Ng5xa7
Ne3h4
Qb6b2
Be1xa4
Nd5xg2
Ncxh2
Qh7xh3
N1xc3
Neb4
Bc5xb6
Qb1h5
Re3d4
Bg8xb4
Be1b2
Rf1xf2
Qg5xd7
Rf4h7
Nc7xh7
Rg6g8
Nf6g2
Nexe5
Rcf6
Na8xc6
Q6e4
Qg8xc5
Bg6b2
Rh8b6
Ra5xf4
Bha2
Bgxb4
Qc3xg3
B6d1
Qe7xc6
Bc3xb1
Qea1
Bc6g4
Qb5xe3
Rb2xh5
Qg7xh5
Ncc5
Qd3e7
Bd4h8
Ng3xd2
Nf2xf4
Qf5f5
Bh4a8
Qg7g6
Qf2h6
Ra5xc7
Qa7g5
Qd6xh3
Nd2xc6
Qa3c1
Qb2c3
Bd5e7
Qa6c6
Rcxd6
Re5b1
Qc7d5
Nfc2
Nah4
N7xd7
Qb7xc1
Qg2xh1
Ra4b7
Qb3xg6
Ra3c3
Nh2xg4
Rd3xa1
Nb5f8
Re3d7
B6h8
Na1xd5
Na6xc4
Qf2xf2
Nh2e8
Q5b8
Rgc7
Qb6xe4
Re4a8
Qg6xh2
Rf5xb4
Re6c5
Q4xg4
Rg8g7
B7f2
Bg2xg2
Qc3xf1
Qb2xh4
Rf8h5
Qh1b1
Qd5g6
Bd6xd6
Qf4a5
R6a5
Ne3g4
Rdxg4
Rb8f4
Re3f1
Nh6a3
Ra1
Bd3c3
Bg1xa7
Qa3a8
Nh1xe1
Ra7xa2
R2g4
B7h1
Rgxc7
Ng4d5
Rh5
Be1xd4
Bf6xd4
Na2xg2
Nc2xd8
Qb3xd4
Qf8xe8
Bc8d8
Qbxg7
Qg7h3
Qe2xf2
Ra5e4
R6c7
Raxh6
Bg2xh6
Qbg5
Be8e5
Ra5xc6
Rh8xb6
Q4f2
Rca4
Bf7xa6
Nd6g1
Bd2e2
Qh6b7
Re8g7
Rh4c5
Bh1f6
Qc4xd8
Ng2xg8
Ba8xg1
Rf5xe8
Rg3xe8
Nf2xg4
Qe8xb6
Nh6f3
Bg1
Q1b2
Rb6xg1
Ngxd2
Bf5e2
Nb5a3
Rb5xf7
Rgh6
Qe8xd4
Bg6b7
Qb2xa7
Bd3xc7
Bg4e1
Qe6h4
Nd2xa7
Qf4xc4
Qa1f5
Rg1h1
Qh6f1
Nd7f8
Rf4g3
Ba2xd1
Na2a7
Qc3f7
Be7b2
Bhg5
Qf1d5
Rd8xh4
Nexg8
Be4xf3
Bc7h6
Rc7g6
Re7xf7
Bd4xe3
Qd6f2
Nh4xf4
Ng2xg7
Ka3
Bg7h7
R6xb1
Bh8h7
N3a8
Bc1d5
Rc4xg3
Bc4f6
Bc8xb6
Ne4g6
Bah3
Bc5d5
Ba3f3
Nc6xd3
Re1xg3
Rh3h2
Rbxd2
Qhxc7
Bh1a3
Nd8h5
Rda4
Bexg4
Re2xg6
Qa7xh2
Rb6xc3
Bb7xc6
Nf8g5
Be1xh5
Ne1xb3
Rb6xd5
Re5f5
Nd5xc1
Be7d4
Bc2d1
Rf7h1
Qf7xf4
Bh7d6
Qh1xf5
Bc1xd5
Nc3a7
Nh2xc4
Rh3c6
Rha1
Nc8h5
Q5f4
Nf2xf1
Ra8xb7
Bd8h3
Qe3xa5
Rdxc8
B6xd2
R7d1
Rb7xa1
Qf3d5
Rc4f1
Qf3xb4
R1xc1
Bd3c8
Na5b5
Nc7d5
Naxh6
Qd5a5
Nf5e8
Bh8c1
Rb3xf7
Bb6g6
exf1=Q
Rd6c3
Ng2e8
Rh4b5
Nc4h1
R5d3
Qhxg2
Bb7xg6
Ba8xh1
Qd3xb7
Nd1d1
Q3xa4
Ne8xd6
Nc2xh4
Rexa3
Raxe2
Nfd2
Qg3a8
Rb1xa4
Rc3xa7
Ra2d1
Re8xh5
Nb7a1
Beb8
Q5xe1
N8xb8
Re6xh5
Bc2h8
Rg3xa6
Na3a6
Raxc5
Qc5f7
B2xd4
Nb3a2
Bg1xf7
Q1xh7
Nd6xd2
Qbg8
Bg7c4
Nd3xf2
Bf2a6
Qfxb1
R2xc7
Be2b6
Nd5xf8
Qd6g8
Be3xc3
Bc3h7
Nc7b8
Na3xd3
Bf6xd2
Nb1g4
Ng3xa2
Rc4g8
N3xb7
Bf6xe5
Be2h6
Ng2g6
Ng8h4
Bc5f7
Bh8xh5
Rg7xf7
Q5xd5
Be1xf8
Bh6xf1
Bh2xh4
Rxb6
Ne3xe7
Qd3a2
Qg3f4
Re8xa1
Rd1c1
N6xc4
Qexg4
Rf3g4
Na3xf6
Ra8xc8
Ngh5
Ba8xf8
Baxb5
Nb5xf4
R7xb4
Re4g5
Rbxh5
Bh6xd2
Nd2xe1
Bf4xc3
R4xb4
Rb5e3
Qge7
Bg5xd3
Re2xh1
Bb8a2
Na1xc8
Qd1h2
N3e4
Rfd6
Na7g2
Nb3xg6
Rh7xg2
Nf5e2
a8=R
Bb3xd3
Q2a3
Bd8h1
R4xb6
Rd2xa8
Qa7f5
Bd3xe1
Bf1xc6
Nc1
Bg3f6
Ra2xe3
Rf6xb2
Rg8h7
Qg2c1
Bg3xg4
Re4g7
Nb5g6
Qb6d4
Rc7e3
Nh8a3
Nb8g4
Qe8g4
Qb6b1
Ra7b3
Ra1xe8
Re4f7
Nd6xf2
B5xe1
Qh7d3
Qa6g8
Bh3f3
Qbc6
Re8xd4
Qf6xg8
R8g2
Rf1xg7
Bb1h4
Rb6xg5
R5xc3
B2xa7
Nc7f6
Rh1b3
B7b3
Qe2xe7
Qd4xa6
N4xg1
Rg6g5
Rh7g6
B4xa5
Qg6xe6
Bd6f1
Rf6e2
Rh6xf2
Rbf8
Bf8xf2
Qf6e4
N3c3
Qd8f7
Qc8h8
Bh5g2
Baxg3
Nh8xb3
Nb7xd2
Nd4xd3
R1xh7
Nf7xf4
Ne3xg8
Qexd2
Be3xa7
B7f3
Be3d7
Nf3xb4
Bc2e3
Bh1b1
Nh1xa3
Rg7xh4
Nd4e5
Rg2b2
a7
Re4xb3
Bh4xc5
Rc1g4
Rf2xd4
Qd6c5
Bb1a5
Bd8c8
Qhxf3
Re1d8
Bg5xd4
Rhe1
Ndxe6
Qe5e7
Bb4a6
Ba1xc7
Ra7xb8
Bh4xd2
Na8c6
Ng3xf1
Ng7xc6
Rf5d5
Qc3a7
Be5h2
Rga8
Rf4xd4
Rc7xf6
bxa2
Qc6xa1
Re4g1
N6xc7
Rcxf2
Nxf3
Bd1xc3
Bce4
Rgxe1
Bc2h1
Rf5b7
Bg6xc4
Qca5
Ne2xb4
Rc7xg5
Bf1xh6
Qf7xa5
Nb3xc2
Nf2b8
Rc4xd3
Nc5xf5
Qa6d6
Nh3xf8
Bh8b6
Rh4b4
Rg6xa1
Qc4e6
Nc7a1
Nb2xh5
Ne4xf8
Na2xg8
Rb4c4
Na6xa5
Ng5e8
Rf3xb3
Bhd5
Ne6xa2
Nf1f7
Qb8xc7
Rf3xa5
Qd3b4
B2xc3
Ne3xc8
Qh6xh1
Na2xh8
Qa7h4
Ra6xb8
Rb8e1
Qf2e7
Rb6g5
Qb2xg3
Nd6xg5
Rg5xg8
Bh2e3
Nb1xc3
Qb4xg3
Bc2b8
Qa3a2
Rd2xd6
Qg2f2
Bg7
Bbxe3
Qa5e8
Qb4xa4
Re5xg7
Qa8xb3
Qg2f6
Qe5f5
Re4xe3
Nh1xh3
Nh8xd6
B1xe1
Ba4xf2
Nd1c7
Qgb3
Qa8h6
Qe2xd3
Rhxe4
Bbxf7
Rh5xd3
Q2e2
Rf2g7
Qe5h6
Rd7xd6
Bd7xh3
Bg7c2
Nb5xf8
Qf4xa3
Qf1xf3
Rh8xd8
Ne1g8
Nb2xc8
Bhg8
Bec4
Ba4xa7
Qe8xd7
Bc3e5
Nh1e1
Q3g5
Na2d6
Qa8f1
Qg4a4
Rb5xb3
Rd6g7
Qc4xb6
Bb6xc3
Ba1xf7
Qb7f6
Bf7xf5
Rb8xd4
N1xg3
Rh5xb8
Rb3xf5
Bg3xh7
Nb6g6
Ra8g2
Rh7g7
Rfg3
Bd4xf2
Rb3g3
Bd2h8
Qb4xc8
Nh1a8
N4xa1
R3xg5
Ba3xc4
R2xg3
Qd4xa3
Qh4c6
Nb2a4
Nf1xb5
Na3c7
N3c7
Na1e3
N5xh5
Nc6
Rd7xf5
Qd4xg4
Qa1xd6
Qe4xf8
Rd4
Qf8xb7
Nb7c3
Bfd1
Nc1xb3
Ndxf8
Bg4xf6
Qc7a8
Bh7xe8
Nc7c8
B5xc1
Bf4xd2
Nc2xb1
Bd7a7
Nc8e4
Rhxg5
Q5c1
Nd8xa8
Ng7e7
Rc4a2
R3c6
N1xf4
Rh7c4
Bdxb5
Qh4h3
Re2xa7
Qe1d4
Ra8xd3
N7h8
N3b6
Ra3xf8
Qg6a6
N7b8
Bc2f5
Nc2b5
Bg7d4
N3c1
R3xa5
B2xd1
Qd4xh1
Q2xe3
Ba8xh3
Na2c4
Qe6b1
Bd3e3
Ng1xd6
Nb8xb6
Qe7c5
Bc1xg8
Bb2f8
Rg5xe1
Q5f2
Bf7b5
Rg2a5
Qd6f1
R7xg6
Bf5xa7
Nc7f4
Rf8xg7
Qc8
Qa8xe1
Rd6e1
Be3xe8
Bd6d1
Rg1xg4
Bd6b2
Bg7g2
Rf8e8
Nd6xa2
Bd5xh7
Re1d6
Nd2xg1
Na1f6
Bd2f6
Qc4xb8
Rd3xa6
Qe6d1
N3g2
R6xg6
Qd5xb4
R6d2
Rc4xh8
Be5xe6
Bf3f7
Qc8xg2
Qc5d7
Bf5xd8
Be5a2
Bf7c1
Qa4xd5
Qe8xf3
Re8h5
Ne2f5
Qb5e8
Rg3h8
Qf8b4
Nf6xb3
Qd2xg2
Qe1xe4
Nc5xf4
Qg1xe1
R4b6
Bc1xh7
Nd5g2
Bg8xd7
Qc5a5
Qf5d3
Rf8xd5
Bg7e2
Qa4xg6
Rb6xf4
Bc3xh4
B3xf1
Rc7f7
Ne5xa8
Nf8e6
Kg6
Qf5f3
Rh5xb5
Ra2d4
R5xf1
Ndb4
Qg2xg7
Qc5xf5
Na2xf4
Nh6e3
Nc7xg4
Nh8e3
Nc6xb7
Nh8xe2
Ne3xh1
Q6xa6
N7xa4
Ne4g2
Q5a5
Bh5xa2
Bde1
Ne7xe1
Rc7xe8
Re6c8
Nb3e1
Rb5c4
Rb7e7
Rd2xc8
Qc8xa7
Bb3g8
Qc3xb3
Be3c5
Qh4f1
Q2xg4
Nb8e8
Qh1h5
Nb8b4
Re3b7
Rd1e6
Qc6xd6
R1xa2
Qb5xf7
Qfh7
Na1xd8
Nd7c4
Nd7xd3
Q6xd6
bxa1=Q
Q5h4
Qc5xf6
Rcc1
Bg2xd2
Bf3xd2
Qxc8
Qd7b8
Bc8g1
Bg5
Qdh2
Qbxf5
Bg3e7
Rg8b1
Bf8a4
Qg5xe7
Rf8xd1
Rb1xb3
R4d3
Ra1a6
Qf1xg6
Ncxe6
Nc2xd6
Be8b6
Re4g8
Ng7xd3
Rh6xh6
Qe7h6
Bb2c1
Bg1e8
fxg6
Ncxe4
Rhxa2
Ba4e2
Rf6b2
Qdg4
Rc8xc1
Bd8xb4
Bca7
Qg1xh1
Rhxb4
Bf5b8
Bc3xe3
Ng3b4
Ng1c4
Ng6xf1
Qb7g4
Qf4g8
Qh7xb5
Ba5xg4
Rg4xg4
Qa6f5
Ra1xe1
Bg6xg2
Be7c8
Bd3xd5
Qh2f7
Ne4b4
Nb6c1
Q8b8
Kxb6
Bd4xg7
Qc7xc3
Na3a7
Bg3xg7
Qbxa1
N1c8
Bg7xg2
Nc8xf4
Rfc5
Ba2e4
N5f8
N7xg6
Rb4xa1
Rh8xf3
B7xc1
Qef2
Ba7xa1
Qa1xg1
Bg5f2
N7xc1
Rf7xe5
Qf4xa1
Nfa1
Rf5xd5
Nc3xa2
Qa6xa3
Be5f2
Q7xe7
Rf1xd6
Bhxh3
Rh8xe1
Qb5xa3
Rb6xa6
Qb4g3
Rb7xc2
Q1xc4
Ra8d5
Be4e3
Qa3xb6
Qa4a6
Qf6c7
Ng3b7
Bb3xa3
Bh7xb6
Nc3xc4
Qc7e8
Nf2f5
Bg2xd6
Na5f4
Ne7d4
Qa1g2
Qe3xg7
Bc2a5
Bh7xc7
Nexa3
Qh3xa1
N7g8
Na8h1
Qaxe6
Bh1xg8
Q2g3
Nc5e5
Qxe3
B1xb1
Rf5xg5
Qa4xd8
Na8h4
Bg8a3
Rf4d5
Bb2xc1
Re3g2
Bh2xd5
Bcxf6
Ne4d2
Qc3c8
Ng6xh8
Rec3
Bh3xb6
Qa4d2
N2xc4
Qb5d7
Qg8b8
Qa5e7
Rh5d6
B7xe2
Nf8xe3
B1xe2
Ng2xe7
R2xg5
f8=N
Qf6b1
Rg6xh5
Rd1xa2
Re5b5
Nf7b7
Qf5c5
Rh3xe7
Bb7a7
Nb5
Nf1xd3
Re5xa5
Bb2b3
Re3xe2
Nb6xf5
Ba7xg3
Na6xc6
Bc5f4
Rd3f5
Bb2c2
Qe8g5
Re6g3
Ba3xg8
Q8xc4
Bh7xb7
Qb3b4
Bg7xa4
Bc3a6
Bf5b4
Qd3xe6
Bh1a7
Rb4xc8
Qa2a2
Rd7xf8
Nhxg1
Q4c8
Qe6d5
Re8xe2
Bg2e3
Nb2xb7
a1=B
Qe7xa7
Rc8c7
Nf4xg1
Rg7f5
Nd4xf3
Ba1xg7
Rfg6
Qcb6
Nb7b8
exf2
Bh8xd7
Ne2xf7
Bh8b4
Rh5c2
Bh7xh4
Ne2d5
Qg5xh7
Bhc3
Nd6a5
Bc5c3
Q7xb2
Ra4g8
Nh6e2
Ne3d4
Q8xc8
Bc6xe5
Ne6f5
Qa6g4
Qb1c8
Qd6xh6
Rf1xd3
R6xe7
Bb5a4
Rg1a7
Qah4
Ndxa3
Qh7h3
Rb5e1
Qb8xg1
Be2xe8
Be7xg2
Nh7xe8
Na4g1
Nh8h6
B4xa2
Qd3c3
Rh4xe3
Qe1d7
Qh2e7
h2
Qg8b5
Na7c1
Qc4xf7
Bf3xb7
Re3xf7
Rd7h1
Q2c3
Be7d6
Na7xh3
Q3xe5
Rc6xh8
Qh7f2
Be4e7
Bd7xd7
Bf8h2
Qb5xf6
Bb7xc3
Re3b3
Nfe6
Rb6f3
Qg3xe8
Qg7b4
Ra7xc3
Ba8xh6
Bd3b3
Nd5f4
Qexg7
Qc6f6
Qc5g7
Qxh7
Ref5
Bd2g3
Rdd3
B5a7
Ba3b3
Rg3xa1
Qa3b2
Qb7b3
Qf3g8
Rge5
Bbf3
N7f8
Ba6xf6
Ra5xg4
Be1xh7
R5xh2
Rb4d1
Rf6a5
Qh2d7
Qb7xe8
Rxd8
Rh7e2
Be7xb2
Be8h7
N2xf2
Qa7xh8
Qg8g3
Bf3xc5
Rb3xg4
Raxf6
f8=B
Bd2xd6
Rh8xd5
R4xf6
Bh3c3
Be2xg4
Rb5d6
Na6h4
B1g4
Qgxh5
Nc6e6
Ncf6
B4g2
Qf2d1
R5xh7
Ndxc3
Rg3g6
Ba7f2
N1xa6
Re1e6
Bh1xh3
Ne1xb7
Rc7d6
Ng4xb4
Bc6f6
Rb1d3
R4xg3
Qh6xe3
Bb3c1
Rg4xc2
Rc1f1
Nh2a1
Q5f1
Nhxa7
Bf2xg1
Bcg1
Rg7d4
Qd4xb6
B3xe3
Qd5e1
Re8a3
Bb6b3
Qa7d7
Bh1h2
Qh4e6
Q7e3
Nc3b3
Ba8xf4
Bc6a4
Qc2xb5
Rec8
Ba7xe4
Be6h1
Nd3d7
Re3xa6
Qc8xb8
Q1c8
Be6xa8
Nd3xf1
Nb4xh6
Bf5e8
Rxh4
Ngd1
Ng7d2
Na3e5
N6b1
Rh6xe3
Rh7xb7
Q8xe8
Bc1h5
Rhxf7
Nb4xd1
Nd4a1
Qdxf3
Q7xb6
Bg2xf1
Nh8xg5
Nd8xh7
Qb2f5
Re4xc2
Rd5xg6
Bxh3
Nc4xd1
Rh4xb6
Bf8xh6
Qh6a2
B5f7
Ne5g6
R7xd5
Rd6xg5
Nf8xe2
Qb4d8
R4c7
Qf4xd2
Qa7g7
Q2xa8
Qh4xg7
R6f7
Nf8a4
Bh1h7
Bd7xe4
Rd6g4
Bb3f8
Qf8b7
Rf5xf5
Nd6xe1
Nf8xf4
Rd8xc2
Rcxd8
Q6g4
Nb5xg7
Rc6xc4
Bh8xd4
Bc3d2
Qb6xg8
Rbxc8
Qh3xf4
Bb8e7
Rd5b7
Bh8xa5
Ne3c2
Rgxd4
Qcc2
Nf6xc8
Rcg1
Ba2xb1
Nf4d1
Qa1xa3
Rf3xc6
Na4b7
N1xb3
Ndxc2
Re8xb3
Re1b4
Bg2e1
Qc3xg8
Rh7a8
Qh8xd5
Re2g3
Bg8xc2
Qg8c3
Nh4f5
Rb5xg2
Nh5xc4
Nb1g7
Qd6xe8
Bhxc6
Ra8f1
Qe4g4
Qhc8
Ne6f6
Bd3d7
Qe1xh6
Rbxg8
Nh2xc5
Bf8a1
B8e5
Be4xf5
Re3xc1
Bg1f4
Qd7xa1
Bf4e7
Ncxa7
Ng3xc5
Nf1xe3
Nf4h3
Rb2e1
Nf1b7
Rg8g5
Rb6xe6
Qe7c7
Qb2e4
Qd2xb5
Qga7
Rg2xe4
Qb6h8
Bf2e2
Qh6xa5
Rb5xh3
Rg4f8
Nxa1
Q1d7
Ng5xc3
Rd1xe8
Rh7xg5
Nh4c6
Q6f1
Qh8h4
Ba7xh3
B6xg8
Nha1
Na2b8
Nh7f4
Nxa2
B4b6
Bf1xb8
Bc8xc2
N4d5
Nxe2
Ra5f8
Qf4xb6
Qf2g8
Qg4xf4
R6xe3
Bf8b2
Ng5xe3
Rhxb5
Nb3xf2
Qb7xf5
Ra8f4
Na8a3
Nc8b7
Nf3c7
B8xd2
Bc5xc8
Rh2e6
Re5xg2
Qd3g7
Rc3h3
Ng6xe3
Qf1b2
Qc4c4
Qe8xc8
Qh3xb6
Bc2e4
Ra5xh6
Bf4e3
Ba3xe1
Nc8xc3
Q6xe3
Rg3xg3
Nd3xd7
Nc2xe5
Ra8e2
Qa8f6
Be2c7
Nd8c3
Q5h5
R2xb7
Nf8c6
Qe2xh3
R2xb6
Qfxb2
Qhe4
Rdxe1
Na3h8
Nexe4
Ne7b1
Nb5xe7
Nh2f6
Bh8xd6
Nd3xb2
Nb8xh6
Bh6c5
Nh5xf2
Qaa6
Rd4xe6
Qf2g3
B7e5
Rb7xd7
Na5xd7
Rc3a3
Qhxb7
Nh1xe2
Bc6xb2
Ngxd7
N6xe1
Bf3xc8
Na4xe5
Nf5g1
Rd5g3
Qc6xe3
Qc8xe2
Nf4b3
Q5xd2
Bh1b4
Rd8xa6
Rb1g4
Re8xd5
Qaxg2
Rd1c4
Nc2f5
Qf2xb7
Bg4xc7
Bb2xg1
Ng1f7
Raxd5
Qg2c6
Ra8xb5
Re6xc5
Rb4e8
Rh6xf7
Rf5xa7
Rf7b7
Rc5g4
Rhxb6
Bhxe2
Qc1e2
Bhf2
Nc6xf4
Nbd7
Be2c1
Rg1f4
Nh6a6
Naf6
Be5e4
Bc3c6
Be4h8
Be5xg6
Qgd7
Qg5xd2
Qb5xc8
N1xh2
Nb4xc6
Re4f8
Rd4a2
Nh3h3
R2g2
Nf3b2
Rb2xc1
Rea1
Qc1xf3
Qh8xh8
Nf7a1
Bf3a2
Rc4xb6
Bb7xa3
Ne4b3
Nc7xg3
Qe5c6
B1xf4
N1h4
Rgxh5
Qgxh1
Rb1h5
Nb6e6
Qb3a7
Re8xh8
Be3xc5
Rd3d3
Rd2g3
Re4e4
Q5xd3
Bc6xg2
Bf8xg2
Q4g1
Bb5g5
Qa1e2
Re3xh7
Nab6
Rh5a6
Bg5xb7
Bd2f5
Qh8h8
Qa4f8
Re1xe4
N1xc7
Bh2c7
Qd6h2
Rh2xc6
Bxg4
Nd4xe1
Rh3xd3
Rg7d8
Be3xc2
Ne2xg2
Na6xa4
Rcxe5
Bc1g4
Rd8b8
Ne7xa8
Bf3b3
Re6xc2
Rh6e5
Nb2a7
B7e1
Qf1c6
Qb3xf1
Bb3g6
Ng6xf8
Qf8h4
Ne7xh6
Qa2xb8
Rg5e6
Rh5xf7
Qg5xh2
Bfxg6
Qc5b5
Bd7xa2
Bh6xa6
N6xb1
Nd6xe2
Bb8xd3
Nd6g2
Qf3xd5
Q8xg5
Nh6xe4
Qge4
Rcxh7
Rb5f2
Bh2c4
Nf8xd5
Qb8xe7
Rc6xd7
Bg1d5
Rh1c6
Na5xf1
Qb4f2
Rf2xb1
Rc8e8
Bexd7
Ncd4
Nae7
Rd3xc3
Ne5xb5
Qf4d2
Nb1xb2
Bd8d3
Rh5xe4
Bg6xc6
Bc6c7
Qg4xf5
Qf7xf2
Bg6a3
Bd8b3
Be4xc8
Qe1e7
R1g7
Bc4xc5
Bhxg3
Ng3e4
Rd3f8
Ba4c1
Qh4b7
Rc2xc5
Bf5c5
Nf3h7
Rd8g4
Bd7xf5
Nh1a5
Bc2xf8
R2xa2
Qf8xc4
Nh3f6
Na7b6
Qc1g4
R2xa8
Bb1e8
N7xb2
Nh4xd8
N7xe4
Re3f5
Bf7xf1
Rh2xe3
Rf5h6
Be7g8
Qd8a8
Nb3h2
Qdb8
Qb6a5
Qf4c8
Re6a2
Rb2xa7
Nce1
Ra4f7
Bh1h8
Bh1xh5
Nd1g3
Rac6
Rd1a4
Nc4a1
Nd7h8
bxc8=B
Bf8xf3
Qa7xf6
Nf4xh3
Qh3e5
Qe5xe6
Qc3d1
Q4g3
Ra4xb7
Rb7d3
Re1e8
Rb4xf3
B3xe4
Re7
Rf8xg2
Ngb4
Nb6c7
Bd3xe8
Bgg2
Qc3xg6
Bc1xf6
Qh8d5
Rh8xh1
Ke6
Qb8xh8
Rc8xb7
Ba2xh7
Qg5h2
R2g1
Qd2h7
Nb1b2
N2f2
Rh7xd7
Qg3e4
Re5e3
Qa1f6
Qh5xa1
Qa8xe3
Rgxb6
Bf3f5
Qd4xh4
Ba8h5
Nexa1
Rd5xe8
Ne2e8
Na4f5
Qa3h6
Bcxa7
Bd1c2
Qh3xb5
Qb5b4
Rf3xc4
Ne6b2
Qh2g1
Ra4a2
Q3xb3
Qb6e6
Qd4xe6
Q2f1
Na2g2
Qd2e1
Qa3xc6
Qae8
Qg3e2
N5xh6
Nc6xe4
Qexd3
Rd8d5
Nha6
Nf4h8
Rf6b6
Bg8xb5
Nc4h7
Nd7xh7
Naa7
Ne4xh2
Qf8xd7
Nh7e6
Rf7c3
Rg7g3
Rd4xd1
Rh5g1
Qa5a2
Rb1e4
Ng3a8
Nh3xf2
Qd4a6
Rab4
R7e2
Q1f6
Qc6e2
Bg7a5
Bh5c6
Nc6xb6
Qd4xd5
Ng8h8
B7xb2
Qg2f8
Rb7h8
Qe4e7
Nd1xb7
B6xe6
Nh5xg7
Na2h7
Rc2a8
Bg2a2
Rcxc7
Rb3xd2
Ng3f6
Qe1b5
Qg1xa7
Rd4xb4
Ra3xe3
Ne5xg8
Rb1xh5
Nf5xh3
Qh6b4
Rb3a7
Rdxg6
Bd2a2
Q5e4
Ngxd8
R6d6
Nc4g8
Rh7xb8
Bc5xe2
Nd3xg2
Qde5
Qh7xc5
Rg2d6
Bb8xb5
Nf1xg8
R1xb7
Rhg6
Bh3g3
Bb6a1
Ndxa4
Nc6xc5
Na8xd1
Ra2xh7
Bd6e6
Rb8g3
Nb1xh4
Qb2g2
Qh8xc3
Rb1d4
Rb7xf7
Nh5c5
Qa4xf4
Ba5xg5
Nxf1
Ng2b4
Ned5
B2xh3
B2xb4
Ng1c3
Bc5xf4
Qa5xd7
Qcf8
Rd6xa8
Bh7g2
Rhxd2
Nca1
Bbxc1
Qc5xg6
Rc4d5
Qg3xd8
Re1b2
Qh8f1
Bc1xc3
Na5xf4
Neg5
Bf8a3
Na5f6
Ne2xb7
Rd3d1
Nb2xb1
Qd7xa7
Qb6xh1
Ne4d5
Nh1g2
Qe3a5
Q2c7
Qb4h6
Nb4e5
Naxh2
Qexg6
Nf3xh6
Bbe6
Be5g1
Bh7g8
Bf7f3
Qa1xg8
Qc4g7
Rg7a3
Qc5xd4
N2d6
Bexc2
Bc1e5
Ra7h2
Re7g1
Nbh6
Qd2xe8
Rc6xd3
Rh3a3
Ng2g5
Nb7xd6
Rc5a3
Qb3e1
Ne2xf5
Nc2xg4
Rf3xe8
Qdh1
Bf2g6
Rxb5
Bc2b7
Bc6xd7
Nxc6
Qe8c4
Rdd6
Qh7xe3
Qc4b7
Bc7xc8
B1e5
Nb7xh2
Ne4h3
Qh8xh2
Qb4xa5
Rh2xb4
Rb2e5
Be8xg8
Nf3a2
Bcc4
Qb3xh6
Rc8xc8
R3d4
Bh3xf8
Ne3b3
Rc7d2
Ba6a2
Qb5xe2
Bf1c1
Rf4xc4
Qc8f7
Bd3xa2
Qa1xb8
R8xh7
Nf3g2
Rc2xe3
Qc1xg1
Nc6a8
Bd2xf2
Be7xg1
Ne4xg2
Ra2f5
Bf6h3
Nd7xd4
Qb1xd2
Re1d1
Be5b4
Ng7f2
Rf6e3
Rf7f3
Rge7
Re2g7
Qf1xa7
B5xc3
Neh6
N7h2
Nc3xh8
Rd5c7
Qg7c7
Rd8c5
Bg6xe1
Rh5f3
Rh3xf8
Nh7xb1
Qf4f5
Bc1xb8
Be8xg6
N3g8
Qg3xb3
Ne4xd8
Rd8h8
Rg4h4
Rb3xa8
Qa3a3
Qg4b7
Bb3xg2
Bf3xb4
Nd8xe4
Qh6xc2
Q8f4
Nd8g4
Re8d3
Qa3c7
Rc7xf5
Ba1d4
Bd3g4
Rb7a5
Bf5d4
Re4xb2
Qg8e1
Re8e3
Qg8xg1
Nhxe1
N8xg7
Qh8h2
Bc8h3
Rh7xh3
Ne6xh7
Qgg5
Rb7xb1
Qe1a4
Bb7h3
Nc4f7
Bg4xa3
Nb6xb5
B5xd1
Bc8xa5
Bd6xg3
Bb6xc7
Qa6xh3
R5e8
Qh4xa5
Bb7a4
Ba7c2
Rf1xh2
Qg7b3
Bh3xd2
Ne1xh3
Rg7xb7
Ndxb1
Nh3xf4
Re1xc1
Ba8xb2
N5xf4
Ng8h3
Ba1xa1
Q1xa1
Nf6xd5
Q6b4
Bch1
Rh4xa2
Na2xe2
Be1xe4
Bg3xa6
Q5a2
Bdb5
Qa4xb5
Qa6xf4
B6xe1
Nf1xc6
Bbd5
Rh2c3
Nb7xe8
Qb8d1
Qd4xf1
Bh6a5
Nd8
Rg6b2
Re6e1
Rc5xe6
R4a4
Na3e8
Be3f1
Qf4b2
Na2e2
Rb1f1
Nh5h4
Qg5xe4
Qe2xg5
Qg1h1
Rfh4
Bd3c4
Ne5xh7
Bh7b6
Rf2xf3
Qe7xa3
Rh2c2
Ng3xb7
Bb8f2
Nf5h8
Qe5xe2
Na3h4
Rc7a3
Nd8xf1
Rb3d3
Ng3a7
Bb8xf8
Bc5f8
Ne2d3
Qd8xa4
Qh2xh6
Bhxc3
Bgd2
Rc3xb4
Nc6d8
Qg6h3
Qfc5
Ba6xc5
Rd7xh4
Bb8c7
Qda6
Rce8
Bc2xd4
Nbxf7
Rdxa3
Nh2e3
g1=B
Ng1xb2
Nh4xg4
Ne3d1
Qcxb1
Bcxb8
Qb1b1
Qh4e8
Qf2xf5
Nh8xd8
Qh7xd1
Rf4d6
Ne3f4
Bc2xd3
Bf4xc7
Bh7b1
Nexb8
Bdc4
Bb6e2
Qb6xa4
Ngg2
Bb1h2
Nb3xe2
Qe5e1
Qc6xb5
Qf5f8
Qe8c5
Qh1f5
Nh2xa3
Nb5b2
Qd3xa1
Bh4xf6
Qb6xg1
Re2xd2
Qg3xg1
Ne1xa2
B5xd4
Rb7xg1
Na3d1
Nb5xg3
Qe8xb7
Rb1c8
Bh6g4
N2xf1
Na3xh3
Rg3a4
Na1xa8
Rd3b3
Ne4xf5
Re4xa5
Qd4g4
Bh7e8
Nf6xh3
Be2xe1
B6e1
Qg6c5
Qh5xg4
Rh8xd2
Ne3e6
Nf1a5
Bb5c7
Qa4d7
Bg4d5
Be1f6
Qd2b1
Qc6xe4
Qe6e8
Qg5
Bd5h6
Nb7d3
Qg7xg5
Ra3c7
B7d1
Nb5xd3
R5xf3
Rgh4
Be3xa1
Rh6xh3
B7xd3
Rf1xh5
Bh6xh6
Ng5xg8
Qc4e7
Kxe6
Rh1d5
Bh1xa1
Bg7xc5
Bbxh6
Bfg4
Bg6a7
Ng4xc7
Rd8xf4
Nb4c1
Qc2xe5
Kxf6
Rexh2
Qb1a6
B2c3
Bxd8
Bd5xf6
Be8xe6
Rbxg3
Qbxh4
N8xc2
Ra1b5
R7h4
Rde7
Qfb7
Qg6xc2
Qe1xd3
Qa7e4
Re6xh4
Rgxc4
Qhxf8
Qh5xc8
Rdxb4
Qc4b1
Ra8h2
Qgxh6
Rg6a7
Rh6g6
Nc4xd5
Qb6xg2
Nd6e1
Rb8xh2
Nb3h1
Qa8xf2
Qe2g4
Qh1xc3
Rb1xa5
Qf1d8
Ba4xe8
Qa3xd8
Qf6c8
Nh3xa2
Nd4e7
Nc6g8
B8xg8
Bc2a1
Qh6c7
Nf1a8
Qd4xh5
Ra8c8
R7xc3
Ba3xb3
Ng4xf8
Bg1xh5
a1=R
Ra8xg5
Rc4g7
Be5xf3
Q3f6
Ba4d1
Nf1c7
B2xg2
Qb7xg3
Re5xb1
Qe2xe8
B4g4
Qd1xg6
Bd7c3
Qh4xh2
Nh3xa4
Ng7xe6
Bb5c3
R8g8
Qa1xd4
Nbg3
Qexb4
Rf2c6
Qb1xh8
N3xa4
Rg3h7
Qe4xh2
Qf2xh7
Qg5g7
Rf5xa5
Qd6c4
Bh5xb3
Qf3e5
Rg3g8
B6xc1
Bd6g7
Nb4xc3
R1xe4
Qe3xg3
Q1xe1
Qd3xg6
Qd7xd4
Ra6xf5
Be1xa3
Bd2xg5
Rc2xb1
R7g6
Nd5d5
N2xe7
Qhxg5
Re7g7
Bad6
Rd4xh8
Nc3xb5
Ng4xe3
Rhd5
Ng8c2
Nf6xc7
Qd2xd6
Ra1xa6
Qg6xh3
Rfxg1
N4b3
Q2g2
Qa1c3
Qg8f8
Re2f3
Nc8xc4
N6xd6
Qh5d3
Na3xd6
Ne2f6
Qbxg6
Bc4xd6
Qg5d5
Nfg6
Bb1xc7
Ba2xd3
Rf2xd8
Qf4h5
Nb2f2
Rf2g6
Bb4b5
Rg5xe5
Nd2xf1
Qb4e7
Rc2xg8
Nh5g1
Nf1g3
Qb5xd3
Rf2xa5
Re8d5
Ne8c2
Qa5c7
Qh7b3
Ba3
Bh6g6
Bh8xg1
Rbxh2
Be8xa2
Ng8xa4
Re7xh3
N8e7
Qb6xd5
Qa8xc3
Ba2xb8
Qg3b8
Q3f4
Qe8d7
Bd4c8
Nb4b4
Qhxc6
Qd3xc2
Qh7xc2
Ba1e5
Nb3g8
N8xa3
Nc2xh2
Nb2xe1
Q5b2
B4xe5
Rf3h5
Nb4e8
N2xh3
Qh4xf8
Qa4d6
Re8xd2
Nd1e4
Q8xf4
Rg5xa8
Nc2b2
Bg1xg3
Rf8a2
Nd7xc2
Qg3xb4
Ne7xd2
B2h7
Na1xc1
Rc8xb2
Bef5
Nh1e6
Q3xe6
Bg3xf5
Ba4b3
Nd3xg6
Nb1f2
R6g1
Bh6c3
Rf1b1
Ne4xh3
Qh1xe5
Qd8g1
Nc3e6
Qc3xe2
Rb8xf7
Rb3c7
Re6b1
Na2xc6
Ra8a6
B5xg3
Qd1xh7
Rh3xa6
Rf5xh5
Bh1xd1
Qf2xa1
Ra6xc8
Qg4xc7
Bb1xf2
Rg8xf6
Rc7b1
Nd1xg7
Kxf7
Bd7xb1
Qa6xe6
Kd5
Nf1xb8
Bh5xd8
Bc4xh5
Qf8xd1
Ba4a7
Rb8f1
Rc6f2
Be8xd5
Rb2xb2
Qe4xd8
Nc4h6
Qe7a5
R3xd8
Qf8g4
Ra5xh7
Bf3xg5
Qa3b4
Bf3e6
Qa7xd3
Rbxc7
Qd3b8
Qc1xg2
Rc8a6
Rf8g1
Bf6c4
B8xc6
Nh1xb4
Qdxg1
Nb8xd8
Rf4xh4
Re5xa6
Qaxf5
Be8xc3
Ra2d5
Rh8c3
Bh4xg1
Rf4a1
Bh5f8
Qg8xc6
Bd1h7
Qb8a1
Rb6xh7
Rg8c5
Bd2xf8
Ra3b5
Nc5xa6
Bb7xh7
Qh4e2
Ne3d2
Bb1a2
Nd1xh5
Qe1g3
Rf6b5
Qd5xf2
Bf2e8
Rg3h5
Qd6h8
Ng4g4
Bf3xh1
N2xf6
Bf6xc5
Ba7xd8
Qcxf2
Rc7xb4
Qe8xf1
Qa4xg7
Rfh5
Qfe3
Ra3e4
Rc8f6
Nh4xe6
Nd5xe6
B1d5
Nh2xb7
Ra4xg6
Qh2xf6
Qdg5
Be1xf7
Ba3xb8
Bd1xg5
Re6g6
Bc6xf6
Qd3xg1
Nd5xh5
Ndxf5
B3a7
Nf3xa8
Nd6g7
Qc2xe1
R8b1
Bh2e6
Q1xf7
Rg8c8
Bf6xf5
Qc6xf8
Nh4d7
Nh5d6
Nh8c1
Bg5xg2
Ncxa6
Qc2a3
Rh7xe5
Qe8c8
Qcxc8
Bc3xc5
Qe8g6
Qh8xf4
Re8xc2
exf6
Qd4f6
Q5c8
Bbc5
B4h5
Bd3xa3
Qhd7
Bhxh7
Re6xe4
R2xa4
Nh8f6
Rf3xd7
Qc8b5
Rd4g1
Ba2xc4
Na1
Qe4b5
Q4xa6
Q3c1
Q2a2
Q8xc5
B3e3
Rd6xd7
Ndc6
Nb4h1
Nc2a3
B2xa5
Qh7xg8
Qa7xa8
Bh6b2
Nf4xg2
Bc3xe5
Qg2xd7
Re6xh7
g1=Q
Qb1a4
Re7c2
Nh4e6
Qb7f3
fxe8=N
Nb8xg5
Bc1xb4
N7xg4
Rg2h1
Rd6a4
Bg1f6
Qd5f4
Rb6xa3
Bh5xe6
Nha4
Nc2xh8
Rb6xb8
Qg3d6
Ra5a3
Nc6xg6
Qg7xh7
Qc6c6
Qb4e5
Bh3c5
Bd3xh7
N3xg7
Rec5
Nh7b2
N7f6
Q2c4
Bb7d6
Qf4xc2
Qd7xg8
Ng7e1
Rc1xc1
Qe8a6
Qc4xc1
Rf3h7
Ra2h2
Rc1f6
Rf1b5
Ne4d1
Ndb5
Nc7xf6
Nc2h4
Qdh5
Qa3h3
Bd7c7
Qh7xf5
Kb2
Qe8c7
B6xf2
Qbc1
Qa4g3
Ne7h3
Ba6f4
Bg6xf7
Na8d2
Nh4xf7
Nf4c5
Rc8d2
Qe5xg8
Bg3b5
Nh5xh8
Bf8d7
Nhd5
Rc1xc4
Ba1xb1
Qdxg6
Nhxa1
Qf2b6
Rhxh3
Kxc4
Nb8xa5
Rg3xa2
Qh6e4
R7xg1
Rbxh1
Bc3xf5
Nb5xe1
Bf7f8
Qh3a2
Bh3xb7
Qc2xg4
Rc5b2
Bc7xb3
Qa8d2
Rc4xb1
Qb7b1
Rf4xc2
Bb4c4
Qc7d7
Bb2a8
Bhxd2
Ng3xe1
Nb8xg4
Bd6xf2
Bh7b4
Rbxh3
Ng4xb2
Q5xd4
Nc6xf8
Be3g5
Rh2b8
Bg1xd6
Rf4xe7
Bh8d2
Qg6a8
Rh6a1
Qb7xe2
Nb2f1
Re3d5
Nd7c6
Nh3xe4
Rc7xe2
Bd6c5
Nc8a8
N1e7
Q2xg6
Qc4d4
Rh3xa7
Qc5f6
Rd7f1
Ng7a7
Qe2h7
Rb2d3
Nb7h1
Qhe5
R5xd8
Qe2e3
Rf6f6
Ng1b6
Qb8d6
Bd7xc5
Bc4f5
R3a3
B1h1
N8g6
Ng6xg3
Na8xh4
Bb8e4
Nc2d6
Q4xa3
Ba7f1
Rh1c3
Nh4xc8
Bd5b6
Qb8xd4
Qb4c5
Bd4g6
R8b3
Rg8
Nb6xa4
Qdd8
Rc7xf2
Rf1f3
B7xb8
Ba8d6
gxf8=N
Bf8g1
Qc4xa6
Qc4f2
Rg8xc6
Nc3f6
Ba2d4
Rb3h4
Bb4xb6
Nf1f6
Qe5xh4
Nf5e3
Qhxe4
Qc8xb3
Re1
Rh1xe4
Ng2xb1
Rd8a8
Ra5xe8
Nd8a6
R8c2
Rd8xf6
Ba5xf6
Ba8xg5
Qd6h6
Rf1g1
Bb8a6
Ng7xa2
Na5xg3
Bb6xa6
Rf2e3
Qh1g1
Bh6xc4
Qe6g4
Bh8e3
Nh1h3
Nf1e3
Re4e3
Qed2
Qga6
Nd4xd7
Ng5xg5
Qb4h3
Be6xe2
Rc8
Bb7g2
Rd5xf6
Rh6f4
Rg8b6
Qe5a4
Re4xd5
Qf7xe1
Ne2e6
Bh5xa8
Nc8b5
Nc7h2
Qdxf8
Nb3f2
Qhxg4
Qb3h1
Nh3
Ng5xe6
Qf7xg5
B4xf5
Qa4c4
Ra8b7
Ra8g6
Bg7f3
R2xc2
Qd2xa3
Bhg1
Rd1xd6
N2xd2
Rh4xf6
Bgxe3
Nb3xc7
Qg4d1
gxh4
Bh3c8
Rf1xf3
Nb2xf7
Rb2xf6
Qe6b4
Nf6e3
Ba5xa3
R5xh3
Q5xe4
Rh8xb5
Nd5a1
Bd1xe3
Bf6xb7
Ne6e7
Q2b3
Qdxg4
Ndxa2
e6
Bf7xa1
Bh7c7
Bg4xe2
Be6h6
Nh2f4
Nf1g7
Bd5xa2
Rf3xg7
Ba3b5
Re2xc4
Q7xb3
Ne6xf8
Qe6xb1
Qa2a6
Rd3xe6
Ra7xg7
Qcxg6
Qae3
Ne1xe7
Ngxc5
Qfe6
Ng8xd7
Rf3xc1
Rc1xh3
Nc8xb4
Bgxf3
Qb3b6
Q1xh5
Qb4a1
Nb5e1
Rgxd5
Bd8xc3
Bh4h2
Rc5f4
Qa3f3
Be3xd4
Nc2xd2
Be5xf7
Nf1xc8
Nf1xf8
Bh4e7
Qd1a8
Re6xb3
Nf6xd4
Ng5xh3
Qc8xd5
Bf8xa4
Rh5xg5
Bh8f4
Ne5g5
Qh6xh3
Bbxc6
Ra2f4
Nc6xd2
Qb2g7
Bf5e6
Qd7g2
Ba1g2
Bc1f3
Qg8g1
Qd8xh4
Bh5xa4
Rg7h3
Re2xa5
Rb8xa6
B7c1
Qd7xe8
B5xa6
Bc4xg2
Rh5h5
Re7xh4
Rb5xc5
Nc2b3
Nd1xb6
R5f1
Qg3xa4
Qa1b2
Rgxd6
B2h2
Rc5g6
Qh7h7
Nh7xf4
Bh7xf3
Na5d1
Qa5xd2
Bd7xg3
Nd6xc7
Ng2e2
Qg6d8
Qf2e6
Rc8xd8
Q3f8
Qg1xg5
Rf8xe1
Qf5xb6
Ba3h2
N4b5
Nh5xh4
Qh5xe3
Nb6xe2
Ba5xf1
Bd3f3
R8b7
Rb7xh5
B7xd5
Qb7e5
Be1xh8
Be6xf7
Ra5xc5
Bc2e5
N8xa1
Nb1c7
Ngxh2
R8h5
Qf1xh3
Bb4xa6
Qd5xc3
Qg3xc4
Bf4e6
Rc2a3
Qb5a2
Qd6xc1
Rb8xe2
Ra6b1
Baxb8
Bbg1
Rd5h5
Nc4f8
Be6b7
Qcd5
Be3xf3
Qfg1
Nf6xd8
Ne5c2
Rc1c7
R2xd6
Nf7xe6
Bg4f7
Bc1d4
Qbg2
Qc6xh4
Bg1h4
Nh1d2
Nf7g7
Nb6xg1
Ng8xe1
Rf2xc8
Rhxa4
Ngg4
Nf7xa5
Na5h7
Ng3xh8
Re1g4
Ng6xe5
Ba5xd4
Rc2g1
Ne1xa3
Ng6b6
Nd7xf3
Ka1
Bb8xa3
Q5xe7
Q7b5
Bf8f6
Rb6xe1
Qf5xf5
Bfxh6
Nf2c8
Qxd7
Qf2xg3
Ba7xh4
Bb8xg7
Rg2e5
Nb1f5
Qd5c1
Nb6xd6
Qb3xd6
Qc2g7
Ra7d6
Rf7
Q6e8
Rd2c1
Rf3xf3
Nf1f2
Ba8xa8
Rg5xh4
Rc2f4
Bg1e7
Qa5b4
Bc1xb7
Ba6d4
Rf3e4
Bd8xb2
Rh7xc6
Bb5xc5
R6h1
Qdxb8
Bf6a1
Nh8a1
Ng6xc3
Nc6xg2
c1=N
Nh2
Bf6xd1
Qfxc6
Bg6h6
Q4xh5
N5xf3
Ne6c6
Bc6xe7
Q2xa3
Qb2xg5
Qg3g6
Rg8xb6
Nh3xb3
Ba7xf8
Rd5xd4
Qg5a7
Qe1c7
Rd4b8
Ra5xa6
Rg8xb7
Bf6h8
Ne8xc1
Nd8xe3
Nh1xh4
Bcxc3
Ne8h6
Rf6xf7
Bb5h4
Q8d8
Bh6d7
Rg8b5
Bb3xg8
Bb5xd6
Qf7d8
Ba1c7
Nb2c2
g8=R
Nh7xb4
Qbxb4
Rc7xd2
Rc4xa1
Qf3xg4
Rh5xb2
Rbxd3
B8xd4
Qg8xg6
R7xh8
Bb4f1
Bh6xd8
Bh3b5
Bd7e5
Nd2a1
Nhxb6
Naxa8
Q3xc6
Nf1xf2
Qa6xf2
Ng3xf6
Ra8h7
Ba3xa3
Re1xg1
Rc8a5
Qg8g7
R2f5
Ng3xb3
Bf5h8
Qc3xb7
Qh8c1
N4xc8
R8xd6
Bh2b3
Bc4xe1
Qh8g1
Nfg5
Ndc5
Rxf5
Ref2
Bea7
Qf6xg4
Qh3xg2
Nb8xc6
B1d1
Ra4f6
Qeh6
Na2c8
Nb8h5
Ne4a4
Ra4c5
Rc8xg8
Bf2d2
Bd4xa5
Nh5xd3
Ng1xd7
Qb6xh6
N6c5
Rb4xa6
Nf2h2
Na3xc2
Bd2xf5
Be4a2
Nc1xc7
N2xd6
Be8xa1
Rec6
Be1xf6
N4d8
Ng1g5
Q7xa3
Nd2xb7
Bh7d3
Ba2xf7
Ng2xh8
Q3g1
Qg3c3
Ng4xc5
Bc6d8
Rh5xc4
Na7g4
Q6xc4
Ne2h2
Qb4a4
Re6e4
Rh4d3
Bexh2
Qbb2
Rc6xb3
Ne8b3
Ra2xc3
Be6g3
Nbe5
Bg1xc2
Nh4b1
Rc5h7
Bh7xf6
Ba4xg8
Nc1c5
Bg1d6
Nb4xd8
Nf3f3
Ng6g3
Rd7xf3
Bg3h2
Nc5xc1
Ra5xc4
Ng5xc5
Rc3b4
Qa8h8
Qc4xd3
gxf1=R
Nh2xg7
Nc5c6
Be5f1
Rf6c3
Ra3xc5
Nf2e2
Be4b4
Qd4f5
Bb7f2
Be7xh6
Qb8xb2
N4c5
Ng2d8
Rd7xe3
Ba8xg4
Bh5d1
Bfxb8
Ne3xd5
Nf4xh6
Ng7xg4
Bh4b3
Bc3e2
Rh2b7
Nh1xf5
Ng5xg6
Rcxg3
Rb1xc4
Qg5h5
Qb7xd8
Reb1
Rc2d3
Bd2e8
Qe7xh7
Qd7a6
Bf8a2
Bd2a7
Ra5xg6
Qg8d4
Rdd8
Bf6xg8
Ncc4
Na2xg4
Rg5e5
Bg4xe3
Rb5a6
Bb4g3
Nd7xb6
Ba2xd7
Qg3e6
Na3d5
Be4xh8
Qcxe3
Rf5h7
Rf7a2
Qa7a4
Qa8xd6
Bh3g7
Nb2f3
Bg5d4
Bxd5
R5e7
Rg1xf1
Nd4xa7
Qd6xa8
Qa1f3
Nc8g2
Rh6a2
Nc2xb3
Nc6xb3
Qe2xa1
Nb1d8
Ra5e8
Rh7xa5
Bc5d3
Bf8xf1
Qh3c8
Bcxh4
Qd5xb1
Rh3xh5
Nd5a2
Nb8xe4
Rg6xh4
Qd1g3
Rd1xf5
Rd7xc7
R4xe3
Na5a4
Na3xb6
R5g4
Rh4xf2
Qc8d1
Qh6h3
Nb3c6
Ba7xb3
Bf4c3
Rh1b7
Rb8xc8
Bb1xe7
Be1xc4
Qc5g6
Be4h7
Qe5xf5
Rd3xf7
Nh5xg6
Be5f5
Be1xe6
Bb4f4
Nb1xf3
Qb6xf3
Nb2xc3
R4g7
Bc3f7
Qg5xg6
R3e6
B4d4
Q4xg2
Be3xb4
Bc7xh2
Nh2h2
Nxd2
Re7xb3
Rf1xg4
Rh2xf7
Bh2xe2
Q8xf8
Ngxf5
Qe3a6
Be3e2
Nf3b5
Rf4xg8
Rh4e5
Qa4xg5
Ng2
Ra5xf1
Bf6h5
Bg7xe4
Be5c5
Re2xe1
N5xe2
Rh3d6
Nh4b8
Ne3xe3
Be5xa4
d1=R
Bd5xe8
Bg6a2
Qc3xd1
Ng6xa5
Na7xa4
Be8xb5
R8xa4
Nf7c5
Bd2xh4
R2xb1
Ne4xh8
Bd8g8
N6c4
Qf2xb5
Qfxg7
Re5f7
Qh7d8
Bexb8
Nf6xc2
Qf7xd1
Qexh1
Rc2d6
Qc8xb2
Qc8c1
Rd8xg2
Rg4xf8
N2xg6
Bf1xg6
Rda3
Nh7e3
Qc8d6
Rf1xg3
Qd7xe2
Rf6d6
Nh6xa8
Bh8xf1
Ra8d3
Na4f4
Re3f8
Ba1xf1
Qg1xc2
Rh3e6
Bd6h1
Nh3g2
Qa8xg3
Bxa3
Bbh3
Rd8xe3
Rd3xd1
Re3f3
Be8xg1
Bb1xd3
Nf1d6
Ndxb4
Rd6xf1
Qd6xd8
Qbxe6
Rh4d6
Rd6h4
B4xf8
Qdxe2
Bc4xg6
Bh1xh1
Ne5e6
Ng7d7
Rf5h1
Nh8xb4
Rc5xg7
Qb7xd1
Rf3xe7
Nh4xe7
Qh6xf1
B2d3
Nf2xb7
Qh5xf8
Ng7f3
Rbxa5
Rf8xf6
Nh7xf2
Qc5h5
Rh4c3
Ne2xa2
B7xc7
Qd2xd3
Rh4xd8
Ng3xc4
Q5c4
Qh3xf6
Rg6xc6
Be5a7
Bf3xf6
Nc8e8
Rg6xc3
Rc2xg6
Re6b5
Q7b2
Rh1xe8
Ba3g2
Qa4f2
Qe1b1
Bd8xg4
N1xf5
Qd7xh2
Qed1
Rg4xf6
Rh2xg4
Rg6b4
Re1xh4
Qh5xf4
Nb8c8
Rg7xd8
Ng8xb8
Rf6
Qc2xh5
Qd5xa5
Rb2xg3
Rg8xh5
Qa3xe4
Rbf6
R1d1
Na7xd7
Rf6xg5
Nc6g2
Rg2e7
Ndxd4
Rh6c1
Re8xd7
B3xg5
Rh8c4
Rh6a8
Be2e5
Rf5xe5
Rb6xh2
R4b2
Qh1xa4
N3h8
Bcxa8
Bg2c3
Nc1e6
Nae6
Bf4f7
Rg2xa1
Q7h1
Ra2c8
Bf5xb2
Qa2a1
Bg7xb3
Q7xf1
Qd7g5
Rf8c1
Bc5c7
Qh6f4
Raxf1
Q3e2
Bc6c6
Rc5xa4
Rh3f5
Re6a6
Qc2g2
Rh7c7
Re4e5
Ba8xa5
Nc2d3
Bdxa5
Bf7xc3
Rg3e8
Bexg5
Nc2c6
Qg6e8
Ra2g3
Bh4b6
Qef4
Qe6xg6
Qe1e5
Rg5h7
R1xg5
R5xd6
Qe6f8
Ra5h4
Rc2h3
Ba6e3
Qh4g7
Ba7xg1
N2c4
Nb2xg4
Rfxf5
Q5a6
Bb2e2
Bf2xa4
Nc8xe8
Bh2xb3
Nexa5
Bb1xd7
Qc3xg4
Nd4c2
Ra5a1
Qc5a6
Ba5e1
Nbxd8
Qg8g4
Nd3f1
Qf6a1
Qe1xb8
Rf4c5
Ra1xh7
B1h8
B8e6
Ne4xg1
Bc2e8
Na6d1
Bc8xe2
Ng6c8
Ba5c7
Nh3xh6
Rc4xa6
Bb3f2
Na7xc4
Be3a4
Rb3g1
Ne6xb3
Qd4c4
Qf1xc2
Qh6e2
Nc5xc7
Ba5a2
Qc8xe3
Rb6a7
R6c8
Rdxa4
Ng3xe6
Nh4xg1
Qb5xg5
Bg7f2
Bg5a3
Bf1xh4
Nf1xb3
B2f2
Qf8c4
Ba6xb2
Nc2d5
Re5b4
Be8f7
Nc6b1
Nb4a1
Bh2a5
Rf5a5
Nd4a5
Bf1a2
Nbf2
Nb6h8
Qd2f1
Bh5a5
Rh1c7
Bd7f1
Nd2g1
Qdd4
Nbg7
Qf6xc7
Nh4d2
Bg8xd2
Bc7d8
Nb2xb2
Qc5xd8
Qe5a6
Rd1d3
Qd5d3
Bf8xd4
Qe3xd1
Bf1e3
Rh5b3
Nd4xb4
Rb6d7
Rd6e4
Bb4e4
Qc1xg5
R5xb1
Rc5b8
Nf3xf5
Qh7xc1
Nhb8
N4xc7
Bd4h7
Qa1d3
Bc7h2
Qd2xf4
Qf5xg4
Qh8g7
Qf7xf1
Rb6h2
Bc5g6
Be3xb5
Nh3xf1
Be1e7
Qh5d8
Bf3d2
Bb8b4
R3xd5
Na1xd4
Rg2e3
Qa2xa6
Nb2xe8
Nh1
Rah1
Ne7a2
Qc7f4
Bb1g2
Qa8g5
Rh1xa3
Bc8h4
Qg3xe6
Qa5xc4
Bf7xd1
Qcf2
Nh7xg2
Re2b7
Nh3xc7
Re1xh1
Qe4d5
Ne2xa1
Bhxd3
Be5xc8
Qe4f2
Re6xd7
Be6xh8
Re7g4
Rg2xh3
Be4c1
Qd3xf6
Nf2xh3
B2xf1
Rf5a1
Rd3xf4
Ra4xa3
Bb2xa5
Qc2xf4
Ng3xa8
Qe6c2
Ba3f4
Qf2xg5
Bc4xg4
Ne7a6
Rg4xh2
B6d8
Bgb2
Qed3
Rh8d8
Kh8
Rhxc4
Qa1a1
Rg2g5
N7xc4
Nf7xd8
Rd2
Bgb4
Nhxf1
Ng2xa1
Nc4xd3
Nb1h2
Bd2a3
Qe2xh4
Rg7d6
B2xa4
Rg3g7
Na4d1
Bd3d2
Rc4
Bga8
Bf5d3
Rg1xa6
Bf6h2
Ng7xh3
Nb8c7
Ra2d8
Qf5b6
Qh4xh4
Ra2a1
Re6xb7
Rgxe5
B6xc4
Ng6xa1
Rh8xc5
Rf6c2
Na5c3
Be5xh1
Qe3g1
Nxe7
Rg8xd1
Bg7xf2
Rh5d4
Q7f5
Qhxd1
N4xh1
Na7xg4
Qb4xc6
Qh5xf2
Nbh7
Nc1f6
Nc5d1
Bf6xh5
Ngxf7
Qg7f8
Qf6h6
Be3
Nh8xh4
Qb8xd2
Rg1b5
Ng6xf7
Qe7xf8
Rf4f5
Nexd7
Ke5
Nh1xc5
N5xd3
Ng8xh2
Rd8b4
Ba2b7
Qg4xf6
Qe6a5
B3xg3
B7b1
Bcb4
Kxa8
Bd5xf7
Rfxf7
Qd2xh5
Bg4e8
Ne7d7
Qf3xh4
Naxf2
Bc4xb6
Nh6f5
Be4d8
Qa8d8
Bae3
Rh1g1
Ra6xh5
Ne2c6
Qc3xh6
Bg4xg4
Rd5g2
Bc2xh1
Nf5d2
Bg6e1
Bfxb3
Bc2c6
Rgxb5
Rd5xc2
Bd7xd8
N8f4
Qf1g6
Ra6h1
Rf8xb2
Nb6xe6
Bd4xd8
Qh6f7
Bfxb1
Ra6f5
Bf7h6
N6h4
Rc2b2
Qd2g1
Rd5b6
Be8xd1
Bb2b4
Nb6xe1
Nh3b5
Qc6f1
Raxh8
Q8xb4
Qe3c7
Qa8g2
Q4xa8
Q1xa6
Rb2xh3
N2xg2
Rc1xf3
Rd4xf2
Bg2xd5
Nd1xh7
Bh3xd3
gxf3
Qd4xh6
Qd8g3
Rh3a5
Re4g3
Bgxd7
Nfxe1
Ra1e7
Nb3b5
N1xg7
Nd5e8
R8xg3
Nf1h7
Qf3xe5
Bd3b7
N5e7
Nf4f2
Ne3xh7
R4h6
R5g8
Nc7xd2
Na4a3
Qh2d6
Qd5xc4
Nh3d4
Rb4xh8
Qd2b7
Rdd1
N1b2
Rd7d5
Ng5xf1
Qe2xc6
Rcxa1
Qb7a8
Rg7xd3
Bb5g6
Bd3g8
Rf8xh5
N6xf5
Nb3f4
Nf4xd5
Nb4xc4
N3xb6
Be7a2
Nd3d4
Qb6g3
Bd3g1
Na2xf3
Rb3xe7
Nf3e8
Nc3d3
Qe3g7
Ra5xg7
Nc7a6
Qg1xd8
Qb1xb8
Bc4a2
B2b4
Qa3xh1
Bb2xa1
Ng3xc6
Qb7xc4
Rh3xg2
Qg2xa6
Rc1f4
Nce8
Qxb8
Nf4xa1
Ra4xa6
R5xh5
Nf8xd7
Be4c3
Ne1c8
Qd2a7
Qc1xc6
Rg5c2
Bg7d8
Ng1d3
Ra5b3
Kxa4
Qb4e6
Ng8xf8
Rd8h2
Qa8xd7
Q8xf6
Rd6e7
B1xh4
Rd3g8
Ra4xb1
bxa1=B
Bf5d6
Rg1b1
Qac1
Nh6xc5
Rg8f1
Be7xg6
Qb2a8
Q4xc1
Bg1g6
Nc2g3
Rb8xd2
Kb4
Qf6xa4
Qaxc7
Ba7h2
N6xg7
Nf3xa6
Nbe2
Qc5xc3
Nb3e3
Qa2xe5
Bg8h7
Nb1xc7
Rb4xf6
Bg2d3
Bh7xd5
Rd1c7
B6b5
Bg7xh2
Ba4b5
Qc1e3
Rb7a7
Bg5xa4
B3xb8
Qc8d4
Ra1a4
Bd7xe6
Ba2f3
Bbxf5
Bg4xf7
Ne6xb1
Nf4g4
Bg7b3
Qcg1
Ba2c6
Ba4xe4
Qc5a1
Rc1xe1
Ree6
Bc8h2
Ne8xe4
Ng5f3
N8e4
Nb1xf1
Ng2f6
Nc2h3
Qg4g6
Bd2e3
Na3xb4
Bh5b3
B8f7
Bg5e3
Bg4g4
Qb3a6
Qh5c1
B4d7
Qb1xf5
Qc8g2
Reb8
Nf3xf3
Ne4xg5
Rc4xc6
Rf3b5
B3xc7
Rg4d5
Rf3xh3
Rd5xb5
R5d2
Nh6d6
Qh1f1
Q5xf5
Raxa7
Bb7xf7
Na1xc3
Bb7e4
Ng4g1
Qh5b3
Ne2xd1
Qf1xb8
Rd7xf6
Ne1c5
Qd6g3
Ne8xa3
Rf7xe1
N1f3
Qg8b6
R3xf2
Rc1xe3
Nf5f1
Bh7g3
Qe8g8
Qf5xd5
Q1xe2
Rh1xa8
Bc1xa5
Qa5c4
Rb7d1
Nfxd8
Bh4xa3
Bb4h4
Naxc2
Qa3xf7
Qe3xg4
Bh1a2
Qh7xc6
Bh8b5
R4e1
Bg8e4
Qh7d4
Ba7a2
Bb2e8
R7xe6
Rd5xf7
Bg8xe2
Nf7a2
Ne6g5
Bh4e6
Qb4xh7
Ba2c3
Qf2xe2
Nexh3
Rh7xd8
Rb3xh8
Qc4xe7
Qb7g1
Na8xf3
Bh3xg3
Bcc8
Ndxg6
Rh8xe6
R7f4
Na7e5
Rc4f2
Rd2xd8
Rd4f3
Qc3xe8
Bc2c2
Be3xd6
Ba1xh5
Rd1xc3
Re7xa3
Re6xd2
Bb5xc8
Qc2xa8
Bb1xf5
Nc5xd3
Ncxd5
Nb2e6
Rh1xc6
Ne3xb4
Na1f2
Qb8xf6
Qd7h3
Bg8h1
R1xb5
Bg2xh5
R7d5
Re7xc1
Na7c4
Nf5xd2
Bh5xc3
Bd6e1
Q8xf7
Nc4g2
Rb3xb8
B8xa5
Bch3
Bb5xg3
Nb6c8
Qgxd6
Rd5a4
Na7xa2
Rf1xc2
Nb5xe4
Bc1c8
Na2xa1
Bh8xe3
Nh6f7
Qfxa2
Ra3c4
Ra7xg4
Rb1xf5
Qf5xe4
Qe5f3
Qfxg1
N7xc6
Ng2xd5
Nf3h3
B4xd3
Ra6c6
Ncxa1
Bg5d5
Rb2g2
Bc6xd3
Rh5xa2
Rf5f7
Bb3xf3
B7xh5
Qc3b1
R2h6
Bg7h4
Nag6
Kxh8
Rc6g1
Nf1d8
Rd6a6
Q7xg5
Rc7xc8
Rb5d1
R5xh4
Bc1f2
Qf4a6
Rd6b8
Qd8d1
Qe7e7
Rf2a6
Rb2e4
Be6a4
Ra3g6
Bg5e2
Qa2xf7
Nf4xf2
Re3c8
Bb8e1
N7a7
Qb1f3
Qg8xf5
Ng4f8
Bh2a7
Bxc8
Bg1xe4
Nb4e6
Bgxa6
Bab7
Ne8xg4
Nc6xc4
Rd5b1
Bd2xc3
Rg4d4
Nc8xc5
Ne1c6
Nf6g4
Rh1h2
Bb7xd6
Be6xg5
Ne4c5
Q4xe8
Bg7d2
Nh5xd6
Rf5xg2
Bfe1
Nd1xd3
Nc5xe5
Qa4d4
Qg6b7
Qd8xe7
Rc1xd8
Nxc3
Re8xg1
Qb7
Qf8xa8
Ra6d6
Qh7xh8
Ba5d2
Rh2g3
Bd2c2
Nfxe4
Qc3c1
Bc7xg4
Qf6xe3
Nc8d1
Rfxg3
Bf8h6
Bf7e7
Nc2xh7
Ne1xg2
B3c1
Na8g1
Nhxc1
Ra3xa3
Naxa2
Qb4xh4
Re1e2
Nfa4
Nf6xh4
Nb7xc7
Qc2a5
Rh6xf3
Qc6xa2
Qg3d7
R3xc3
Nc1b3
Bd2xg8
Qaxb8
Qa6b5
Rc4xb8
Qd2xa1
Rb2c8
Bc5xe5
Qg2xc8
Q8xf3
Qg1d1
Qg5xh5
Ra2c5
Qf5e8
Ng5a7
Bd2h7
Rg5b4
Nc3xa5
Nb2a6
Bh3e1
Nh8xf7
Q6xe5
Ng7xf5
B7xe3
Rh3xc1
Qg5xh4
Ra2c6
Naxa3
Re4xg1
Bd6xb2
Qh2h8
Bg6xb5
B6xh7
Nc8a7
Nc2xe7
Nh7xh5
Rg2a4
Rc7d4
Nd6xb8
Rc6c2
Qf3xa3
Rg3xd6
Rb7h6
Nh2xc6
Bg5e7
Bc3xa6
Ne8e6
Qc4g4
Ne3xh3
Bbxd8
Qb3f4
Qa2d7
Qa6g2
Rhxh2
Qd3xh2
B1f5
Rd4xa5
Be7
Rb6f6
Qd2d6
Nhe3
Nb1a4
Na6c7
Bexa2
Qea2
B7b8
Qd4e4
Bfb6
Nc2xa7
N2a5
B3a3
Nb5xh7
Bg2a1
Qa3d5
Qa5e4
Q4e3
Rh1xc5
Rh3xg4
Ra8f8
Bc8b1
Ra3xb7
Bg5f6
Ne6e4
Nb2g7
Na1a6
Bg8g7
Nb6h3
Nh2h1
R8xa8
Nc2xb6
Qg5xd6
Naxc7
Qg8c1
Rc5g7
Qab5
Q8g6
Rc5g5
Rc5c1
Ba2
Nb5h8
Rc2xc1
Rh4xg6
Nb8a4
Qg7xa3
Rg8d4
Bb1e4
Nb4c2
Ra8xg1
Bhg6
Nc8a1
Ne6xc1
Bc7xh4
Nf5g8
Qd1xf6
Bf7xd5
Rf6xg8
Naxe5
Nbxe2
Ba4xa1
Qcxh5
B1g8
Bb1g4
Qa2xh7
Reb2
Bexd4
Qa4g7
Rf3xh4
Bb6g8
Qe5c3
Qa1f4
Qd3b6
Qc2xb7
Bc5xf7
B8xf6
Nh7xf7
Rh7xh7
Ng3d8
Ne2xe1
Nf6xa1
R7xc1
Bd2xh3
Bb6xb6
Nf6xd2
Nc1xa4
Nf3c6
g8=B
Na7c3
Nb6xb8
Nd1b1
Qf5g5
Q1xg3
Qc4d7
Ng6xd4
Bg6d3
N1f6
Rh7xh4
B1xb7
Qe6xe8
Ng6b4
Naa1
Bg8e2
Qf2b4
Ba7d4
Rf8d1
Bd8b2
Be8d6
g1=N
Qg5xg4
Be5d3
Nf2e6
Nb7xf2
Ba5c6
R5xb7
N2d7
Nh6xe6
Rh5xd5
Be4xc7
Rc2xd3
Nf2xd3
Bb8xf2
Na4xb3
Rec7
Ba4c6
Nb5xh3
N2xg3
Bb6h7
Rxf1
Nf6xc3
Nf1a6
Rfe5
Ngxc3
Bg3xb2
Qg4xf3
Rg5f2
Qc1xc7
Rg6xd5
Rfxg4
Rf5c8
Qa8xa7
Qc5xc6
Nd6xe8
Rc2xa2
Q5xb4
Qh8xg7
Be6xd2
Be1e8
Nc8h3
Rh8xf5
Bf3xa5
Na5xd3
Bf5g1
Rge3
Re3a3
Qd5h1
Nd4xh3
Nb7xe5
Bg6xe4
Rd4xa7
Rh1xg8
Bd5h7
Rb3h5
Nh1c1
Ne6g1
Qc2xa4
Qb2d7
Be6g8
Nf7a8
Bg6xb1
Ra8d2
Bexa5
N4a2
Qdxe8
Bf7d7
Rd7g7
B6e2
Na5xa2
Nf5d6
Nh6g3
Bd4xh1
Qb6xc7
Nf6f2
Rc2g2
Rd3xc6
Qh7d1
Rcxg6
Qe3h2
Q5xh3
Ng2xb6
Qe8c6
Be2
Rb7xg7
Bb6xa2
Bd8xa7
Qe8xe7
Qe8xh6
N5d6
Rh1xd5
Rd7h7
Bg2c6
B5d8
Re6b3
Rf1xd5
Rd5h8
Ba2h3
Rf2a8
Baxc3
c1=Q
Rg4xd5
Rh5xb3
Bg3xg5
Nc1xg4
Qe6xb3
Bg5c8
Ba1xf5
Bb2xf7
Nf1xh8
R7xe8
Ra4xf3
Bg1xc4
N5f3
R7xf8
Rg8xf1
B7h5
Ndc8
Nb1h6
Ng4xd7
Qd4xe8
Nc1h1
N6xf8
Qh4h7
Rf4h8
Ba2xf6
Nc4d5
Ng2xg1
Ba8e3
Be7xc7
Bg2xc2
Qc4xa3
Nc3a8
N3xa6
Rf4a5
Rh4xh6
B2a1
Qe3xf4
Rf5d7
Rb1xb2
Rh6xc3
Re7xg8
Qb1g8
Qb8xe8
Nf3g1
Rf3xd1
Ra3c6
Rbc3
Qh8xd3
Nc5e4
Qh6e8
Bc3h1
Nh5xb5
Nb5xe3
Ng1xf3
B4xd5
Qe7xb4
N1xb2
Re3xc7
B7f1
Rb7e4
Nc5d6
Rh1xa2
Nf2xg2
Qc1h3
Bh2f5
Qh8e6
Rb4h5
Qd7h7
Nd1xc6
Qbxc7
Q6xd5
Nxc5
Nc4b6
Q4xd4
Ba1a3
B6d6
Nf3a5
Ng6xc7
R3d7
Bg2xg5
Bg7xa3
Qh4f4
B7e4
B4a7
Bf5g2
Qa5f3
Bc3h2
Rc4xc1
Be3b4
Qd3h4
Rf1xf1
Rg3g1
Rd6f3
Qe8xg5
Qg5g6
Qc3xh1
Qch2
Qa8e5
Qd2a2
Qh3xf1
N7d4
R7xe4
Nh2a5
Nc7e7
Ne1a6
Qh5xb3
Q3xg6
Rca5
R4a6
Qg3xc1
Qb8g4
Rf7f2
Ba8c7
Rg7xe6
Bc5d4
Bd2g6
Naxa4
Nf7xf5
exd6
Qg3h3
Rb4xg8
Nd2xh2
Ba7xd1
Bh4xd7
Bb5xf4
R4xh8
Ndxg1
Nf8d6
Qe5d3
Qa8d3
Qf1f4
Qe8xe3
Ra8xf1
Rc7h4
Qa1xd8
R3g4
Na3d7
Na8b5
Q4xa4
Ba7c1
Ncd6
Qd8xh8
Bc5h2
Nd2xa1
Rh5b4
Ne2a4
Ng1xb5
Nc4xe5
Q7xg7
Qd5xf8
Bg7b5
Rd4f4
Ne8xd1
Re2xb5
Ra7xf2
Bg1xh2
Ne5g8
Qb6c7
Rf7xf7
Ra2xa6
Nfh4
Nec1
Bfxc6
Bd3xa4
Rd3b8
Qc8xd6
Rf5xf6
Q4a7
Qd2f8
R3xb6
Ra4b5
Rf7d2
Qch3
Qb2h8
Rf1h5
Nb8d6
Nh6xd8
Qg8b4
Qf4e6
Qc6f8
Ba4xb7
Qa3g5
Qfd7
Qe2f2
Rf8a5
Rb3f4
Rb8g7
Qe8e1
Nfh6
Ba5e3
Ba5xf7
Qe7h2
Bc1xh5
Raa7
Qa4b1
Ndxd5
Qb5g6
Qd5xb6
Bf6d8
Rca3
Qe7xe6
Bf7e8
Bc4xc4
Bh5g1
Qf6f8
Qa2e5
Qe3xh8
Qa3xc1
Qf1e5
Qd2xf5
Qc7b3
Qc7xg4
Rba2
Nb3xe6
Rh2xb2
R8a6
Rg4d3
Be1f5
Nh7xb2
Na4xf6
Ba6g5
Rc6xe8
Qe8b3
Nd7g8
Qgxb2
Q3xc4
Kd1
Bd5xh6
Bb4xc2
Qa2g1
Rxe4
Ng4e3
B7e7
Ne5xh2
Qd6h1
Nca8
Ba8b7
Qa5d7
Bh1xb5
Ng8b6
Qe8xe5
Qd8xg5
Re1g3
Nf3a1
Bf7b2
Nc5xa5
Rgh5
Rf5xd8
R6e3
Qc5h7
Qb6xe5
Qe2h5
Qc6f7
Re5c2
N2f8
Qc6b8
c5
Na7xh5
Ra1g5
Qb1g7
Nf7xd3
Qxe8
Rd1xe3
Bh6xc1
Rae8
Qb7d3
Bd1xg4
Qd2xb6
Nf7e1
R7e7
B8xc8
Bd7xc1
Rh1h3
Bh6xg2
Nh2xe1
Qd3xf1
Qd2xf2
Qd8xe5
Ne4xa7
Bb1a6
Bd4xa1
Bc4h8
Ba7b5
Nh1f2
Nh2xh8
Rf7xd7
Qaxb6
Be2xg7
dxe1=Q
Qd6b2
Nb6xb3
Qc8xa8
Q8h1
Qe8f2
Qf7xh3
Rg2f3
Ra5g7
Qh3xb8
Qf7xa3
Nf2e4
Qh2f6
Nb4d7
Bh8d3
Rh7xc5
Ra4b6
Nag8
Ke7
Rg3xd1
Ng8a1
Rd2g7
Bga5
Ng2xa8
Na2e1
Rf7f4
Qf1d1
Qhd8
Rh6c4
Na2a6
Nd1g6
Rc4xc3
Rg3xe4
Nb5xa5
f3
Rb2a1
Nb8g6
Qc1f5
Qa5f5
Nd4xe3
N6e2
Rbxe3
Ra4xh5
Qa6xb5
Bgxc3
Qg6xe8
Ne7xf4
R4xg6
Nd3xb7
N2xc7
Q2xh1
Ba8f6
Rb5a8
Rg7b3
Bbxa3
Ngb8
Ngxd3
N4xc3
Qg8xf6
Na6a3
Ra4d2
Rb4xh7
Q8xb1
R8d5
Bf4xg1
R6xc1
Rb2h3
Qb6c4
Qf1xe4
Na3xa5
Nb5b1
Rh8h6
Nf2b2
Nc8xf6
Qc3xd5
Bc1xa6
Bae7
Nb3a1
Q5d6
Qf3b3
Qf4xa6
B7xd1
Qd6xb1
Q7c4
Rh4e7
Bh4c8
Rd2xb3
B2xe1
Na3c4
Ra4xc7
Rbxh8
Rexb1
Bd1g7
Nd8xc5
Nb4xf1
Bd2e7
Qg1xh8
Qh6c5
Bc6g7
N3e5
Nbxe8
Rh3h8
Ne5a7
Na7xh2
Rb2xh6
Q1g4
Rg6
Na3f1
Nc3d8
Bb6a5
Rg7xc7
Qhxe2
Rc4xg8
Qxd5
Bg3xe7
Qc8a5
R2e8
Qd1xa6
Qb2xd7
Qf3xf4
Qhxc1
Q1xg2
Qc5xa6
Nd1f5
Nh3xd8
Re8xc1
Bc5xa5
Nba2
Nh8g7
Rg2c7
cxd5
Bc6e1
Be7f5
Nbh3
Nc2b4
B5xb3
Rd3xb2
Rf2xd7
Q8xf5
Rg5f3
Qg6xd6
N2c6
Nb3xd2
Q3xa2
Qexf4
Bf5xd6
Rg2xg7
Nd7h3
Qc7xe2
Bdxe2
Ng4xe2
Ne3xa3
Qe3xd5
Ra8xf8
Bc8xf7
Bg3h8
Rbxd1
Ne7xc6
Qh6a6
Qg1a1
Bc8xd4
Qh5c4
Rh8a3
Bbf1
Bf8h4
Ne1xe2
Qf4xg1
Bd8xc1
Bh1xf6
Bg3xc3
Nf4xc2
Nc4xe1
Rhxc3
Nb1xc2
Nhf1
B7h2
Bd7xd5
Nc3a1
Qe6xa8
Nf2d3
Qh8xe1
Qb7xg4
Be3xe1
Bh1e3
Rd5xd8
Rb3e3
Rd6d1
Rc1g6
Bf4a5
Nh1b3
Rh2c4
Qa7f8
B8xf2
Qh5h6
Rg8xa4
Rh3f2
Nc6c5
Qh6h2
Ba3xd2
Bh5e6
Rg7c3
Neb2
Ne4xf6
Nda1
Bb5e4
N6f7
B8b4
Qc8xb4
Rc6xa1
Bf4g6
Bb4b2
Qdg1
Nd5d6
Rb5xb8
Nbf6
N3xe4
Rh4c1
N2xc8
Rc8xg2
B8xg4
Ba7d3
Kxa5
Nh5xd4
Rb5c7
Ng4xf2
Bg6a5
Bc4a6
Nf2xe7
Nh8b3
Qc8f5
Rb8xh1
Nf1xc5
Rg7xc6
Rdb5
Ng4c4
Qd8c2
Rh4h1
Bc6xh1
N6xa6
Nd4e3
Qg1h8
axb8=R
Qh4c4
Qc3f4
Bf5f6
Nhh6
Bf5xd3
Bd2xc4
B5c5
Ra5xe3
Rb6xe4
Nf5xb4
Ndxa6
Ng6g1
Q8xa5
Qa5xd6
Q4h6
Nhh5
Re6g4
d3
Rh8xa3
Rb6g6
Qh4xb8
Qg6xe3
Bc3g2
Ng7xa1
Qf2xg7
Rh8xb7
Ba7e2
Nfa7
Nb5c3
N2xe6
B5xg1
Nd4b7
Nbxd1
Qf5xa5
Nb7d8
Nd4xg6
Be4b1
Nh4e2
Ba1xc1
Nd7f7
Bc5xc7
Ng5xg1
Be6a7
Bc2xe2
Qb3xd2
Qb2e1
N2xf5
Ne3e4
Qh2xg1
N6a6
Nc2xa5
Qb2
Bb7e2
Bc1xg4
Nb8b1
Ra1xb8
Rg2a2
Ng6f3
Rg8f8
Nf8f1
Qc3f5
Ba8a3
Ne1e5
Nh1xb7
Rd1d1
Na3xa3
Nf3xc2
Bc4xh2
Ba2h1
Rg8h6
Qe5h5
Be3d1
Qfxc1
Qh2xc1
Qe5d7
Rc8xf4
Bc3a4
Rg5g2
R1xe5
Bd3b8
Ba2xg6
Ne2d6
Rfxa7
Qg1f3
Bh1xa8
Bd5xe1
Qf8g5
Qb5xe1
Rd3xg5
Bf1xc2
R2g3
Qb8c4
Ngg6
Qe3c1
Ng6xe2
Bbxc3
B7xa5
Kxc1
Rb8xf5
Bg7xb4
Qh1f8
Bh6xh4
