Rd8b6+
Na5d4
Rf3xa7#
Qf1xd7+
Rf5xg3#
R6xg1#
Bhxc7
Nxa3
Qe3xg2
Nbxf4+
Qb2a2#
Bc4g8#
Re1f8+
N1c5
Qd4b3
Ra2xc1+
R5e6+
Rf8f3+
Qg3h7#
Rg6e8#
Qbxd6+
Rh8xb2+
Qa5xh4+
Qd5xd4
Qe8xe2#
Bf7xa8#
Qf3xc4
Bf8xc1#
Qc5xa6
Qch1
Rf6xa4#
Be3a5+
N4f1
Qh1d2+
Ba1xb6
Nf4xd5#
Bd1h6
N2d8#
Rh1f3
Qc6xe8
Q5g2
R3xg3+
Bc1xf8+
Ng4b6
Bd4h8
Nb3xh4+
Rgg1
Bd1c3
Qh1d1+
Nf1g5
Ne3f1#
Ba8g7+
Qd8xh2
B4xa7+
Qh8b4+
Qf5xc8
B4e2#
Qh1xa3
Qe2xb7#
Ng7xd6
Nf2xa5+
Qd1d7
Rd5g7#
Be4d1
Bc6f5+
Qa6h2#
Bc5c6+
Qgxd5
Bd3xc7#
Q2g4+
Rd8h2+
Qd7xb5#
Qh8d1
Qh3xa5
Rc8xf7
Bd8c2
Bch7+
Bd1xf1#
Ra3h2#
Qe3xf5
Ra2xh3+
Qbd2#
Bag1+
N8f6+
Q5xb4#
Qfb4
Qc1xg3
Re7g1
B8f7#
Bg8xe6#
Qc4xh1
Be5xc8+
Rf8xd8
Ba2c1#
B8xh6
Bh8#
Qa8xh6
Qe6f2
Bh1xh1+
Rc1xg8+
Rhb6+
Re7d8
Ne1h2#
Ba2h3#
Bba4
Rh5d2+
Rf1xa4+
Nh4xe6#
Qg4h5#
Bc6xb8#
Na3a1#
Bd2xe6+
Nf8xe7
Bb7xg8#
Na3d7+
Qe3g1
Bbxe5+
Rbe2
R2xe5
Be1xc2+
Re2xh6#
Q6f2+
Na1a6
Nh6e3
Bf7#
Rfb4#
R6xc3+
Be5b5#
Nh1xb6+
Nd4f5+
Qc8f5#
Raxe4#
Bg6b6+
Bb2xa6#
Ne2g1#
Bd5b7
Rc5xd2+
Re7g4
Ne1c2+
Qhxb6+
Ng4f4
Ra4xa1+
Q8xg2+
Rc2xb5+
Bg7f2#
Bf6a4#
Bch6+
R7xg1#
Re8xa3+
Na6xc1
Re5xe3+
R4xg2+
Qe8xc4
Re6xh7
Rd5xh3+
Nb5xd6#
Nf5c8#
Be8xb7
B8xc4
Bf7xe7+
N4f6#
Qdxf6
Bf8xe7
R2xh1
Qc8f4
Qc7xg6#
Bh6xd2#
N8f2+
Qhxg8#
Nf4h7
Ka5
B2c1+
Q2e5
Qd4xf3
Qbe1
Rb5g4+
Bb3xg2
Nff1#
Nh7g6#
Qd2d6
Qbf3#
Qc2e2+
Ra5xc4#
Rd5xc6
Bh1d2+
Bg4xd4#
Nf8b2+
Bh6b7#
Na2xc6+
Ncxc7#
Qg1h7+
Qg5xd7+
Re2h8#
Rb7xe2+
Qa5xa8#
Bce8
Bbc6+
Ng5c5#
Qf8b8#
Bh3h7
Ne3g8#
Qbxe5#
Qh6b7#
Bf8xa3#
Q8d6#
B1xf6+
Q3b6+
Ra2b3#
Ne7xa8
Nc7f3
Qe3h7#
Bh2xb8
Nh5f1#
Rg5e6
Na6d3#
Qf7xc3#
Rg3xb5#
Bcxa7
Nb3f3#
R8g3
Bh2xa6+
Bbd1
B2e3
Bd1xh8#
Ng8xd1+
Qg4xe7+
Nea7#
Bc3d7
Bhxf8#
Nf1e2#
Ngxd4#
Nb2g7+
R1d4+
Ba6c7
Ba6h2
Rcd7#
Qdxe8+
Be4a5
Bc5g8+
Nb2e3#
N5xd3+
Qf7xh6
Qf1xg3#
Qd1xb3#
Q7xc4#
Rc4xd8+
Qh7xd6#
Rd7h1+
Bgxe7#
Re1xd3+
Qf5xg1
Bc6xh2
Qa7xa3
Re1d6
Rexd1+
Nd7c5#
dxe2
Qh3h6+
Nb1xa6#
Rg5d6+
Bg5h7
Ra1h7
Bg6xc8
N7xa7
Rf5c6#
Rf5xb5
Re1xb6+
Nc8xe4#
Kxe6#
Rb1f5
Qd3e6#
Rb3d6#
Bg8xe7+
Rde1#
Rb3xe7+
Bxf7#
Nc6b1+
Qh1a4#
Rag8+
Q4xg8
Rd3xe4#
Nh3f2+
Bc3h5
Bg6xf3#
Ne6xd8
Rf8xc1
Bc4#
Nd8h7+
Nbxb6+
Ng5#
B2f1#
Ng5xh7+
Bg4c6#
Bg4xd8+
Ref6+
Rh2e3
Ra3d4+
Ra7h6+
Rhxf2+
Ng6h6#
Bh4h7#
Rexc2+
gxh2+
Q4xe8+
Ng1xa4#
Ne7xf7#
Nb7xe5
Qc8g7
Rd6xe3
Qb6xg6
R3xg5
Rh7d6#
Rb7b8
B2c3+
Qg8g5+
Rf7d6
Rd3d8#
Bc4xg1#
Rc6xb8#
N8c2+
Nd5c8#
Bd6xh4
Bd2xb4
Rb8xh3
Nc1h8
R4xe2#
Be8xh6#
B3d8
Nh6xc8+
Re4e4
Bg2xa8#
Rd3e6+
Bg4xh1+
Be6d6
Bb2xb2#
Rb2h2
N6f4#
R4f1#
Ra8h3
Rd8f3#
R6xg3#
Na2f5
N1xb3#
Ra5xa8+
Bf4e3+
Qf7d2+
Bc4a4+
Nh6xd2+
B4xc6#
Qg2h7#
Qg4xh7+
Bg1a5
Re5xf8+
Bh7g4
Qf7a1
Qh4d4#
Bh7xa2+
Qh4xg8
Rb4xh7#
Nb4xd1#
Nd2g2#
Bb1h5
Bb1b1
Qcc2
Qh2xb3+
Qa8xf1
Q3g1
Be7g1#
Na5xb4#
Ra3xh2+
Nb2f4+
Re4#
Qb6xc6
Nb8xf6#
Nd3xf8
Bd7xb2+
Ne6h1#
Qf8xg5
Qbf4#
Ba5c4
Ra1f7
Qf1xa6+
Bg7h7
Rg2xc8+
Nd7d8
Bb6h8#
Na2f8
Ra1xc2#
Bg1h3#
Nc5xd5#
Qb7b7
N6xb7
Nf3g8#
R8c5#
Re2xb5
Qg7xd3#
Qc4d8#
Ba3e6+
Ne4h6
Rg5h8
B5xd2#
Nc7g5#
Qf4xa3+
Qd4b1
Ne8h8+
Bg7h7+
Qh2a6+
Qd7e5#
Rd6xd2
Ne1a6+
Q4g1#
Bc3xf2#
Rhxf1#
N2b2
Rd3xg2
Rh1xa8#
Re8xf4
Bb4xa1+
Nd3xg3#
Na7a3+
Qh2c8+
Bg3a7
Bf5xf7+
Qd8xf4#
Ne4xd4
Qf4a8+
Bg3d7+
Ng7g8+
R5h1
B2c8
Qg5a5#
Bg1xc7
Rcxg5+
Nf4xh4#
Rb1xb5
Rc2xe2#
Ra5g4+
Ng8#
h6
Qe4xb5+
Bg7xg7#
Rb8xd8#
Rh7g1#
Nd1xa4#
Bh2xb3
Nd3d4+
Bg3xa2#
Rc3xc6
Nc5xc5#
Re6d6#
Rh7c1#
N7g7#
Ra4xg3#
Bc4xe2
Nh8xc8#
Rh5xa1
Bc1d4#
Ra8xb5+
Nfxd4#
Rbxg2+
Qb7xg6#
Qbe4#
Qb1h6#
R7xc6+
Rf7xf1
Q6xh7
Bf5c6+
Be7f3#
Rd1c7#
Rf4xh8#
Nd8a3#
Nhxc8
Bxf1#
Rg5h1
R7c5#
Qb4e2#
Nf8e1#
Qe4xg3#
Qb4xg5
Bb3xd4+
Rg3xg2#
Re3xh2#
Qe6xg1
Rh3xc4
Be4h1
Nc3a5#
R8b4#
Rc8c2#
Be5xb8+
Qb6xe8#
Ra6e8
Rfb2
Bh5d2#
Bd8g6#
Nd1xc5+
Qdxf2#
Nb6g7
Ba8xe2
Ba5e8+
Bg4e2+
Qf3e1+
Ng6xg3#
Rbxe5#
Rb3h1+
Qa3d1
Qa8a1
Qe2h6#
Rg7xg8#
Bb8xb5#
Na6g4#
Qc4b5
Qd4xd5+
Bg5c2#
Bb2xe1+
Rf6c2#
Ng7xf8
Qa4xe8#
Rg3xf5#
Rd2d8#
Qgxb7+
Ba8d8
Bd8xc8+
Be6g3
Ra5c3#
Nb3d1
Nh8#
Bc6h8
Nxf2#
Nh5h8+
Q5xg4#
Qfh2+
Bd1d8+
Nf6xa2#
exf3#
Qg6c5
Bh5f5+
Bh5xf6
Qb5xg8
Ng8g4
Nxh6+
Bc5xf1+
Nd6a3#
Bb7xe4
Q5f1
Qh4xe1
Nc4xd8#
Rcxe3#
Qa6g4+
Qe8c5+
Bh5f3
Nf2f6+
Qag5+
Qg8f5#
Bd4
Ncxb7+
Bgxh2
N1c4
Bbxa3
Nf3xd7#
Qe6xe7#
Qc4e3#
Nd7xd6+
Bf6a8
Rbf2+
Ng5xe1+
Na8b7+
Ba1xf4#
Qe2xe3#
Rd8xb5#
Bg8xb8#
Rc5h8+
Qf3c2+
N4e7
Ng1xf2
Rh6xg4
Nb4d1#
cxd2+
Qb2xd5
Bd7d5#
Nb5xc7#
Qg1xa4#
Qh5xg5+
Na3e5#
Bg8g5#
Bc1xd2+
Qe5xe2
Rf8g3#
B7h8#
Ng5xf7+
Rc8xc8#
Kxf8+
Qa7d3
Rg2xa3
Rgb3#
Q4h5#
Q5xc2
Bg5a8
Bg7xd3
Bexh8
Qb4h3+
Qd6xb4+
Rgxd5#
Bb2xc3
Rh6c8
Qh2xe8
Bh6h4#
Nhd7#
Nb8xa4+
Rg7xc8+
Bc8xc6
Be3xf7#
Bc6xd6#
Nh8c6#
Rh7b5
Bb6c5+
Ne7e7+
Qa3a8
N4xg8#
Naxa6#
Bb8xd1+
Rd7xf8
Bdxe7+
Bb6xh6
Bf8a1#
Ra8c7
Bc5xc6+
Bb7h6
Nce5#
Nd4h1
h1=B#
Ngxg2+
Qa7xb1+
N7d1+
Qd3a2+
Be3g1+
Nc2+
Nb4xc5
Bc5f6
Bbxd8+
Rg3xf1
Be2a8+
Qe7b4#
Qd6a4#
Qa2xf8+
Ba1e6#
N7xf1#
Bg6f1
Nb2e7+
Rc7xf6+
B1xf4
Be5xb4+
Rg5xg7+
Bc2xf7+
Bg8xh1
Bhxh5#
N7xa3
Nf3h8
Ba4xc8+
Rc1c6+
Ne6f3
Ng3xg2+
Qh3h7
Ba6d3#
Rf4xh3+
Rc8g5+
Rh2xh4#
Be3xe2+
Nb3e1+
Na4c2#
Ra3e2
Bgxa3#
Be1xf6+
Ra7g7+
Bb6g2+
Nxf7+
Nc1h3#
Ba5xb5
Rf8b7+
Ne3f8+
Bg4xh5+
Rb7xa1+
Nh5xd7+
Bdf8
Rf3xg6#
Bg6xf8+
Rgf3+
Rh3h3+
Bg1h3
Qd5b2#
Na7xd1#
Nh8xh4#
Qxd3+
Qd3d2+
Rcxg4+
Bf5h4#
Qg7xd8+
Rh3h5#
Qc5f2
Qb6xh5+
Na3d7#
Qf5b3#
Qg7xg4
N4xf8+
Be4xf3#
B5f2+
Qh6xc2#
Nb8f6#
Re6xg3
Rg8b5+
Bc1f5
Bfh4
Q1d2
Bc8xc7
Be8a7#
Nbb2#
Q8h3+
Qd5xe8+
Na5a2#
Bg2d4#
Rb7xc7
Nbxd3#
Nd1xa1+
N8e4#
Qh3e5+
Bb3xf8+
Na4e7+
Qg6xd7#
R1h4
Bg4xg1
Ng1xg8+
Qc8a8
Rhd5+
Qa4b3#
Ba3a6
Nd5c2
Rh7xf7+
Nd7b8
Bd3e3#
Nd2e4#
Nd2xg7
Qd4xe1#
R1xa6#
Qd5c1
Rg1c5#
Nbxf5+
Bf3xh1#
Bc3a4
R7d3#
Qh6c3+
Q6b6
Qg2xg8+
Bc2h8#
Rg4d2#
Be8c6#
Qah2#
Na7xb1#
Nh6xe6#
B1xd7
Rd8xd7#
Rf5d8+
Bh4xa6+
Bch7#
Nhc3+
Bef4+
Ng1xe8
Qa1xd5#
B8b1+
Bg3xd7
Bg3xb4#
Rb7g4+
B5f2#
Rg5f4
Ba3xc7#
Nc3xd7#
Qh5xc4+
Bf7b3#
a7+
Bf2f4+
Bb6f6#
Qg3xd1
Bxh5+
Qf5xe2
Rb1xd2
Rb6xg1#
Ng6h1#
Qf1g2
Rd2a4+
Nfxc8#
Nd6b4+
Nb1h8#
Ra3c6#
Ba4h6+
Rda1
R1xc1#
Qd6d6+
Nd2d1#
Bf5xb3
Bb4b2+
Nf8xd5#
Rh2f5+
Ncxa5#
N8xh6
Nb1e5+
Re6xa8#
N8b4+
Qh1c7+
Qc8xh6+
Bh5a5
Qe8c6
Rf4c5+
B6xe6+
Rh5g2
Rd5f5+
Bb4xh7+
B1a8+
Bg7h1#
B1e1+
Be2g6+
Nd3g4
Qc1xd4#
Rf7xa7
Bh8a7
Bf4h3#
Qe4d7
Rfg4
Bc5xd8
Qd4g4
Bh7d7#
Qe8xb5
Bc2xe3+
Q4g4+
Bd4xb5
Ne1f7#
Qb1b5+
Rh8xc3#
Rd4e4+
Q6xh6
Rb1xe8
Rf8d5#
Rc7d4
Ng4xd3#
Ng7xf2+
Rg7xa6
Ne2c5
Rg4f8
Bc7d6
Bf2xg1#
Ne1b3#
N7xg1+
Ba5xf4#
Qe3a7
Nf7b2#
Qd1d8
Bb3f3
Bc4b4+
Ra3xf6#
Qf1xd8#
Nd1xa3
Rf4f4+
Nf6e4+
R5xd4#
R8g8+
Bf2f3+
Qb4xg8+
Ng4xa8
Qf3xc1#
Ne3a8+
Rh2xe1#
B2xh2#
Bh6xb2+
Qf4xb4#
R8xe5+
Ne7g6+
Rg1xa7
Nh7xh5
Qg5h1#
Qc3g1
Nd7xf2#
Rf3g5
N7xb5+
Ng3xd5+
R1f2+
Re2xg4#
N4a1
Rd6xg8#
Nb1xa2#
Nb3xf1
b5
Qa3b5
Bh5a8+
R5xc8
Qa5xa5
Qa7h3#
R7xf1
Qh8a2#
Re4h3#
Bd3f6+
Bf2g5#
Na7xa3
Qc8xe5#
Ra1b6#
Qxc3#
Bgg5#
Nf5f7#
Bch1
Nb7xg5+
Bc4g8+
Qd6g4+
Be7xe3
Bd5xf2
Nc7xg1#
Rc5xc5#
Qg7f6+
Nah4
Nd4h7
Qa6xa4#
Ng6xb2
Qd6xg5#
Ne2d3#
Rxh1
Rb6b6#
Qd1a7
Rh1e3#
Bf3d1
Bf2h7
Nf1b5+
Qb5xa7+
N6xh4#
Na5xb6+
B1xh7
Qh1f7+
Ne6c7#
Ra4xf6
Bd7xb7#
Bb2xd8
Rh2a5+
Rg1xf5#
N4d7+
Nf7
Ng1g2+
Q6h8
Nf6a5+
Be6e7+
Bg8f2+
Ne2xf2#
Re2g6#
Qe4xc8
Qf5c1
Rg6xe8
Rg5f2#
R6f6
Bc6c8+
Bab8#
Be1xc7
Bg2xg6+
Nbxf3+
Qf2xh8#
Rf3c4
Rah2+
Ne5xa8+
Nh8xa6#
Qc4xb1
Rd6xa3#
e5#
Qd8d5#
Qe6h1
Ba3e8+
N2c1#
Bc2f4#
Qf6f5#
Bd2xg2#
Re3g2#
Raxh5+
Nh8xc7#
Ba4a8#
Bf1xc5
Qa2xb7#
Rbxe6#
Qd6f7
Qb6xa6
N1xf8
Qe2b5#
Qc5b7#
R2b6#
Nc1xd4#
Nf2d5#
Na8xa1+
Ba6xg6#
Rb3xh2+
Bg7c7
Nfxh8
B3b6#
Qf4c6
Rh4c2+
Re8f4
Rh8g4
Qg2e2+
Rd5d7+
Red5
Rc8f7+
Rg5xh1#
Ra3g3#
Rc6xg7+
Bh5xg4#
Qb4g3+
Rd2c7+
Ne4xd2#
Nh1xa7
Nb3b2
Ngxf6#
Qb2xh1
Rg7c8
Bf7f6+
Ba6a1#
Bhxf4
Naxd8
Qa5xg6+
Raa5+
Re8xf5
Bf3xa5+
Be4xe2
Na8d5
Rf8xb7
Bcxb2
Ba8h1+
Qf7xg7#
Nf2g1#
Bc1d1
B6xc4
Rb6b1#
Rc2xb4
Qxe8+
Rf5f6
Bgxh8+
Ne2a1
Rc1xg4+
Nb1d5+
Qg3b6#
Qeh5#
Be7d6+
Nfxa1#
Nh8xb3+
Bd4xa4+
Qf5xa1+
Re2e6+
Nd1a6+
Rb7xd7+
Qd5xg1
Rf4h7
Qb5xd8
Nf6d8
Ba5xd2
Ne8xa6+
Ne7f5
Rc7c1+
Bb5xe7
Bc2f6+
Rd3e2+
Bh7xg5
Nd2h4#
Rg8xh5
Beh4+
Qc2xh1+
Bc7xe4
Nf5a3+
Qg8c1
Na7xf8+
Qh7xh4#
Qd1xe2#
Rf7xe3+
Qcxe4+
Ng4#
Ng7xb3#
Bb3
Qe3xb7+
R8xg1#
Rf3e3#
Re4xf1
Qg5f1#
Qfxa8
Qf2d1+
Na7d2#
Nh2xe2+
Rfd2#
Rh8xe8#
Ba3d3+
Qg5e4+
Qb3xa5+
Qb5c4+
Qe7c6
Rf4xa3#
Rg1h6
Nh2a2
Nh2d8#
a5+
Qe6b1+
Ng5h3
Q6b1
Qg1xf2+
Qb6a2
Rc5a1
Rd5c6+
Ng7xe5#
Ba8c5
N6g1#
Q4g1+
Qc3c5+
Rh1xc8+
R8xb5#
Be8e6
Rg5xf6
Baxd5+
Bc6h5+
Bc5g7#
Bg3b3+
N4a2+
Rf6xc8
Ne2xd6
Ra4xf4+
Nd8e8+
Bf8xf3+
Be1c7
Bb1xh7#
Qh2e2#
Rg6c7#
Re2xh7#
Rc8h6
Ngxd1#
Qh8xe2
Rb6h2+
Bb5xh1
Q7xe5+
R7e8#
Ra8g8+
N8f4
R4xb6
Rg8d4
Nb3xd1#
Ra7xe8
Ngf7
Rh3g8+
Bd8f4#
Na5c2
Bg1f4
Nb6e2
Qb3e7#
N4g6
Qe4xa5
Qg5f7
Rc3xd1
Qe8e6
Ra3xa6+
Rbd4+
Qc3b8#
Ne2xb2#
Nb2xe1#
Nf2f2
Ra4xd4+
Nc5xe4
Qd4xh7+
Rg3g3#
Qg3d1+
Bd8d1
Qa2g4#
Be1e2#
Ne2xg1#
Qb1xb3#
Qe6xf3
R5xd1+
Rd5d2+
Nh7c1
Re1xb5
Nb6f2
Qa4a3
Rh5b1#
Bf2a6#
Bf3g8#
Nc5xh5+
Rh4h6
Ne3xe5+
Rg6xd4+
Re4g1#
Rg5h7#
Rd4d6
Nd3d2
Rb4xd4#
Q2xa2
Bh8xg3+
Bh3e4#
Be3xb2+
Nb1f6
Rcxh5
Bg2e8#
Ne4xa2+
Qb7xb4#
Ra7h4
Bg7xg1+
Ra3xe5#
Qg4xg6+
Bb8h3#
Bh1c4
Qe7xc6+
Bh5c1+
B6xh5
Qfe1#
Qfxg1#
Qf8g1#
Nb6d5+
R2xe6#
Qe6xg2#
Bf8xf2#
Nc4xb8
Qg3xc2#
Rb4xb3
Nh6d3+
Rg4a1#
Bd1c8+
Ng8xh2#
Nf2d1+
Nc7g7
Rd5h6#
Rg8xf5
Rc6d6#
Rf3xg2
Nd3xc8
Rf6xh1+
Qd8xc2#
Qda1#
Qh5b4#
Rgg8#
Rg8xh3+
Qh1e7#
Rf8f6#
Bb5f1#
Qe5xb6#
Qa6xe4
Bc2c5+
Ba7b2#
Ne5g3+
Be6xc3
Rb4e6
Bh7xd4+
Nxb5
Bd2xg2
Rd4g8
Qb5f3#
Bd8g2#
Bh2xa5+
Qd1c2
Rb2c1#
Be2b6#
Qg3e5#
Bc8xd1+
Bh4f2
B5h7
Bc5xg3
Qbxa2
Rh5xh2#
Rg8h4+
Re4a2#
Rg3a8+
Qe2d3+
Rc8xf2
Rh8xf6+
Bh7e1+
N5xh2#
Qh5xa8
Qf8a3+
Nf8xg4+
R7xh8+
Nb7d1#
Ne4d3
Bf3xd2
Qa7xb8#
Nb1xd6#
Bf6c8+
Bc6xf4#
Qd7e8
Rb7xg7+
Nd6xe6
Ra2xb6#
Qb4xa2
Qd5a4+
Na4d3+
Qh7xg3#
Rb2c6#
Be1h6+
Ne4e6+
Rhh5
Rc7c5
Rc7xh5#
Rh3xf8#
Bh3xf7#
Nb2xa6
Bc6xd7#
Ra5g7#
Ned2+
R6xb8
Rf2c4
Nf3xa4#
Ba7c3
Ng8c4+
Qcd4+
Ncc3#
Nf7xe3+
Rbh5
Qh8a7+
Bg4xh2
Nef3#
Rfxd5
Qe8f2+
Bc3h8
Rd2f4#
Rf1g1#
Ra7f4+
Bhg7
Nb6d2+
Nc1xh1
Bg5xh5#
Re4h4#
Re5a4+
Rc5h4
Qa6d8#
R8f7+
Nc8xa4+
Nh8g2
Bfxc2#
Nh2xa1+
Nf2g8+
Bc1xe7
Rc5xa3#
Nd6h5
Qe5xa4#
Ra3xe7
N6e8#
Re2e8#
Qh2xd7
Re6xf8#
Ne8h6#
Qf3xe2#
Rc7xa7
Ng5xf3
Raxa3+
Rc3g1
Nc6c2
Rf2c6#
Nd5xe2
Bh6xd7+
Be6d7+
Nf6c5#
N2xc4+
Ndxh7
Rh6c1#
Qd6xe1
Beg5#
Ra5g5#
Nd1d8+
Qe2f3#
Bc3f2+
Qh8xc4+
Rd3g8+
Be3xd5#
Be2xg8#
Bd3c1
Nb6h2+
Bh5h7+
Bd2e8+
Ba3d5#
Rg4xd2#
Be5#
Ned3#
Re5xc7
Qbh3+
Rd7xa1+
Ng3a6
Q4xh8+
Rh6xb6+
Ba8xc4+
Neh8#
Bd8b8+
Bd2b4
Ne3xc7#
Bd5xa4
Nh8xc1+
Nc1xd5#
Nf1xb5
Ra6e5#
Qe5a3
Bf4xf6#
Qf3xc6
Qb5d1#
Re6xb2+
Ra7b4+
Rcxa5
Nc7xb1
Bd5a6+
Naxa3+
Ne4g6#
Qb3xb8+
N6xg1#
Bc1h7#
Q5xd1+
Qf1b7
R6b2+
Rd2xg7+
Nb2h6+
Q5xc7
Rf6b7
Bh8xa3+
Bf5e4
Rh7c8
Qc1xd6+
Bd1xa1+
Rb4xb1
Ra2e8
Ng4xe5+
Nh7xa2
Rc4c4
Be3xg3
Rf5e5
N8c7
Na8d4
Na8f6#
Qe8f2
Bh3h6+
Bc6g2
Re4b2#
Be2xb4
Bf4f3+
Qe8xe1
Qc2g1+
Ba7a2+
Nd1xc7#
d1=B#
Nb3e8#
R7xd2
Bd1xf2+
Rd5xh7#
Nbe8
B5xf2+
Re8b6+
Nh8xa7+
Nc7xg5
Rb1d8#
Bh8h6+
Qb1xg2
Ba1xf4+
N3d1
Rf2b7
Nh4xg8+
Na4xb7#
Qb2xa1
Nd2f8+
Be2h8+
Ba6b7
Bgd7
N6c1
Raxb6
Bh8h8#
Qxe4+
B8xf6#
Ra1xe1#
Bf6xb7#
Ba7c6#
Bg4g4#
Qbxe7
Nd5xf3+
Re2c3
Nd3d1
Bb3e7#
Ng1xf3#
Q3f3+
Nd5d7
Bg7b2+
Qb1b4+
Ng5xa1+
R3xg7
Qd2xe2+
Nc4xf5+
Qe7xa1+
Ng4xb5+
Rb1b7
Qd2xc7#
Q7g1
Nch2
Bf5f4+
N2xa6+
Nd6f6+
Rf1xf8+
Bb8a2+
Qe5g2#
Bf5xd6+
Nf8xe2#
Bd4c5#
Bd6g1#
Nb7h2
Rd5xa2
Na5xf8
Ne4f6#
Re6d4#
Qb1c5
Qb8b6
Qbb8#
Qd7xa8
Nf4f2+
Ne5xa4
Ng3d2
Rf5b6+
R6g1#
Qb8xb7+
Nh2xc6
Qf7xb1+
Qf2b2
Qa3f7
Re7e8#
Ng2h2#
R8e3+
Re1xe5#
Ba8xa6+
Bd7f5
B7xf8+
Qcg5+
Nd6xc7+
Qd4c4#
N7b3#
Rh6xg2+
Qa2xb8#
Rb4h4#
Be3xf5+
B5xf8+
R3h5+
Qe6xe2#
Nxa2+
Ne3xf3#
Bf4h4#
Ba4c2+
Bgc5#
B8b4+
Bb4c5+
Qc7xc2#
Ne2xd3+
Bg3xg8
Qa2b3+
Qh2xd4#
Qc7xh1#
Nf4xg4+
Ngxb1+
Bh3e7+
Bf2xa4
Ng7xa1#
Bg2xb2
B7xg5
Nb2xa8#
Nb1xb8
Ng7c4+
Ng1xh5
Ng4xc3
Ngxc6
Qf6xb1#
Rf1h7
B2xc3
Qe6f8+
Qe5a4#
Rh7xc6
Ne7d6+
Re2xd5
Rg4xd8+
Ne3xb6#
Nf2xf8#
Qf5xg5
Nd1d3+
Ra2xf6#
Rh1xe2+
Ra4xf6+
Nb5b2+
Qg4h4+
Re7xb8+
N6b1+
Nh1e8#
Rd4xf8
Be1f2+
Nh8b6
Qb4f7#
Ncd2+
Rc2e5+
Bf5d2#
B8f3+
Qc3a7#
Ba3xh1+
Rd5xa8+
Qc3c5#
Bb3a6+
Ndxf8
Ncg1#
Ne5h7+
Be2e6#
Qg3xa1
Qh3a6
Qf7b7#
Qfxd8#
Kxg4
Qb1d5+
Rd5xa1+
Rf4xa2+
Rb2g6
Bf8xb8
Bb6h2#
Qg7e7#
Nf8f7#
Qd5xf5+
R1xh7
Bd1xc4+
Qe1xd7#
Rc8c5+
Qexf1
Rg8b8#
Bc6g7
Raxf8#
Rb1a7+
B7xh8+
Nc2a3
Rbxd8
Ne8xg5
Bc2g3
Bd8g3#
Ncxg2#
Qh3xh7#
Re5g4#
Ba7g8#
Qe7xd7
Q7f2#
Rf7xd7#
Q6c3
Bd1xd4#
Qd5e5
Qd6xg8+
Ra6xh5#
Q4e2+
Bgb1+
Bd7d2+
Bf3f6+
Rb6c7+
Bh4b7+
Bf1h1
Nf8xe6+
Rh1d6#
Nb6xf8+
Bf2xh2+
Qa3xh7
Rf6xd3
R4h1
Qe7d3#
Bb6xb7+
Rg6xb2
Bh6h3
Nf8xb3
Rh7xd5+
Bf5e4#
Ra2xe7
Re7a8
Ng7xb1#
Nd5xc2#
Rc7d8+
Ngd5
Q2a8+
Qe1e4#
Bg8e8
Nc3b6+
Rb6xb3+
Rfxd2
Rg8h7+
Na2b2+
B4xc3+
Q2h2+
Na7a2#
Nb5e6#
Qg3xe8#
Rg8d2#
Rb7g1#
Rh1g8#
Bge6
Nb3xb8#
Ba2f5
Qcxh4
Qg2xc3
Ng5xe4
Ba3xc3#
Qf3f3#
Bf5xb4#
B7xg3
Nb8h2#
Be1e6+
Ra4a6+
Ba7e8
Rh6g1
Ne1xh5+
Rg5xf4#
Nd2a6+
B5xd7#
Be7xa8+
Ba5e5
Nc4xe4#
Qd2e1+
Qh8xb6#
Rxh2#
Rg7xg8
Nb1h3
Bh2d2#
Nh4h6
Qf8xb4#
Rf5d6+
B3xf1+
Qe4h1+
Nexd3+
Qf4g5#
Qa5xb7+
Qb8h7
Re7e3#
Ngxb2+
Rc6g6+
Qd8f4+
Qf4xh8#
Qb2xg2#
Ng4c8
Rf2d4
Re1xc3+
Rg2f2
Bbxf8#
Rgxa1+
Qc8c7
R8xe6+
Ng4d6#
Rh5xd5#
Rc7b1+
Bd4xc8+
Ba4b4
Qa2xg5+
Bd5h1#
Qb6d1
Rg7h2
Qh1g2
Qh4xc8+
Ba6xb5+
Bb1c5+
c5#
Qf5xd7#
Qh3g2+
Na7c8#
Qh3a3#
Rc6f2+
Ra6xg3+
Ba1f4+
Rh6xa6
Bb4b7
Nf4xa4+
Qg1g3#
Ra7xf3+
Bc3xa8
Be1xc6
Nd5xa4#
Nd4xg1
Qfa2#
Ne6a8#
Na7xc1
Nd8e3#
Qe3+
Rc4a2+
Ne8a1
Rb4xa1+
Rf2a8#
Re1e1+
Nd6h7
Rh6xa6+
Qd5f1
Q5g4#
Nh1xd6+
Nhxd5+
Rg2xc8#
Nfxd7#
Bh2xf7
Na5xb5+
Nh4g2#
Qd8a6
Bf6g7+
Nd6xc7#
Ng8b6#
Bf1h2
Re1f6+
Nh3c5+
Qh3xe5+
dxe4+
Qd7h5+
Qa5h7
Bdxe2+
Qa2e5
Bdxe8+
Na1c2
Rgxc6
Qg3b8+
Bc5h5#
Rd6xf8+
Bc3c4
Nc2c4
Ned6+
Nbd5+
N4h5+
Qh2xg6#
Qc2xe7
Bg2xa7
N3b2
Rd3xd2+
Ng5xc2+
Qg7xe7#
Qg7#
Rd6xd3#
Qcxg3+
Rc3xe5+
Bg5c4+
Rcxc4+
Bd2e1+
Nb7a1+
Qg4xg2
B1xd3+
Bf4d2#
Nb2c1#
R4xa5
Re5e2#
Bh2b7#
Q8xa8+
Rh2xe3#
Ng3xb7#
Qa1h6#
N3h4#
a4#
Q3xc2
Rg8e6
Bc6xf8#
Bc8xd3#
Bh1xe4#
Qc5b1
Qf6c5
Qd5xd4#
Nf7xg2#
Ng4xh7#
Rh5g5
Bf2xa5#
Nc2xe1#
Rb5xf3+
Bfb3+
Rg7xa7#
Qe4xh2+
Nh4b7
Nd4xb6#
Bg5d7#
Bc1e5+
Bg3f5+
Nf1h2#
Rg7d4+
Qh4xg4
Bf2xd3#
B5e2+
Qb5a4#
Q5xg7#
N8xg6+
Qaxc7
Qg2xf3
Bcc8
Rc5g7+
Bd7xf2
Qc2g3+
Bf3xb6+
Nb8c5#
Rdxa1#
Bhf6#
Ne8h3#
Rh6c4#
Q4xa7#
Qh3xe1+
Qg2h1#
R1xe1
Bh7xd6
Bg7xd8+
Bd4xe4#
Nd4xb4+
Qc4g7#
Re8xh1
Rfxf1#
Qc1c7
Ba7a5
Bd1d3+
c4#
Nc7xe1
Bgxd1#
Bg7xf4+
Nb7a6#
Q4xf7#
Rh1xc1+
Nf6xb8#
Ndxe7+
Ra4xc4
Nf1xh8
Qd2xf1#
Qd1c7#
Nd5xd1#
Bg5a6#
Bb7xf6
Qdxg6#
Qc7xh1+
Re6xf1+
Rg2xh3#
Bh3xe2
Ne7xd6+
Kxb7
Qde2#
Qe4xg2
Nb2h8+
Rf4f5
Q5xd5#
Bfe1#
B8xd7
Bh8c8#
Qf5xe5
Bd1xh3#
Beb5#
Rb2e3#
Ne2xb3#
Qe5e5#
Re1b2
Bf2d1#
Qc3xe6+
Nd8xc5+
Nf1h5
N2c4
Na6xh7#
Ng2g7+
Nb3b8
Qh7a4
Qb4xe1
Qb6xd3+
Na1f2#
dxe4
Qf4f4+
Qa1g6+
Nh8xc3
Rxc4
Nb4xg3+
R6a4
Rd4xc7#
Qa6c6+
Bh1d5+
Na8g5#
Nh7a1#
Bd7d6#
Nc5d3+
Bb2xa4
Bg5xa6
Rd1xc7+
Rg2xh2+
Nh1a6#
Ba3xe7+
Re1b5#
B3xa8
Rcc5+
Rf5xd8#
Rb6xb6
R1h8#
Nb8
Bh3xa3#
Ne3xc3#
Bb4xe3+
Nf1f1+
Rexb8
Nf6f7
Qg5e7#
Qg7d6
Rfh7#
Na5xb1+
Nf2a3+
N2h6#
Bb6xf3#
N7c5
Qe2g5+
Bcg2
Bd4xd3
Na3h1
Qh2b6#
B3xf7
N3d7+
Qh6+
Be6c3#
Qf6xg6
N1d3
Nb1xa1
Bc1d3
Rf3xf7+
Qe1xa6
Nf7a5#
N3xb8#
Qh5xh7#
Rg4xa1
Bg6xd1+
Nb1c4#
Nd4d1
Rc6xc5
Bf6d2
Qe2b7#
Qc7f2#
Nb4g3
Qc8xc5
Rg3h1
Bf7e2#
Ng5xg3#
N1f3+
B2b6#
Bc7f3+
Nb1a4#
Ne3h7
Qh8xb6
Qe4xc6
Qd5g2+
R7c8#
Bb1a1
Bf1g7+
Nh6xc1
Qc5xc7#
Rbb4+
Bcxh3
Bd8d7+
Bc8xc1
Bc6xc5#
Bfh5
Ra6g8+
Bh4xg5#
Qg2xb6+
Re2xh8+
N7d4
Be8f8#
Bf1d2
Qd1xb3
Qg2f7+
B3f3#
Be7b6
Rhd5#
Qbc3#
Qf5xb4+
Rg4xd2+
Ra7xe5+
Qbxe8#
Q2xf6#
Re4c2+
Bexe7#
Nf4g7+
Nb5xg4#
Na2xf8#
Bd2c2+
Nc1e4#
Q8h5
Qc4xc5+
Bb1c8
Qb2a8#
Qg6xb4#
N7e8+
Bg7d4#
hxg1=N#
Rf7e1
Rd4xe2
B3b6
Qh2e1#
Q5xh4
Qeh3+
Ne7g2+
Qa8e2
Qh2f5
Bd1c4+
Bb3xh1
Re1xf3#
Nc4f3#
Ne3g4#
Qgd3
Qh1xa1
Q1xg4+
Rg2a4+
B8d4
Nh2xe6#
Ba3b3#
Bf7b1#
Rc3xh2
Nh8h6+
Qg4xa6+
Qh7xb4+
Qb8c7+
Qe7xb5
c4
Bb4xa4#
Bb7xc4+
Nc7xb5
Bd6a3#
Rc3g4#
Rc7xc4
Qg8g6
Rb2#
Qb6h5+
Rc1xd2
Qe3xc8+
Na6h4
Qa6f4+
Qa5xb8#
Rg5d3
Bf4d2+
Bd1xg1#
Ne5xe5
Bd7xc8
Qb7a5#
Q7xa6#
Qb8xb6+
Q5xg8+
Re2xd3#
Bh1xe7#
Bd6xg8+
Na2c4
Ne4xd7
Bh1g8
Na7xd7+
Nc1xg6
Nb6c1+
R5xa4+
Nf3xc1+
Qd7xh3#
Rb5g1
Qa5xa6#
Qh7e2
Qf3xf8+
Qe7g6+
Qg8b2+
Re2e6
Rc6h1#
Bc4g5+
B5f2
Nh8g4
Bcxg1+
Bg4h2
Qb3xb3+
Qg5d2#
Rc1xb1
Rh5xb7+
Qg6xe2+
Rb4xd4
N6xe6#
Qh8xc3
Rg2xg7+
Ng2xc5
Nh2h6
Nb7xb1
Qa7a7#
Qe8g4#
Qa4xg7+
B4xa3+
Qa8xh1
Qa5f6+
B6g5+
Qd8d1
Nxb3#
Raxc3+
B1a5#
Rg2e1
Ne5b3+
B2h1#
Rh4g2+
R1b4
Bbxb6#
Rf8xc5
Bf7d7#
Nc7xb6+
Rg7xd5
Nc2xd8+
Na3xb4#
Bb3a5#
Rbxd2#
Nd1xh4
Qah1#
Nf5+
Nb8b6#
Rg5xb2
Rbd4
Rga5+
Bb3c2
Re1xb7#
R7xe4#
Qb2xd3
Ba7f4#
Qc6h2
Ng7xc8
Rh7a2
Nh1f2
Qf8
Rf8xa2+
Bg2d1
Bd3f2
Ng1g5#
N4xf6#
Rb4h2+
Qdxf6#
Ne1xg6#
Rag6+
Qf3f8+
Qg2d3+
Ra7xf7
Rd2h5#
Bf6d1#
Rh1e4+
Ba5xh8
Qb6xb8
Ba6xa4
Bb3xh5+
Rg8f7#
Qd5xc3#
Bh3xa7+
N7c1+
Bd3h8
Qef4#
Ba2f1+
Ba4xb7
Q5xc4
Qd8xc7#
Ba2xf6
Bb1xa2+
B1h8
Rd3xb8
Rb2a7
Rhc2#
Nc6xc4
Rd3b8#
Qf8xc4+
N5xc6+
Qb5h4
Bf5xg1#
Q5xg1
Qa6g5
B2h8#
Kd5#
Nb6xa6+
Bb7xd4+
Bhb3#
B7xh2+
Bd8b1#
Ra2e2+
Qf4a7#
Qe8xh8+
Qe5xc4#
Q3xd8#
Nf5a7+
Nh7f2#
Bf4
Rc1a6+
Bb8xa7+
Rcxa5+
Rd5xg8#
Ng4xc3+
Nh2c5
Qeh4+
Bh1xe3
Qc4g7
Qd6c3#
Ba7xb1+
Nhg6#
Nbh4
Be2xe6
Rf3xe3#
Qh4a5+
Qe3xf1
Qa8xc7
Qfxe7+
Rf1xa1#
Rf7xa1
Rh2xb7
Bc4xe2#
Nh3e3
Qh2b7#
R6xb7#
Bh6xf2
Ba7a7#
N3e1+
Qexd7+
Rd4h2
Rc3e7#
Qf7xf8
Qd8d3#
Nf3xc4#
Bb1a3#
Ne3xg6+
Qg7a6
Qe1b2+
Ra4e1
Qf4g2
Qb5xg5+
Qc7a5+
Qbb5
Qg1b8+
Bf7xg5#
Bf1f7
Bdh8+
Rdxc4#
Rd7c3
Bb7c5
Nexf4+
Bf3a1
Nb1f5+
Qc8xh3#
Bf2xc8+
Qg7xa2#
Bd7c8
Nb7f5
Qa7c3+
Nc2xd4#
Be3g7#
Nb3xd2
Qe7xd5
Qe8xh2
Ra6xh1#
Qb8xh3+
Rb3h5
Qxe3
Na2xa4
Re7b6+
Bb5f8+
Re3xe5#
N5xe4+
Na5d2+
Bac3+
Nbxd1+
N2e3+
Re2e7+
Qf4xc2+
Rb1xc2
Rc2xa5+
Nh5a1
N5xb3+
Bg4xh6#
Be7xb7#
Rc2xg1+
Nb6xe7+
B8xh3#
Qg8xh1#
Qf6b4
Bhf2+
Qe3b1#
Naf4+
Q2xf1+
Qg7e1+
Bf2xe2+
B3f1
Nxb8
Bh2g7
Nb1xd8
Nb6h3
Qcxf1
Rc1b7
Nc2a5
Bc1e5#
Na6h7+
Ne5b3#
Bhxc5#
R6xe1
Ng6e4#
Be5b2#
Rh6g7#
Rf2e8#
Bb7xb5
B5xe4
Rae7#
Bg7xc4#
Qa6b6
Qb4d7+
Na5xa8+
Qb2a2
Rc4b2#
N8g6
Qh2xe8+
Ng6xf2
Rc3f2#
Bg7xe7+
Qh5c1#
Qc5xg8+
Rd6b5
Rc6xh2#
Bf6xe4#
Rd6e6
Bh8xf7
Nee4+
Nd3g8
Nf5xh5
Nb4h2+
Rc8xa1+
Bf4xh4#
Bbxg3+
Bh7xc7+
Na5xh1
Qa8g2
B2g5
Nc8xh5
R5xd5+
Be4xc1#
Rg7b1+
Rd4xb4#
Bh4d7+
Re1xb5+
B7xe8#
Bc4g4+
Be2xh7
Ra6a5#
Qb8d8+
B2c2+
Bc2f8+
Qe4xf6#
Ra5xh3
Rb4d2+
B6xd2#
Qf7h8
B8xb8+
Bh4h6#
Qe8xc5+
Nb3a8#
Bh3a3+
Nh4h3
Qa7xa8+
Qa5xb2+
Nb2h7+
N2g7
Rd2b1#
Na8xe2+
Rd8a2#
Bf1xe5
Nc6xe4+
Nd6g4+
Qg8xd3+
Rd7e7+
R3g3
Nc1f1
Ra7xd1#
Bg6xf5#
Qh1e5
Qe7xg4#
Qd1xf3#
Qh2h8+
Rh3xf5
Ra1xg3+
Nd1xf2#
Be8xd5
Baxh8
Bd6xb3#
Rg8f8#
Re7xb3#
Qh4xh7+
Bfa7
Qf4g3#
Qf2xe6#
Rc3d8#
Bb8xa7#
Qgxe3
Q1xg6+
Qd7xg5#
Rdc5+
B1xb6+
Bg8c4+
Rc5e7#
Nh6xd8#
Qc4xa5
Rah5+
Rf4xb5
Qcf5
Ra1xh8#
Ngb7+
Bh5xd3+
Nc8xh4#
Qa3xa1
Rg7xe5#
Bb4b5#
Qd6b7#
Rdxb8#
Bhf3
Rh7b4#
Bd8xc2+
Ra8xf5+
Nc1xc4
Bcd7+
Qg1xf4+
Bxe1#
Qc8xb6
Ba5c8
Bf3h6
Nd8e4+
Ng8xf1#
Ng8xf6#
Rd3xb3+
Q6a7
Ne4f8
Qbxa2#
Na3h5#
Na6g1#
Nbf7
Bg7xa7+
Bg5xd3+
Nhb8
Ba3g4+
Bd6xh3+
Rg8xa3+
Ra8xf5#
Qh5xa5
Qb2c1#
Rc7xd1#
Ng2xh4#
Ne8xg6#
Bb2c6
Nd6xd6+
Re3xe6
Nc3xf7
Q1a2#
Bgxg8
Nb7g6#
Re1e3+
Qfxd2#
Bc7xc4
B1xf5+
Re1xc1+
Nd5xh3
Qe1a7
Qa5xg5
Bb3xf2
Nxg2+
Qb2b6
Rd8d5#
Na1e8#
Bf4h1+
Na3xh4
Nb3xg2#
Qc2xd6
Ne6xf4
Q6xa7
Nf7g1#
Rf2xe8+
Qa6xa5
Re4f2#
Rhxe4#
Qd7xa7+
Qd3xf1
Qa8xg5+
B5xd1#
Bb4f5#
Bb5xc1#
Rg5xc2
Ng8b4#
Nfxd7+
Bag6+
Ba3e2#
Rae1
Ne8xe2+
Nc4xf7+
R5xc2+
Qd3xe2#
N1xg1+
Bb1a6#
Nbe5
Qg1xh6
Rc7f4#
Nc6xg2
Qcxa2#
Bh4
N5xe8+
Nd2b8
Qe4xc4+
Qc8a1
Be6b5+
Bexc1#
Rf1a3+
Rdxa7
Ba1b6+
Re3xf1
Ra1xf4+
Qeb8
Bg5c7#
Qe3xf6+
Bc1xg6#
Nd7xa4+
Rc7xb8#
Rh2e5
Rb2xf8+
Q5xd1
Ne4xc4#
Qf7xh5+
B8e6+
Rc4xf6#
B8b6
Re1xh8#
Be6xb2#
Bc8e8
Qf2h5
Rg1g3+
Na1xa2
Qa7a6#
Nh2d7+
Rd6xg4+
Qf5xe5+
Qh3c4+
Ra3xa7+
Re8f7
Qd8xa4#
Naxb5+
Na6xh7+
Bh6f3+
Nd2xg5+
Ra7b4
B6xa1+
Q5e4+
Bg6xh2#
R2e6
Rh2xc6
Qe8xf2
Ne7d6
B1xe8
Nb4xc3#
Qg4xa6#
Nb1xh2#
Ba7xb3#
Na6f7
Qh1xe6#
Rg5d1
Ra8c5
Bg7xa4
Bc6a8+
Ne7b2+
Q7xc3
Rf1xg3#
Bc6e6
Qb6c4+
Qd4xc1
Na4c4#
Nc5xf4
Rf2h8
Qf5xa6#
Rb1xh8+
Bh3xc7#
Bh6a1+
Ng6b4
Nh5h7+
Rc2d7#
Qa2xe2+
B7c6+
Rc6xh4#
Re1xd7
Qb7xc8#
Bg2xe8#
Nf4xc8
Bdb6#
Re3xg5
B7xc5+
Bf8xe3#
Qe5a6
Bh8a2+
Nf3xe7#
Bb5f7+
Bh8d7
Nh5h4
Qf1xg7
Nb5f1#
Qh7a7
Rb6e4+
Bd5xg1#
Ne7xb8+
Na6h1#
Bg5g1#
Rh3f8
Qea7#
Rf4d6+
Nc2xb4+
Bf6xb7+
N5xc8#
Ng4b1#
B2xe1#
Rc7xf6#
Ba5xa8+
Qb8xb1+
Raa8
Be5xb4
Bb4f5+
Nh3xf4
Bd3+
Q3h2
Nh8xd6#
Qexh5#
Qaxc8#
Qe1f7#
B7b6
Na1xb1#
Nf7g7+
Rf7f5+
Qc7d4
Qf4h3
Na8xe6
Qa4f8#
Nh3b8+
Nh7g5
Rbf5#
Qf2h4#
Re1h2
Rd6g4#
Q6xe5#
R6h1+
Be4xa5
Nh8xc4
Qf8e5+
Ne4xb7
Ra7h7
Ng8c2+
Na3xh5+
Na8xb5
Qc1f2+
Be7xe8
Bd2xe5#
Rc4xe2
Bb4e8
Bb4xd1#
Bbe1#
Qh6xh6+
Nbxa7+
Bc2e7#
Nc1xh7
Be6xe4
Nbh1#
Bb5xb7#
Bd7e5+
Rg1h2
Bd6b2+
Rb1f3#
Ne2b6
Qh1c2
Qf3xc6+
Bg6a3+
Nb4xa1#
Na7xc5#
N7f4+
Qhxa1
Qc1xe6+
Bb7c1#
Be3h6#
Na4xg6#
Qe4d3#
Re2
R5h3#
Bb1h7#
Bcxf2#
Qf8xc5+
Bf1xb1+
Bf5xf1#
Rb1xd6+
Be1xa4+
Nd2xc5#
Nc2b8+
Qb1e7+
Rc4g3#
Ng4a8#
Ba7xa7#
Be3g4#
Nc5xc1+
Rd7xh6#
Ba5xa8#
Nh1a3#
Nh3xa6#
Ne2b1+
Bg7d8
Bg6g4#
Bg3e2+
Nc7xe2
Ba4c6#
Rg1xh2#
Rc6xf1
Qc7d2+
Bb7xg5#
Qd2xb2+
Bf3h5
Bc6xb5#
Nh2xd3+
Re6xb1
Rf5a8
Rh7xf6+
Bb5xd7+
Qed3
Ncd3
B3b3#
Nf2xe3
Rc3xa7+
Bb1b1#
Be6xb7
Bc1xa1+
Ne2xa2+
Qh8b8#
Be2xd8+
Qg8xc7#
Ba8xc2#
Qc6xd7
Nb5xb7+
Bd2xb2#
R7xb2#
Rc6b6#
Bf5xg7+
Nc7d4#
Ra8g7#
Nb8xd5
Q1xd6
Q1xe1+
Q4xd5#
Bf6xc4#
Nfe4+
N6xe1+
Ne5xb7
Qb6f8+
Qc1f3+
Rah7#
Na4a6
Qc3xg2#
Rhxg6
Rb3e2
Rh8g7+
Ba2b6#
Nd3g1
Qd4xe8#
Nb7xh5+
Ne5f6+
Bh1f8
Rh8g1#
Nd5c6
Ng2h4#
Bd8xa5
Rh5e4#
Nd4xa6#
Rbxd8#
Qf5g5#
Rc7a1
Bexh2+
Re6xc7
Qcxa8+
Rd6f4
Rf1xc7#
Naa3#
Bb3xc5#
Qc4d5#
Nb5h6+
Bf7xg7
Bh3xf4+
Rg6xd3#
Qf6a4
Bb6e3+
Qe4xb8+
R7xd7
Nh1g4+
Na4xc2
Qe4xc2+
Qb1xa7#
fxe2
Rh5xc4+
B5xa1#
Qf4b2+
Re5b4+
Na1xe7#
Na4xb1#
Nd8xg8
Qh4xh8#
Bf6d7+
N6g2+
R7xc1
Q2xf3
Qe5b7#
Qg7f6
B3h6#
Reh6#
Ng3d4#
Qe6xe7+
Bh5#
Rd5xa4#
Na7xd3#
Ra8xd5#
Bgxb6#
Qh1a7
Q8c3
Qd4d5
Qg3c3+
Rb1a8
Qd8xd3
Nd7g7+
Bg8e5
N1h7
Bh1a5
Rc1c8+
Q5c1#
Bc5g2
Be2c1
Ncc2
Bb5e5
Bb1e6+
Nbf4+
Qe3g8
Bbxd5+
Nd5d4#
Rc8xc2
B1xf7#
Nh5xe3#
Be5xe4+
Bc4xh4
Qd7xc5#
N4c6
Qb2f4#
R1f4+
Bh5e8
Qf7d8#
Qf8xd4+
N1xd1
Nb4h5
Qe2xh8#
Qc6c8+
Rc5xf8+
Nd4xb8+
Nf8xb6#
Be1b2
Ne8xh4+
Nc5xf6+
Rb2a6+
N1d2
Rf5xc1#
Re5xb7
Rb1g5#
Qe1xg4#
Nf5h2#
Na2xh7
B5b8#
Qh3f3#
Rf6b1+
Be6xc6
Qb3g2
Be1c8
Bb2g6
Bd8g5+
Rb3xf8+
Nd4xe1
Na6xg4+
Qf6g4
Bd6b6+
Rg3xd8+
Qe1xg5
Bb1xf8
Nb5xe7#
Nexe3
Ba5xe1+
Re6b4
Rh5b6
Ra1g6
Bb5+
Ra7g1+
Be8h3#
R1xd5+
Ra1f2+
Bd5c4#
Nf5a5
Nf7xd7+
Qb6e2
Be6a7+
Bh1e6
N4xh6+
Rf4g1
Rc7xh5
Ra2xd4#
Be6a6#
Nh1xb6#
Bexf1
Rg7xh7
Qb6xc5#
B8h1+
Qd4xg3+
Rg6g1#
Na3xb1#
Qhc1
Q5xb6
Rf4xh6#
R8e4
Qh1d6+
Bfxg2
Rc8e7
Bh1xb6
Ng6xe6+
Na6xg2#
Nc3b8
Rg1g8+
Qf2xe8+
Qc2xb8#
Ba3d2#
Be3xe4#
Nf7xg8
Re6xe6#
Qh7xc6#
Bb7a6+
Rb8d6#
Nb3d6
N1a4#
Qf1xa8#
Ne3xe5
Rc1f6+
Rdxf7+
Bg1d1+
Nc4h5#
Nf2xe4
b1=Q#
Rh7b7#
Re3a2
Ne1g6#
Q3c2+
R8xe1#
Qg1h2
Rd7f4+
Bc6d8+
Qgxf5+
Nf6xc8
Ng8f7+
Re2xd4+
Nexa3
Qc3xd5
Ba6xd8#
B8h4+
Bca1
Bexa2#
Ng8xc1#
Ra1xe3
Qc1d7#
Rfg7#
Q8xc3
Ngxg8
Bf2a2+
Nh1xb4
Bg4xc3#
Nh3d2
Ne1h7+
B4xc1
Bbxc8
Rc6g5+
Qh3xa7+
Qg7xb5
Rb4xa2#
Qc6d2
Re1xe7+
Qf3xc1
Rh2h6#
Re2xe6#
Be4xb1+
Bb1xb6
Nd7#
Qh4xe3+
Rf7e7+
N5xa1#
Qg7xa1#
Qb4xf1
Qh1c5+
Bd1b2#
Bgc7
Qd7c4
Qd8c6#
B1b1+
Rg4
Rf8c5
Na7xg1#
Bg3xh4+
R7d4
Rd7g8
Qh8xa2
Be2h6
R8xa7+
Ng1b3#
Nd1xd2#
Rc8xh7#
R1f5
Bc2xc2+
R8h3
Nb2a1+
Naxd6
Bh5c3
N8f8+
Rb8xa5+
Nh7xg7+
Qd4b3#
B5a4+
Nd5h7#
B2f2
Qc7xa5
Ng3
Bf7g8+
Bb2h3
B2f6+
Nh4g1
Bd7xe7#
Qg7f1+
Bg8f2
Nb1xb3#
Bhh8
Qa6xa8
Ng8c6+
R1a2+
B4xe7
Bb6xg8
Qc4e7#
Nd2xf7+
Qe6xf4
Ba8xg4+
Bg7d4
Qb1c3+
Be1xd6#
Qg6xb8#
Rg2xf5+
Rd5xg6#
B8a4
Nf4xb4
Qf3xb2
Rbxf3
R3xf5#
R7xd5#
Bg2xd4+
N3c1
Na6xc8+
Bg2c5
Kxh7
Q1xa4#
Qhxb7+
Rg2f7
Nb4xf5
Ba2f3#
Nd1xd5+
Qb4b8
Rc4xg2
Nh3xg2
Qcxc8
Nc7xa5#
B3a7#
Na1xd4+
Nb7g1
Q6h4
Nd2xg3#
Qg1a6
Qh8e7+
Ba4d4
Rbxb4+
Rc3xa8#
Bh1xc2
Bg1d3#
Ba4c1
Ng1xh4+
Bg3#
Ra3xc3+
Na1e5#
Ra8xd1+
Rf2g4+
Bg7xe2#
Qd6h8#
Rg7xb1#
Qb8d1
Nb6b5
Qh6a2#
Rc6f3
Bd6b1#
Nb5xf6
Qf3b5#
Qc5h1#
Bhg8
Qc2xe3
Re3c1+
Qe3xe7+
Re7xd4#
Ra8f1+
Qc5xh5
Qg8h1+
Qc6xb4#
N5xb6#
Qa1h3+
Rc2xd6+
Bd2xh5+
Rf6e6
Rh6xb5
Qg8a2+
Bh7xa8
Bh4f1#
Nb3xd3#
Nh2g8+
N5xe8#
Rd8a8+
Bhxa5#
Qe3f1+
Re6c3+
Bbxd6+
Nd3xa6+
Re1xd8+
Qcd3#
R4f8+
Nh7b2#
Qg4xf7+
Re7xc3+
R6e2#
Bcf7#
Rb5f5
N7g4#
Bh7c4#
Qc1b8
Rh4c7
Bd8g5#
Na3h3+
Qa5xd4
Qf6g5
Ra8xb8
Rd8xf6#
Rh4h5#
Re8f2+
Ba7xd8#
Bg6c1
N3a5+
Nc8xf4#
Bf6f8+
Ng1xc2
Bh2xc3#
Ng6xd2+
Rg1xe8+
Qb4a2+
Nd7xh7+
Rf3d2#
Ne1xh2
Qg5h2
Kh2+
Nd5xb7#
Rf5xd8
Nf6xc2
Na8xh8
Rh5c1+
Rf8h6
Re3xc5+
Bgg6
Nc2xd3
Bd7f2
Qc7xe7+
Qg8f3
Rc2g4
Qf6xa4+
Qa8c6
Rb7xa3#
Na4xh8+
Rd2xd1
Be7xb2
Qh6e7
Nd4b3#
Nd3xh4+
Bg4xe8#
Nf7g8+
Rb1d1+
Kf1+
B2xb6+
Bh4f1+
Rba2
Ndc4
Qg6d1#
Nh5xd3#
Na3xg7
Nb7h8
Bc1c8#
Rc2xd7+
Bf2d4+
Raxg8+
Qh4g6+
N1xe7
Na8xd4
Bc7a3+
N8xa5+
Ngxc8
Bd5h7+
Nh5xb2#
Rf3c7#
Rba5
Qf5b6+
Qgxg2
Nb1h5+
Bf4xf4
Q5g3
Qh8xc7+
Qgh4#
Nf4h2#
Bc2d1
Qb8xb8#
Bg2xh4#
Qf8d6+
B2xe4+
N6xb3
Qc1e4
Be7d1#
Rad7
Rh6xg6
Bhxb1
Bga1#
Bh1e7
Nb2f5
Rg3xh4#
N4e5+
Ng3e7
Ne7c7
Rd3xe7+
Rh4xf5+
Qf2xg3
Qd1a7+
Qa3xc1
Qd1e3+
Nc5xb4#
Rh7xb5
Qa3f8#
Nh4f2#
Ne1xf8+
N2xg3+
Ba1+
Ng2b6+
Nhg8
Bc4c6
Qf4xc2
Qh3e8
Bc2xa6+
Nc7xf3
Rd6xd1+
Qb6xg1#
Rc1xc2#
B3f5+
Nf1c2+
Nh4d8+
cxb6+
Bb2xd8+
Q6d5
Ba6c4#
Ng7xh8#
Qb1f8+
Ba6d6
Ng4xc8
Qd6xg3
Qb3b8
Rd8b4#
Rf6xb5
Nhxe7#
Bb1xe6
Bgb2#
Qh8e3
Rh3h5
Nh2d7
Ra3b3#
Na3xe2
Rb6xf5#
Rc4c6#
Bd5d6#
Nc4xg6
Bb4xc3#
Ba5f7+
Rh6d4
B8h1
Qxf5
Qc2xg6#
Nb6g6#
Qg3e7#
R4h4#
Bc6xg5#
Nd2xd6#
Nc3g7+
Ra2xa3+
R5c7
Rb8f2
Nb6xc1#
Ba4e3#
Qh2h1+
Qgb3
N4e2#
B7xe1#
Bd1xf5#
Nc3xd6+
Qd1xa3#
Ra2xd5#
Qbh8
Qa7a6
Nf8b2#
Na6xf8#
Nhc5
Nh8xc1#
Bd7xb7+
Bg3b8+
Be7xf3#
Bh6xg5
b1=B
Ne5xb7#
Rb5xc1#
Nxc1#
N6h3
Nd2xh3+
Nh5e6+
Nc3f6#
R2xc6+
Qf8h2+
Nf2h1#
B1h6
Ng7g7+
Qe6xf2#
Rd8xe6+
Qh5xc6#
Qg5xc6#
Rh6xg5+
Qh2d7+
Rb4a5
Nb8f3#
Nc8a3+
Ne8xb4+
Nh3a3
Bd7xf2+
Be5c6+
Qdf3
Ra6xe6+
Bc2xd3
Re5c5#
R4xa4
Rb7h2+
Rb3xg4+
B6xb2#
Bd1f1
Bc7f6#
Ne1xf8
Rd1h4+
Rh1d2#
Bg5e6
Bd8xc3#
B7f3+
Qd6xa7
Ba1f3
R7xf5#
Bg2xh7
Nfe2+
R4xh7#
Qbxb5
Rc3d6
Nd8xf6
Rc8a3+
Rg1xf2+
Rc1d4+
B3a8
Bb4xc1
Ng4xh7
Ne8b7#
Be5xg3
Rc7xa2+
Nf3xa5#
Nd4a4#
Ra4xf8#
Rd4xa4+
Q8g6#
Qbxd5
Qg7xd1+
Ra5c1
B1b3#
Bd4e6#
N1f6+
Rd6f2
Ra5xb8+
Re7xf6+
Q6xb8#
Rb1a6+
Ra5a8
Qa1b2#
Rf5xc7
Nd1e2
Nb8xe6#
Qf3h4+
Nf1a2
Ndd4
Nf5xe2#
Qb6a1+
Qg2xg7#
Rd7xe3
Rf3e6+
Bh1xc7
Ra3d7+
Qf1xg5+
Rg8h3#
Qh3e1+
Rf1xe6#
Be5xa4
Nh8h5#
Bc5g7
Qb8xg4
Nf2f5+
Be2g8+
Nh7xe5#
Nc7xf6
Rb7d7
Rg4g7#
Nc3a3#
Qf7h7#
Qb3xf6+
Ne2a3+
Ngxg5
Nh1h6
Ned2#
Qg4xf6+
Bd8xa6#
Bb1xh2
Nc6c7
N4xb6
Nh4xb5#
Nf5g4#
Bh4xh7+
Qc5xc3+
Qh1e5#
Qd1a5#
Ng7e2#
Rd5xh2
Qh6c5
Q6e7+
Rg2xa4
Nh5xg1
Rdxh1
Re7e1
Nd6a1
Nd1xa1#
Nd7c5
Bxe7
Qh3xc7#
Qb8xd4
Qa3xg3
Ra4xg6+
Bf3xc6#
Bd8xe8#
Qf6xh2
N7xb7+
R4g8
Qc8xe4+
Qc7b6#
Bd7e1
Bg7a7#
Nc3
Bg7xh3#
Nc8xa3+
Nc1xa7#
B6e2+
Rh6xb4#
Qaxe5#
Rc7xc3
Rg1e3+
N5f8+
Nc4h4#
Rf2xg2+
Qd7xg4+
Qc8d5
Qh8f8
Qc5xc8+
Bb1f1#
Qb7xf4
Re7a2#
Qb4xa7#
Rbxh2#
Bf2xa2#
Ng3b6#
Be2a2
Qf6c8+
Qbxh3#
Rc8xf6#
Rd3h4+
Qb7xa4+
Rgxd3
Qe3c7
Qd1xf5
Rg4xf4+
Bc3xg3
Rd7xc4+
Rb3xc5+
Bf3xg2
Nd3f7
B2g3
Rb5xc4+
Ng5xg2+
Rb8e5
Qh2e4#
Bf4f8
Nge5#
Rb7g7#
Bc7xa8+
Bde7
B3c4#
Rg1g1
Nc7a5+
N8d8+
Beh8
Be3xd3#
Bh5xf4+
Rg3xd2
Bh6h1#
Re4xg4+
Qf4d4+
Bf6xd5#
B6f5
Q6xd1#
Ba7xe8
R7xh8#
Qa8e4#
Qe8xf1+
Qd4xg1
Qh5g2
Be4a5#
Ba5xc1
R8xe2
Na7f5#
Nbxh5+
Bf2a4#
Qe4xg8#
Bh5xg7#
Qg7c8
Bg2b7+
Bg1g5#
Be2xg5#
Nh8xb8#
N3c6
Ng4xd1+
Na6xe5+
Bf4xe1#
Q6xf6#
Q3g2#
Re3c8+
Qe5h8
Bba6#
Bhh5+
Nfa5
Ba8a7
Ba3xf1#
Bg5b8
R8xd6#
Ba4xc6+
Qg8a8
Qa7xf3+
Rh2g2+
Rf7d5
B8xf1#
N8g2#
Bb5xd5+
Ba2e1
Na8xc1+
Naxg2+
Ne1xg2#
Rd6f7+
Rc5xa3+
Rg2d4
Bf4xc1#
Na3e6#
Qh8f7
Rf6f6+
Nd8a5#
Qc8h4+
Rg2c1#
Qb4a7+
Rh6xf4#
Rg8xb7+
Rc3g2+
Qa7e6#
Rbxf7
Bb4xf4
Rb6xe4+
Ra6b1#
Bf7f5
Be3h6+
Qb4f6#
Bh4xc3
Nf1h8+
Bf3b7#
Bc2g8+
Na1xc5+
Qg5b5#
Qc7g2+
Ra4c1+
Qh7h6#
Qb1e8#
B8xg1
Qb6d3
Qd1d5+
Bexf5+
Rg1xd2
Nca1#
Nc4c2
Rgxh6
Rf1g2
Qd5e8
Qc5g6+
Qb2xf3
Rd1g3+
Rc2g8+
Rd2xf3#
Be4xa1#
Qb3c2+
Qc8xc2
Qe7xe8
Bg1xa7#
Ba6h3
Nc2g4+
N7h4#
Bb7xd4
Ra6d6#
Qf8xb4+
Ra6e7
Rc2c1
Ra6c3#
Bb2b2#
N3e7+
Na5f4+
Re5xh8
Rc8xh3
B7xa3
Qd5a1#
Qh2a2+
R1g3
Qg8xd8+
Rd7e5
Bd8h6+
Be4e6
Re5xd6#
Qcb8#
Qe2xd2#
Raxf7+
Ra3xb1#
Qh2g1#
Nb2xb7#
Nc6d3#
Q6xc7
Qc7d8
Be5xg1+
Rf8xd5+
Be6xd5#
Qh3h6
Ra4b4
Bg4h6#
Nd4xd7
Bf1xf8+
Qc5f8#
Qa1a6+
Nf4xa2
Na7g2
Qg3g3+
Na6xe7#
Bh6g1+
Bhf8+
Nb4xa5#
Rfxa6+
Nea8+
Ne3xe3#
Bc5xb2+
Ra5h3
Re7xg1#
R5c3+
Ne7e1#
Qf5xf6+
Ne5xf8+
Re8g6
Rg2a1#
Rf2f7
Nh7xd5+
Qh4b1#
fx1=B#
N1xh3
Nh1xa8
Rf2#
Ne7a2+
Nb8xh4+
Qexa1
Q7xh2#
Qb5e2+
Bg5a1+
B5b6
Bh8xh6#
Nh2e5#
Rh8xb1+
Re6xh4+
Qh4xf5#
Ba7d7
Qd1g1+
Qxc1+
Ng8xd4+
Bcxh2
Nh2xa8
Rgd2
Qb1xe3+
Rg5xc1#
Ra7g4+
Bh2b8#
Qd3xe1#
Nf8f8
Nf7c7#
Nfxe8+
Qc8b8+
Q2xd6+
Qf4xc6#
Qc1xh3+
Ra2xc7+
Rb8c8#
Qb1b6
Qa1xc6+
Q8xf4
Rb4d1
Rxe6+
Bd3c6+
Ng3xa3+
Bc7xg5#
Nh5e1+
Na3d4+
Rh3xh8#
Nf7f5
Qh1b4#
Rh2a1+
Bh8h6#
Qe8b4
Qh2xd6#
Nb2a7
Nc4xc3+
Ne4b1+
Qh2a4#
B3d2+
Bb3f6#
Nf1xa8
Rb6h4+
Bb1h4+
Ne7g6
N7h1
Rhxc7#
Bb2h7
Nc2e7+
Rd1xh8+
Rg6h3+
Bf5xe2+
Be1d3#
Qb4e6+
Qc7xc8
Qh4xf7
Bb8g3+
Nc5xe7#
Bf1xf7#
Rh6xh3
Ng1xc5+
Ra7h6#
Rf6xe3
Rd8f4
Ng6a8
Qf2xg8+
Qe4h3#
Ng6c7
Qf8g4+
Ng4xd7+
Bd1xc1+
Bb3e3#
Qb6a2#
Qh2xc1+
Nfxa3
Nc6xg3#
Bag2+
Be8c1
Nf6xa1#
Q3xf3#
Bd2xf2+
Bd7xf3+
N8xa5#
Qg5h8+
Rc8xh7
Be7d3+
Rb6+
Na2xe8#
Rd2xb6#
Qh5f1#
Be6xe7
Rc2f8+
Bc5xe8
Bb1xg1
Nc2xe2+
Qh2f5+
Bdxe3+
Bg1e8
Re1d3+
Qc8xc4
Qe4xe1#
Bg5e8+
Qb3a3#
Bgd6+
Rd6f1
Qa7xc2
Re4c4
Qh2b5
Rh2xc5#
Ra7e3+
Q7d2
Bh7e4
Qg6g3#
Bg5xh3
Ngxe4+
Qc6c8#
Bd1
Qa3h8
Rb8d3+
Qe7f8+
Qf6c2+
Qh1d4#
Bb8b8+
Bc5xh8#
Nh5xe3+
Q8h4#
Rd1xe3+
Bdxd7+
Bg2e2
Rd3h3
Nc1d1
Nd8xe5
Qg8h2+
Na8e2
Qa2d5
N8e8#
Re6a3#
Rf3xf8+
Qe3e8+
Nb1xe4
Ne1xd7#
Nf6b4#
Nd6xa8+
Qc6xh4#
Bg6xb6
Nexh6#
Bd2xe3+
Ng7xh1
B3xc3
Qf8a1
Qc6a6+
Qb3e4+
Q1h4#
Rc4g6+
Nb2xe7#
Nh8h1+
Nbg4#
Bg5xb8#
Rd6a8+
Bc6xa3+
Ng4e7+
Qe2e5+
Nbxc8
Ne3xh2+
Rc4h2+
Nd8f5#
Qb5e5+
Qb3c1+
Rg7g8#
Qc1f4
Nb8xh3+
N1xf7#
R3xc5
Nfxh2#
Baxf7#
Qf6a8
Rh4xd8#
Ng1xa8#
Nh7xd3
Bxd2
Nb3xe1
Nf4b4+
Ne6d5+
R1xh8#
Rb5xh8#
Nc4f6#
Rhh7
Qg5xd4
Qf7b4
Qe3xd4
Rf2g4#
Rb1h7
Bd5xh1
Qfxd3#
Qc1e2
Nb6xb8
Be1d2+
Baxd3+
Qbe5
Re6b6#
Ba1xb1#
Na2xf5
Q3xc8
Qe1c6
Bd6c3+
B4h6#
Ba1xb4+
Nc3xe3#
Qe8xa5+
Qa5xf8+
Qfa4
R6xe4#
R3g2#
Bg6xh6#
Rc3e1+
Rf8xb6
Nb1xh6+
Q6xb1+
Ne8d2#
Ng6xe6
R5a4#
Rc1xe4+
Nd5f6+
Na6xa4+
Ng7xc4
Qe2xb5
Bh6xa1#
Ra7f5
Bdd5
b1=B#
Nd3c8
Bd8g7+
Ne2a5
Rd6d1+
Ne1xd1+
Qad6+
Nh3xe7+
N2xg2
Rc6xb6
Bf5g7
Rga8#
Bb6e6
Qf6xb3
Ne2e2+
R8a3#
Qb6f4+
Nc3e6
Rdg6+
Qb5c8+
Qe4c7#
Rg8f3+
R6xh1
R4xg5
Bb7h3
Re2c4+
Ne6xa2+
Rh7h8+
Nd6g3#
Ba8xe1#
Qa8h6
Qf6h6+
R7b1+
B6e7+
Bfxd1#
B6b8+
Rc5xd1#
Rf2a7#
Bg8xf5+
Ne5h8+
Rg2xc7+
Nfxe8#
Qe5xd7#
Ba1xf1#
Rae8+
Qf3xc5+
Rf6
Bd1xe6#
Qd4xg1#
Ng3h4+
Bh4a3#
Ra3h5
Qc5b5#
R7xh4#
Bh2d8#
B5xe3+
Qg5xf5#
Qh4xh6
Rb6b8#
Ne2a2
Rgd3
N6xd3#
Nc5xe7
Nh8xh5
Nb8g8#
Nc4g4#
Ra2xa7#
Rb4f2+
Rb3xf8#
Nc5g1#
Ra8xg2
Ba3c1#
Re4c3#
N6c5+
Ra1a1#
Rg4xf7
Rh4g1+
Ra4xh6+
Bf4xa7#
Bh3xb8#
Bexg8#
Rd4xd7#
Nh2g8#
Qh3d6
Qb3g4#
Nh7a1+
Bf8xd6#
Ne4xa3+
Nexc3#
Nb3xh2+
Bc7xe8#
Qd7h8
Qc4xb5
Bc5g2#
Rd2xh1
Bh1e2
Rf5xf1
Rf6xb7
Re6xb7
Bh8b4#
Bhb1
Ba7xh2
Ra6e1#
Bh3h4
Nf8xg3+
Bd4xe2#
Nc8xe8#
Ne2g3
Bcxd7+
R1d5+
Qc1xg8+
Qa6xb5
Bxg5
Rbxa5
B5xe6
Bf6xe7#
Bb1c7+
Ngh2+
Rb7g1
Qd1xb4+
Na4f4
Qg2a8
Qf7g6+
Bb6xe2#
Qg1xb4+
bxc3#
Bf8e5+
Rg3g8
Qgxb4#
Bg4a1
Bc2g2+
Rb7xc1+
R7xa8#
Ra8xg8+
Rh8xh3#
Be4a5+
B3f2
Bd8xb3#
Rg5c2#
Nf3xa4
Qf3d5
Bb8xf8
Qa7xa2
Nb7f7
Bc4xf7+
Rg5e2#
Rh5xd3#
Nh7d5#
Q8g2#
Bg8a2+
Rb4a7#
R3xe8
Bxa1+
Bh3xb5+
N7c7#
Rf4xh7+
Nd8h2#
Rc2xe1
Ng6a8+
Ne7h7
Qe6xc6
Qb5f4+
Rhxa3
Nb6xa8+
Red8#
Ra7a4
Bea2#
Rg3c6#
Ba1e3
Bh4xa7+
Na3d7
Qc6h7
Re3g1
Bf1xh3#
Nh4xf5+
Be2xh7#
Qb4d2
Rb1xb8
Ra6xc7
Qf6d2
N6d5#
c6+
Nf1b4#
Rh4xa3#
Bc3h8#
Bb3xg3
Bd6xg4#
Bg2xc3#
Ra4xb6+
B5d7
Rh5e2+
Qb3xd6
Nd4xa1
Ba7d4#
Qhxa5#
Qg7b2
Qf7h7+
Rbxg7
Re3h8#
Bb7xd1+
Rf2f3+
Bf1c3#
Bf7xe6#
Rh2b1
Ncxb3#
Nb1xf4#
Nf1xh3
Naxg6
bxc2+
B6g3#
Kxg8+
Rfxa4+
Rd1xa7+
Rexe6+
Bc1a4
Rh2xh7#
Qb5
Rbxh5+
Ba4xc5
Qbxg3#
Re1c8+
Rc4c7
B8xd4#
Nac4+
Ne2xc8+
Re4xh6#
Rc8xa8#
Qf3d2+
Rb3b7+
Rb7xe1
Rh5e3+
Bg5d5#
Nf6xe2
Rc5f4+
Qf7xh8#
Ng6xa1+
N8g1#
Rb3#
R7d8+
Ra8e2+
Qc5xd1#
Bg8xh6
Qd1f8+
Qe5xa1#
Qa2d3+
Qa7xd2+
R7xa7
Rc5b2
R2xb7
Bc8xa1#
Qd3c6+
N2h2
R5b1+
Rc2e5#
Qb2xb4+
R5b4
Bg4a5+
Qe8xf8#
Ngxa5+
Qf5xd3
Qd3f3+
Bc6h3+
R1xc7
Bh3xf1#
Ne6xh5#
R8e5
Q8xc6#
Qc8e2+
Rd2f4+
Qf3xb6+
Qg2xe1#
Bc2a4
Nh6xb2
Nc5xb5+
N3xd8#
Nd8b8+
Nb8xh7
Nd5e5#
Qf2h8
Qf5xb4
Baxd2+
Rh7f6#
Q7xb1
Rd3xf6#
Qg5xh1
B2xb3#
Bc1f5#
Ra6c7+
Nbxe4
Bh7xb5
Nh8xe1+
Rf1xf7#
Bh3g6
Bd3f1#
gxf6+
Rb3d8#
Nh5b3+
Ra6d7
Re2h4
Ra7xe2#
Re1b4+
Na3e5+
Nb3xe6
Be5xe8+
Ba8xc1+
Ne2c1+
Qg1xd7#
Qc8b6+
Qd4xc3+
Bh4e3+
Qb3xf3+
Bg4b4#
Ba5c2+
Qd4e3+
Q3xe5#
Rd7h3
Nac8
Rg4xa2+
Nh7xd2
B6g5
Qg2xh6
Qb2b5#
Bb8e5
Rd7xd4
Bg7xh5+
Bb8e8#
Bd7b3
Rh7xa8+
Q6xa3+
Bec3+
Na6f7+
Qd6xc7
Rb4xd8#
Bexd5
Qd2f2
Rd5xa1
Nf4xg5#
Q5h3#
Rd7xb1
Q7a1
Rf8d2
Nf5h2+
N2e2#
Rh5f8+
Qc5xh2#
Rc4d1+
Qd2f2+
Rh7xd7+
Q7b6+
Ba5xa5+
Ne6xd6#
Nh2xh4+
N7e1
Rd7xa2#
Qd6xg7#
Qa8xc6
Ng5g5#
Qe6a1
Qh5xe5
Rg1xd4#
R4h5#
Ngxb6
Ng8xd6#
Nh3c6+
Bbf4
Ba4xd2#
Ne2a7#
N8xf4#
Bd3f8#
Bxg4+
Rh5f5
Ba5xa4+
N6xa1
Qf7xf5+
Ra5xf1
Be7g5#
Qa8f5+
Ng5xh3
Bc2xb7+
Rh4c1
Q2a7+
Bd4xd5
Ba6d7
Qa5xc3
Nh6d2+
B3h8#
Bh7xg2+
Nf6a1+
Qe6xg2
Rb5xh1+
Rc7d7+
Rg7h3
Bh5e1+
Qcxc5+
Qf1xa3#
Qd2c7+
Qa4g1#
Rhxc2
Bxd6
B8xf4
N7e2
Qg3xe1#
Bc4xe3#
Rg6c4+
Rg5d2#
Ra4c2
Bd3e7#
Na1c8
Rb6b5#
Rc7xd3
Nc7g1#
Q5xh4#
Ne1xe7
B6b7#
Qh6xa7+
Rc4b6#
Bd8xf7+
B1xh8+
Rf4g1#
R1xh7+
Nfxd5#
Bh3xf2
N3b2#
Rc2xa2#
Qe7b6+
Bb8xc4
Bd3xc6+
Bgf6
Rb8xe7
Rfxg4#
Ne8b5#
Bb4xb4
Nd5e1+
Bd6g2#
Bf8xb2
Ngxf3
Qf6e1+
Bb3d8+
Rhxc8#
Rd5g3
Rd1xd8#
Qa3xa6
Rf3d4+
Nf8xe4+
Ne4xd4#
Qe3xf8+
Rh3xd1+
N1c4#
Qb8c8+
Re5xh8#
Q4xf4#
Bg6e1
Nc1xh8
Rb7b1
Nc2g3#
Bbg8#
Ra8xb7+
R1xb4
Bf2a6
Rc7xf3
Q3d6+
R2g1
Ne4f7+
Rc6xb2
Ra8g2+
Qe4xc7#
Rb5f7
Bc2xa7#
Ne4b8+
Qa1f6
Rch6#
Nf7xc5+
Bc5g1#
Bh3xg2#
N7xc1
Kxb6#
Rg2h7
Ne2g1
Rh3xb7
Rh2xh8
B8f5#
Nf7xc7
Rg7h1
N2xa5#
Qh1c4#
Qa6h2+
Rf6xe6+
Bc4g2#
Na2f8+
Qg7e6
Re6xb7+
Na3xd1
Qg2d8+
Rc3xd5
Nf1xd2+
Qb7xe8+
Rg1xb2#
Rf1xh1
Ne6xc4+
Nd6h6#
Ne8h5
Qc2xg2#
Qa8xa5#
Ra1xe2#
Nb6d6
Bc2e7
N2a3
Qhxc5
Ra5xe2+
Bh2g6+
Nb2a5#
Q3c4#
Nc6c1
Nh1f3+
Rc2g4+
Qd1b8#
Ng6xd6+
Qc2xf7
Nb1a3
Re3d6#
Qa5xg8#
Qb7xc2+
Qe6e5#
Qg5xh6#
Bf8b3
Na3xe3#
Rb4h7+
Qh1b5#
Nhxf4
Qf2c4+
Qfxe1
R6xd4
Qa3e7
Qg1xa8+
Rf7xh1#
Ne8xa7#
Qc5d2+
Qd5xb2#
Qe7a3#
Qc2xd7
Rf3xg5+
Qg4g2
Qg4a3+
Bc1c1+
Rc8b7#
Bb5xe8#
Ne6a8
N8xc4#
Qf7xh7+
Nb6xh6#
Q1h3+
Nc8c6+
Rb3xh8#
Qa1e7#
Bc8a5
Ng5xb3+
Ng6g2
Rc1b3+
Na3xb2+
Ne7xf6+
Ne1h4+
Nd1xf7
N8xh5
Qdxb8+
Qa1xe5
Rf7g3
Ncb1
Nd3h5#
Nb6b7#
Bcxb6
Qa5xa2#
Qh4xa5#
Nc4xh8+
Re5xa1#
Na1e6#
Nc8xa1#
Qc7xe6+
Re4e2
Ne3xc7
Qd8xg4#
Ra6xf1+
Nxg8
Qgxa8#
Qb4a3
Re1xf6#
Qe6b5#
Rb7g6#
Qa7xc7
N3e8#
Qa4d7
Qd2c3+
Rexd6#
Ne7g1+
Qh3h1
Ke6+
Bh5e5#
N1xc7+
R2xa1#
Nf1d7+
Ng3xg5+
Qc5c2#
Rh4xb4#
Nb6xa1+
Nf7d8
Bb3xc5
R3d4#
Be3xc7
Rf2xf8
Na1a6+
Ba1xc3#
Bc7f4+
Bh2g8#
Rb2xa7#
Qb2b3#
Qa1xg5
Qh3g8+
Qc4c3+
Qc2g7+
Ra8h3#
Nb7xg1+
Rc3h3#
Nfxf7+
Qb3g5#
Qg7xg5
Qg2xb4+
Rf1xb4+
Bh2xh6
Qa7e5#
Qe1h1
Re3xh6+
Bg3b6#
Qb2xg1
Qd7b4
R2d5#
Rd2h4
Bbc5#
Rd3d2+
Qgxb8
Na6xf8
Qa6xf1+
N7d2+
Rc3h2+
Qf7xf2#
Nf8g6#
Re2f7+
Re6a8+
Rb6f6#
Bb4a7
Rh8e3
Be4e5+
Qe7xc6
Qg2a4
Bf6h1#
Qc4xa8#
Rd1e1
Bd8xh6#
Ba1h7+
Qb3f1#
Rh4a2#
Ne7xb4#
Na4xe4
Bh6xe2
Be3e3#
Nh1h1#
Qe3d8+
Qag6#
R6b5
Qa1c3
Rg1xe3#
Bbb3#
Be7xd2
Bc4f7
Bc5h1
Ba8xh8
Nb7f3#
Rg8d6#
Ne6h5+
N4d8
Nd8xg4+
Qe1f4#
Bf3xd8
Rd2d7#
B8d1+
Bc8h6+
Nc7h5#
Rc3a3#
Rh3g2
Nf4c2
Qe6g6
Rc1xe1+
Nb3h3
Qg1xh2
B6xe2
Ba5xe2+
Bf6b2#
Rf1xd2
Bf5b4
Qa7xa3+
Be1xf3#
Rf5g2
Nc6h1
Q6xe5+
Rb1h1#
Q3xa1+
N1xc1
Qcxh1+
Rcb7#
Nh7xc8+
Nc4xe1
Rc7g7+
Bfg3
Rd4xd2+
Bf5g4+
Q2xc2
Rd4xf6+
Bh6g8+
R3h5#
Qb5xg4#
Bh5e1
Nh2xd4+
hxg1=R+
Ba4c4+
Qc2d6#
Rd7f6#
Kxa6+
Nf7xc8#
Ne6xh6
Bhg3+
Nf8xf8
N1xd2
Qf7xb6
Qd2g5
Qh6xe4#
Raxb5#
Be2xb1+
Nc2b2+
Nf6e3#
Bc5xh6#
Nf8c7#
N3e6#
Nh1f8+
Be3g6+
Qe3xh8#
Bb4xg8
Qc3h6#
Qd4xb8
Nh3c4
Nb2xd5#
Rf6e6+
Rff2
R6b5+
Rd5d5
Ne3xb2+
Qh8xf8#
Bb3d4#
Nc3xe2
Q2xc6
Raxd2
Rf3xe1#
Rd5f4#
Bb5b4+
Qh6xb2
Bfxc5
Qg1xg1
Rb1xf5
Rf8xh8+
Bd2xh7+
Qc8g4#
Q6f2
Rg8xf7#
Qc7d7
N8xb3+
Qh3xh3#
Bb4c6
Rc3xd3
Qf2f7#
Rb3g2
Bb1a7#
N2xf7#
Rbxc7#
Bd2f1+
Q5xb3
B6xd6#
Rh6xc6+
Nbxc3#
Nd3b7#
Nc8e1
Q7xh1+
N6d2+
Nc6xd6+
Qd3xg2
Nb7xb8+
Ng1xe5
Rc2g4#
Nc6xd2+
Rb4e1#
Bc6xa3#
Nb5xb4
Rc1xg7+
Qhd6#
Bbg4#
Qgf4
Qf1b7+
B3xb5#
Ba7b3#
Nc5b2
R6xb8+
B5xf7
Bd8xh4+
Re6xf5
Be3xh4+
Qa8xc8+
Qb4xd5#
Rh2e6
Rg6g5#
Nhc6
Ra2xg3+
Rd7xf4+
Re1e3
Qg6xf6
Qf5g5
Re2g8#
Qd3g8+
Rf1b1#
Ba7xa2#
Nb8xg4+
Bh5xf1#
Na7xa4+
Rc1xc8+
Rb1xc8#
Qd5xf3
Qbxh6+
Rd8xd3
Bh4xg3+
Na8xd4+
Rf4xf6
Na8d3#
Qe3xc5#
Ke5+
Bg8xe4
Rf6g6
Bb6xg3+
Nc7xf6#
Ne7a2#
Qb2xg4
Q6xc7+
Bfd4
Qbxg8#
Rf3xb7+
Ba7b1+
Ba3xb6
Nh8c6
Bb4xd2
Bb5d8+
Rf2xa2#
Nb7c6+
Nd6xd5
Ne1xg6+
Bd8xb2+
B3c2#
Be1e3+
Nh5xd2#
N3xd5
Qd1f7#
Rf2xd5+
Re1g8#
Na1xc8+
Nc5h3+
Bcxe3+
Rh8xc8#
Rdg2#
Re4b1#
Nce1
Rg1xb3#
Ndxg4#
Q3xg8
Nb2c8
Qc1xg5+
Be2b4+
B5xb5+
Qe6xa7
Nc6xf1#
Bg2xe1#
Bc6f7+
B4h4+
Ng1a4
Nf7b4
Qd1xg4+
Bg5g4#
B2e5#
Bg1xb4+
Rb2xb1
N5xc5+
Nb7g3#
B2xa4+
Rdxe3
Ne2xh6#
Bh4xe3#
Qc1xb4#
Q4xc4#
Ra2h6
N2xh2#
Nc2c8#
Bg1xh7
Bg4e1
Qd7b8+
Bg8xd1+
Rb3xd3+
Rc6b8+
Bf7xb2
Qf7d6#
Bh1a1
Ba2xb1
Bg4b6
Bd1xe4
Bh4xe7
Qh8xc5
Rd8xb6+
Ne6a6#
Qe1g3+
Bdg1#
Bg4e8#
Bh8xd1
Nfxb2#
Be5f5
Qg2a3#
Nf4xa7#
Bgxd3
Re7e1#
B4xa2+
R4xf4
Qf7xa7+
Q7xg2+
Qe8xe7#
Bd4c3
Be6xc7#
Nd4e3+
N6xb1
Ra2xd5+
Qh8d7+
Qc8d4+
B3d7#
Ba4f7+
Rg3a7#
Rd1g7
Bf7xg7+
Nbxc4+
Nc7c8
Nc3g5+
Bha3
Nf6d3#
Bc1xf3#
Qgd4+
Qg7f3
Rb5g5#
Bh5h7
Na7xf3
Bh7xb1
Rd2xb7+
Qeg7+
Qe8xe2+
Bg2b2+
Bb2h5+
Ng5a8
Nb3xb2
N4xg3
Qb7a5
Rb8f6
Rgxf1+
Re2xb6+
Bh2xg5
Rc1f5+
Nf6f8#
Qe5xc8
Qb6xh4#
Be2xd4#
Nf1e3#
Nh8xg2+
Qexc6+
Qe1xe2
Q3h1
Qg6xb4
Ng5xa5+
Ne2xd7+
Rg3b3+
Rc8e2
Bf7e4#
Rf5xb6#
Qe4f2#
Be1xd4#
Qfxb5#
Qh1xd2
Qe2xd8+
Bf2xh3+
Nc7xa7#
N5e3
Qd3xg8
Qg4g6
Bhf8#
Qb5b7
Ngg4+
Re4xh3#
Bb4c8
b2
Rh4xb6
Bc7d8+
Ba5xa5
Qg2xe1+
Qexa5
Rb3xc8
Q2xf7
Bb1xf7
Rfc8#
Q2xb2+
Qef5
Qe6xh2+
Nd8e1#
Nf7xb2+
Bf6e3+
Bcb1+
Nb6a5
B4xd5+
Bb2xa6+
Bf6c6
Ba4g6#
Rexc3
Be1xg6+
R8g3#
Bba5
Qhd5+
Ne4xb8+
Qf3e2#
Rh4xf7+
Kxg5+
Qb7h7#
N2xf5#
Q2g6#
Rg4e1+
Nf1g3#
Qeb6+
Qg2e8+
Rb2xe1#
Qc5c8
Re4b8
Bd2xc6#
Ng5xb8+
Ra7e3
Qe5c6
Re8xa6#
Na2d3+
Nc1xg4
Q5xg3+
Rg4b7+
Rgf6+
Rc1g1+
Nh2b1+
Ndh7
Qexf6+
Nb4f7
B6xb3
Qd2a1
Qhxg8
Rec4+
B6xa5
Nf4a7
Bhxb4+
R6f8
Qg2e4#
Ng7d1+
Rh1xh2#
Qb6c3
Rf7xa1#
Bgg3#
Bc3xa1
Bd4xg7#
Qc7xe8+
Qb6xg4+
Qh5e2
Re4e7
B3d8#
R1xe2#
Nf1xd4+
R1xg5+
Qa7a5#
Rb4d5+
Nc2a4
Qexd6
Rd8xh6#
Ba6a3+
Bd8xf7#
Be6xf5+
N1g7+
Qf1e1#
Qf5f7
Rg3xg7#
Nd1f5
Qg5xe1+
Bhd3+
Rb5e7
Rg5xh8#
Ba8b4#
Rg3xd2+
N6xe2#
Bxb5
Rd6h2#
Qe4g8+
N3xb1
Bb4h7
Rf2a4#
Bc7c1
Qb1xa1#
Qg6xg7+
Bd6xh6
Q1e7
Rc1a3+
Nc2xb7+
Qd6xa4
Qf5e7#
Rbxa4+
B6xg4+
f6
B2xg3+
Bb7d4
Nd6xh1+
Be7xd1#
Nbe1#
Ra1xd3
Nb4xf2#
Be8xc7+
Ng5e8
Rc4xf4
Bd6d5+
Qg4a1#
Nbxa8#
Qgh5#
Qb7f2
Ba2b5
Qg7xd5
Qa8xf6
Ng7f1#
Qg4xd3+
Qb3b3
Qa3xa5#
Bg8f4+
Beb7#
Be1xe4
Qh2xb8
Qd8xe5
Ne8xe5+
N6xa6
Ba8g8#
Bb4a1#
Qc7xd8+
Ra6xh2#
Qa2d2#
Bed5#
N4h4+
N1xb7+
R6xe6
Re4a7+
Qh1d5#
N6b3+
Ne3xh5#
Rg6a2+
Bfxe4#
Bcg8#
Qc1xc2+
Rc5g2+
Nhxh3+
Bf2
Ne2xf7
Bc4b3+
Nf5b5+
Qg8xd6#
Nd6h6
N3xe5+
Qc2d1
Bh7xc8#
Ngf5#
Ba1xh8#
Qh3d4#
Qf3g5#
Re1f5+
Bg8xh6#
Nc6a6
Rexf8#
Na6xh7
Rfxe2
Qc8g3
Bf1a7
Nb6xh3+
Nf1xf1#
Be5xd4+
Bc2g7+
Ne2f8#
Be1e4#
Nf1xa5+
Bce6+
Bg3h1+
Bg6f6#
Nf7xg4#
Bb4xh3
Nd4xb6+
Qaxa2
Qb5d3+
Qc2xg8#
Nh5xd4
Qa2xg6+
Rf8xc4#
Qb8xb4+
Ng7xe7+
Qb2xf8#
Raxa6
Be7g4#
Rd4xg3+
Rd8xd1#
Nh2xc1
Qb3d3#
B2d4
Nhh1+
Qe6e3+
Ke1#
Q6e3#
Qd3xb7+
Q1xd4#
B3g2
Nc4c2#
Be6c2+
Qa7xg1#
Rg5c7#
Qe1b5+
B7e1#
Rg7xe3
Rg7b3+
Qa3b2+
Rh6xe6
Ne6xh2+
Qg4g8+
Bhh7
Rf5xf2
Nf6xd7+
Bh1xc3#
Rc2e6
Nb4xf8+
Bhxb5+
Na8a6#
Qa5h2+
Rdxe6#
Re8e8+
Qe8xg7#
Rc7c2+
Ng3d5+
Nb4f2#
Bgc2
Bg2f6
Re1g2
Be5d7#
Bg4#
Q7d5#
Nf7xc1+
Bfxc2+
Ba8e2#
Rh3xd1#
Bh6xg1
Bc7xa7#
R1c3+
Qd2h5+
Nb7b7#
Qh8xc2#
Bg3xf4#
Be2c2+
Nb6xf5+
Rae1#
Bg7c4#
Qh4h4
Bh7h7+
N8xh6#
Bd6a3
Qh4xg8+
Bg3xb3
Bdh7+
Ne5a3#
Nh3xg8+
Qb5e1+
Nd3xb3+
Rh1xd4
Rd6d7
Rd3d2
Bcxg3+
N3xh2+
Ne8xe8+
R3xd2
Bf8xa8+
Nc8xf3+
Bh2f8#
Ng2g1+
Ne1xf4
Q3xe7+
B1xb2#
Ng1xe8#
Qf3d5+
Rdf4
Qg3xb5+
Rf8b8#
Bc4xh1+
Na5e6
Ne3c4+
N2d7+
Re5xd6
Na2xg7#
Rb6xe3
Bb4xa2#
Ng8xh8
Bc1h4
Rff2#
Rb7xf1#
Ne6xf5
Rf5c2#
Rg1f3#
Rh8xf5
Rb2xh1+
Qg7d2#
Raa6+
Nd1e6#
Re2xf4#
B4xh4
Qc3h2#
Rh2e6+
Na2d6#
Rh6e7+
Rh6xh3#
Bh4xe3
Bh5xc4
Rh3xg2
Bd6xh6#
Qe2e6#
Nh1xc6
Ne5g4+
Bb2b8#
Nf4h3
Rb3xd1+
Be8a8#
Qh5c5+
Qh5xh3+
Bf1c7
Kxa4#
Rf5xc7+
Kxd1#
Bc4b2
Rb7d6#
Be8xe1+
Qd3f5#
Rh6c6+
N2g4+
Qb4b6
Qfh2#
Rf7h1#
Nf8c6+
Ng7f6#
B2g2
Bg4h3#
B8d8+
Ng5xd4#
B4xd6+
Nc4xa6
Bb3xc7#
Nd7d6
Rg5xf2+
Qb4c8+
R1a3
Bc8xb3
Rxg7+
Bg5f6
Nf3f4#
N4e4#
Na7g1
Bf2xd8#
Qg6g6
Rg8a3
Rf7h5#
Qdxe7
Rd8e7
Rh4xe8
B7xc5#
Bd3c3+
Nexg5
Ra8xe1#
Na3g3+
Qe8d4#
Qbe2
Bd1b4
Ba3h3#
Bb6xe5#
N7xc8+
Qf3xe7+
Qg1xg6+
N1d6+
Be3e1#
Bg7h4+
Na4xe8
Qh6#
Rcxe7+
Bf7xe3+
Nf4xd7+
Qd2e5#
Q7e3+
Nf2xd5#
Rf6g3
Bb5xf5
Nf4xe4
Qh6xg7+
fx1=R
Ba8a1+
Ne4xe7
Qf3xg2+
Qg8e7
Bcxh6+
Qfxb8#
Q8xc4#
Na5e7#
Rdxg7
Qb8xh5
Nd8a6+
Ne3xg2+
Rc8xd5
Qb5xc7#
Qe6xc7
R4a8+
Bc1xd8#
Rde8
Rb7xb7
Rb2e8#
Qc3xa8+
Nh3c3
Ra1xb8#
Ra4d2#
Rb7xg8#
Nd6xa4#
Rc4xe4+
Nh1xa8+
Re1c1+
Nb8h7#
R3h8#
Rb1xe7+
Qd2xe6
Qg8xa4
Rb5a2#
Rd3b1#
Be4g6#
Rh2xa2#
Be4c1#
Nh7c5+
Qc8h1+
Nc8g5#
Rh5xa5
Rd4xc4
Qd5d4#
Bd6c2
Bc8f5+
Qh8xe6+
R3e1#
Qc7c1#
Rd1c4#
Bc4d2+
Qe6xe4
Qc3xc6
Nb8xe6
N6xh1
Bc1h4+
Be3a2+
N3xb5+
Nd1xf7+
Baxg3
Qhb8#
Rb6xa4#
Rd2e3
Ra8xg5#
Nc2g6
Rc1xb5+
Nf6xd3
Ba1b4+
Rb8xc4#
Nc8h7+
Ra3xa5
Qba6#
Qc3b5#
Bf6c1
Ne1d7+
Nd4xf5#
Nhc5+
Rb8xg2
Bh5xa3#
B7c4
Rf3xc4
Nc3xf4#
N1f1
Qf2xd3+
Qd1f3
Rh4xg3
Qd3xe5+
Rf1xa2#
Nh1xa3+
Rg6xa8+
Rd5xd6+
Bd2xe1#
Q1xb3+
Qc8h7
Nh7xc6+
Ndxf1
Rd2xf2
Bd1f2+
Rd4xb5+
Na7xc4#
Ra2xb8
Naf5
Re2b2
Bf5g7#
Nh4e6#
Re6f7
Rhg3#
R7a8#
Bd8xf7
Rd6a1
Bhc1+
Ba4xd7
Bf8xg5#
Rf8xe7
Qd6xd4+
Qc4xd4
Qd7xh6
Ng7d5
Bd1xh6#
Nd8xd7
Ne5a7
Rg1xe2#
Ng1h1+
Qb3xb1#
Bfa3#
Nf1h3+
Qe8xf1#
Bd3xh8+
Ne1xc8#
Nh3d3
Nh6xh6+
Qhh1#
Nc7c7#
Ne5xe8
Bb1xg2#
Rf5xf2#
Nd2xe8#
Nexh5
Ra8e1
Qb7b7#
Be1c2+
Rh7h3
Ng5b1+
Qf7xa7
Q3xb5#
Qf2xd6
Rc8xa2
Bf8c3
Bbh7+
R6h2+
Bg4h5+
Nf4e2#
Nb5xg2
Be1d7+
Nf7xe5
Bb8d3
Q1xh2
Bf2xf3
Nc7xd4
Ng4a5+
Qe1e1#
Nc1b2#
Rb1xh6#
Rc2c8
Bg8c4#
Rhb1#
Ba4e1
Qhxg4
Rf4xa6#
Rh2e2#
Rg5xd1#
Qb6xc7+
R3h6#
Qdg6
Rf6h6+
N3xa6#
Nc2e6+
Ng8f5#
Rd4xc4#
R7g8+
Qd4xh5+
Rh7xc3+
Ra2a1+
Rg1c6#
Rg3b8
Rc6f7
Bd7e2
Na5xg1
Rf7xh5+
Na3a8#
Rxe3#
B6xb2
Bg1xd7#
Nd4f4+
Bf5xb8#
Rg5xc7#
Rb7f1#
Ra7a4#
R4a7+
Nc5xg4+
Nf3xd7
Q7a2
Qc3xa8
Qg7xc7+
Rb2xh7
Qc8f7#
Qf3c8+
R8c7#
Qh2h8
Bb5e1
Rf7xa3#
Re2b2#
Rc7xa1#
Rcb1+
Bc7xh3#
Nbd8+
Nc7xh4
Qc6f2
Bd2f1#
Bf2xd8
Re5h4+
Qc1c8#
Bd3h7
Qc8xa5#
Be3xb4+
Qc8xh4#
Bb5a7
Q8d1#
B5xc2#
Bcxf1+
Rd3d5#
Na8c1+
Rf1xf5#
Ba7e4#
Ne2xf4#
Qa6f5#
Ra6xb1+
Nf2xh2+
Nf7xa5+
Na4h4+
Rb8d6+
Nh7xf2#
Nc7xb2+
Qb3xh6+
Nc2h2#
Rb1c2#
Qh2xf3#
Qe6f6
Bd2a4
Nd3g8+
Rd8d8+
Qb7xc6#
Bg4a5#
Ba3e5
Qfa8+
Qf8xa6#
Re1e2+
Bd1xc8#
Nf2xc6
N3g8+
Bf4xh1#
Ng6xh6#
Rh8d8+
Qd1a4
Rd1b4#
Bb1xb8#
Nc2xh1
Rd5xd3
Rb5g8#
Ne8c7+
Ra5e2#
R8xh8
Bc5g5#
Ng8d2+
Nc2h8
N8xc8+
Nexb7+
Bd7xd1+
R8a8
Nh5xf5#
N4b4+
Nc3xf2+
Rh6a3
Qb8h1#
Ba7c3#
Bf4g7#
B6xd1#
Bhg3#
Nab5+
Re6xd2#
Rd6xa8#
Ng8a3
Nc2xc8
Bbxg2
Rd3xf7#
Rgh6+
Nh3h1
B7xb1#
Bh4xg8+
Na6c5+
Ng8xg3
Rd2xb7
R7e1#
Ra7g3+
Qc5f4+
N4xg6+
Bf7c2#
Rg3f6
Bh8c6
Qb5xb5#
Rc4e6+
Ba7a1
Rg1b2+
Rd1c1
Nc4c7#
Ba8h2
Nhe7+
Bxg7+
Ka2+
Qhb7+
Nc8h4
N2xf6+
Ba7xb7#
Bd7xd7
Bf4xf8#
Rd6xg7#
N5f7
Qa3xa2#
Nbxg1+
Qhf6
Qh1
Rf7a6
Rd6xg8+
Qc1xc1+
Nh5xd3
Rd7xa1
Bc5xd4#
Bg1g6#
Bg6xd7+
Rd3h4#
Nd8xa8
Qb1xf4+
Ne7c3
Be3xg8
Bd5g3+
Nd3xa1#
Qxe5#
Qh2d8+
Rb5h5
N4d1
Rb1h7+
Nd8g4+
Q8b2+
Rh1g1+
Bcxa7+
Rd5xf3#
Bh5xc3
Ba2+
R7b2#
Rbb3#
Qg7f5#
Ng5d6+
Rg3c2#
Nb1b6+
Bh7a2#
Q5f8
Bf8xg2
Be1xa6#
R1d4
Qe2xd3+
B1xc5+
Nd5h5#
R4d1
Bf6xc3#
Bc8h1
R5d4+
Qb3d1+
Nexh2#
Qe6xa1+
Ng1xc8
Rb4c7+
Qe7xg6#
Qg6a2+
R5xa6
Ba4xa3+
Bd5a8
B6xe5#
Q7xa1#
Be8d5+
Bd7c6
Rg1e7#
Na7xg1
Qhh6+
Rg7g3+
Rd3f6
Qc2xf1+
Qf3b5+
Qh1f7#
Re6xe8
B6xc5+
Nd3xb4
Qc6xh6
Bd5a4#
Qa8xh4#
Rg1h5+
Bfxa4#
Rd6xe2+
Qxf2+
Qb2f8
R7h3
Qd7b2
Qc3xc3
Nh5a2#
Ne5xe6#
Bd5xh8#
Ne8d6+
Qg4xe6+
Rc5xe7
Re3xb3#
Be1d8#
Ng6b8
Qf6xc4
Bh5f2#
Qe1xa2
Re1b7+
Bc4xc4+
Bgxf5#
Qac5+
Rcxg7+
Ba3f6+
Nh3xb1#
Nf6d8+
Bb2xc4+
Nb8xh5#
Qgxa6+
Ba3f4
Nh6xe1#
Bf5g1
Nb5f6
Bh8g4+
Qa1xe3#
Nc1c5
Rf6e6#
Qg1xg8
Ng6g6#
Nd7b6
Bd2a3
Q4xb3+
Q2xc8
B2f5
Ne7xd8+
Qd8g1
Q8xc7
Bha1#
Rf7g2+
Re7a7#
Rb7e6+
Qf7xb5
Qh6xc2
Bbc2
Qd5d6+
Ngxh1#
Rc3xh2+
Bd7xg1+
Qaf4
Rf2e3+
Qg6e3
Bd2a8#
Qexf4
Rc8xa7
Bg1c3+
Rb6xd4#
Rg6h2#
Qhxc1#
Qh5xd2#
Qb3xd5#
Q3c2#
Qh7c7+
Nbf4#
Na3g6
B8f5
B7h7
R2g3#
Rbxf5
R5a8+
Qh3c5
Rf1xd4
Qg7e2
R6xb5
Qd7xe5+
Nc1a7+
Qc1xh4
Nxh2
Na1c5+
Qe6a6#
Qd1b4#
Ne4xc5#
Rc2a3
Ng2xe2#
Qa8xb3
Bh3xh1#
Rc3b2
Bh1xg3#
Rd8xb6#
Re2d2
Rc7xb7+
Rb6b4+
Qe2c1+
Qd8d8+
Na1xa3#
Rf1b3
Rgc5
Nhxh3
Qc5e5
Bb7xh6
Qc8c4#
Qd8xd6
Bb3xb6#
Qb6e1#
Ng3d2#
Nxe2#
Nxa6+
Nf2e5
Qb3xd6#
Bh4xe6#
Qd6e2+
Qhxh1#
Qe6a5#
Rf7d4
Bf4xg8+
Rf2xe5
Rg8xh7+
Qh2b4+
Bb4xe8#
Rbb8
Rg2xb8+
Bb5xb7
Qa4xd5
Ng1b5#
Qa8e7
Ncxb8
Nc7xc5#
Rf8xb6+
Qc2b5
Nf3xg4
Qh8d7
Bc1d8
Nf2h2#
Ba4xb2#
B8d3#
Rxf4+
Q4xb3
Rh5xh8
Be1xh2#
Rexe5
Bf8g5#
Nb2f2
Bf8xc5+
Nd5xf6
Nag4+
Re4a2+
Rdxa4+
Rh8xh1+
Ng3d7+
Qb6xf7#
Bc8g3+
N8xe5
Qf3xd6+
B4xd2
Ng3xa7#
Bf7g5+
Qc3xh4+
Bcc3+
Ba4xb4#
Bgxh1+
Ba3xc7+
Rd3b6+
Nf5e3
Qh8g8+
Qbxg5#
Qg5g6#
Rb8xf5
Rc4xh2#
Bc1xf1+
Qcxh1#
B4h5
Ng1g8+
Bfxb4#
Bb4f8
Nd8xc6
Ra4e2+
Nexf3
Qh8xf6+
Bcb3#
Qgg3
Re4
Qd6d1+
Qf1f1#
Bge2+
N2a5
Nc6xb7+
Nh2xe6
Nc1g3
Neg4#
Rh4g7+
Qfh2
Nh7xh5#
Qb7c5+
Nc2xe8
Rc5xh1+
N2h7
Nc1xa4#
Qc3xg1#
Rg6c2+
Rh1h4+
Bg8xe5#
Rg2d7
Qg5xb7
Be3xb1
Bd5xf5
Nf2b1+
Bgxg6
Nb8xd1+
Nf2xf1
Nc1xf5+
Be2e7+
Rd7e7
Be3xa8+
Qe2xg7+
Ng8xc5
N3xa6+
Rc4xg5
Bb1f3
Qg7xg1#
Nd2g5#
Nc8xd5#
Qb2xc5+
Re1xh8
Rh8g6+
Rh3xh4#
B6xe5+
B5xc7#
Q7xa6+
Qb2d6+
Qbf6
Nf3xe2
Rd8xd6#
Bbxh7
Bca5+
Rb6xe7#
Qce1#
Ra7d3
Qd3h6+
Rc2xh2#
N6d6
Bb4g8
N6a2
Nd4xf8
Nc8xd6
Nab6+
Nb5a5+
Nc6d5+
Nb8d8
Bb5c6
Bc3e4
Ra8xg7+
Ne5b2#
Bb6b8
Bb6xb6+
Ng5xf3#
Qf2xf8
Q3f1#
Qc4xg8#
Nh2a5
Kxg1+
Qa7xd2
Bg6f4
Nd1xd6#
Re3f2
Qh5f6
Rc1a5
Rh8xf7
Nb8f3+
Nf2h2+
Re5xe4
Ra3xh8+
R7b3
Re5b6
Nd1xg5
Qg3b6+
Ba1xc7+
Nf8xc1+
Nh1xf2+
Ne4xb2
Rg3c1
Bxa3#
Nf7xc7+
Rh7h7
Qg8h6+
Rg3xc5#
Nd5e5+
Qb5a7
Qa5h5+
Bd6xf3#
Ra3xd5#
Nc8a1#
Qe1g7
Rf6xg2#
Bd8xe8
Nf3g4+
Na7g7#
Rg7xg4
Qg5xb3
Qg5h5
Qc6xh7
Bh6xe8+
N3xh6#
Rd5c5#
Rcc3
N8xg7#
Bcxb2+
Bf4xc5#
Q5c4#
B8d6
Be5a7+
Qf1xc5+
Rc2xd2+
Rc5d4#
Nd7xg6#
Rd6h6+
Bh3b4
Be1b2+
Nd8xe6+
Qf2xb4+
Bh7xd2#
Ra3xh2#
Nd5xa7#
Qe5a1+
N4h7#
Bb6xg8#
Qa8xc7+
Rb7d3#
Ba6xa1#
Qe6c5+
Rdxe5#
N1xd4+
Bhd2+
Rb1xh8#
Bhxa7#
Rb1f8+
Ba2xb6+
Qe6xa5+
Qc1f7#
Rg4g4
Nfxb4
Qh1xd7
Qg2e1#
Ra1xg8
Qb8xc1#
Ra8xb2#
Qd1c1+
Rf1c3
Ng5b8
Qhxc3#
Nd6c8
Nh1d7
Qh7g6
Nc2e8
Nd2xa4#
Be1xe5
Bc2xh4#
Q3xh4
Bb1d1
Qbxa7+
Qa2b8#
Ng8xe2#
Qb2a3+
Qha5
Baa2#
Nc7xd6+
Ba1h7#
Rd8xc2#
Q6xh6+
Q6xc1+
Nb2xc6
Nd3e2+
Qc1h5
Nd7xa1#
Ngxh7+
Qh6xb3+
Rexc8+
Bc1xb4
Qh8xb4#
Bc5a3#
Bfxb4
Qc8xa6#
Na6d1#
Rh2g6
Ba4e3
Be8g6+
N1xe2
Ne3xf1
Rd3d1#
Rf4xc1#
Bd6xa5
Q5f6+
Rh3xh3#
Rd4g6
Nd8xf2#
Qa7g8#
Bg2xa6+
B4d3#
Bg4g3+
Qd1xh2+
R7b1#
Ba8e7#
Nhxg5#
Ndh7#
Ra3a7+
Qd2d6#
Rh2xh5
Nc5xe5+
Ne4g5#
Qexc4
Ba5xh4#
Qc7b5#
Qc1h7+
Bd4f2#
Ng3xd3#
Ba2h3
Nc5g5
Qh7xf5+
Rc5c8
Nf8xf1+
B8xa1#
Na3xd3+
Nb3g8+
Nb4g8#
Bf4xh2+
Qd4b2#
Qf7xe6+
N4b6
Ne8c3+
Nh8xd6
Bh3xb3
Ne1xf1#
Rd7xa5
Bexa6+
Baf4+
Re1d4+
Bc7xa2#
Be8xd6
Nd1b8
Nf6xh7#
R5f8+
Qf4xf1+
Bc6xf7+
Ba2xf7+
Bh3h8+
Na3+
Qg5c7#
Qb3a1#
Bf8xc7
Bha8+
Bc1h3#
N1xg4+
Re1b2#
Qa4xd3+
Qd8xf2
Ra3xd5
Ba2xb4
Rg6
N7xc5#
Rg7b5#
Ne5c3+
Qg5xf1+
Q8xb5
Ra6xd7+
Ra1xe5+
R3xe7
Qa6d3+
Be8xa8#
Ba1d8
Bh4f2#
Qh2xb1
Qh2xg3#
Bd6xc8#
Rc4xb3
Bexg8+
Bg7c1
N4d6+
Qg3f6#
Nhxf3
Bc6xd1
Rf6a5#
Rg6xh3#
B1xf2
Qf1xb8
Bd2xh5#
Bg2xg3+
Bh4e7+
Nge2+
Nh8xh3
Rg2d5#
Bh5xh3#
Ng4d7
Rh5xa6+
Rd8xf4
Qh3f5+
Ne6b3+
Na1xa3
Qa7b3+
Rd4xf4#
Nc7xa8+
Bc1xb4#
Rgxb4+
Re6g7
Na1xh3#
Bcxg2+
Rg6xf6
Bc1xa6
Bg2b4
N7b4+
Ne1d7#
Rf7xf3
Na2xc8
Nd2a2+
Bfh3#
Qb8xf7+
Qe1xc1+
Qh8h7#
Qg1d8+
Qf1xc3#
Rgd5#
Bgxc3#
Bf8xc5#
Bf6h1
Ng7xf1#
Nh6a2#
R5xg6#
Nh2h8#
Na7c6
Qh3xb1+
Na1a2+
Na6b5
Re5xb7#
Rg3h6+
Bb7f4#
Nh4xc1+
Qgxa2+
Ne7h2
Bc7a1+
Qhxc7
Rgxe1#
Ndxe7#
Qc3g4
Bb1a2
Nf7xg7
Bxc8+
Qh1e3
Rb7g2#
Qd8b6
Rf7xb2
Re2g4+
Qg4xc2+
Nd5a6+
Qg6e7#
Qg2xd4#
Qf2f6
Qb5xf8+
B7f1
Nf4a4
Qh3xc7
Nh4d2
Nh6xd5#
Nf8xd2+
Qa1c4+
Bb7xg2#
Bc8xg5+
Rf2g5
Nhc1#
Qf6b3+
Qh5g7+
Nh1h6+
Q8xg4#
Nb7f5#
exd5#
Bab3
Nb3h4
Ng6xf7#
Ng5xb3#
Bg4xd7
Bd3c2
Qh2xf8+
Nb1xh5#
Qb6e7#
Qf1xg6
Bd3e1
R8g4
Ra7xa5#
Nd5h4+
Nfc3+
Bb4f3+
Bf5xh4#
Rg8xa3
Qc6xh3
Bfd3+
Ra5b4
Rc7xf1+
Bb1xf3#
Bc4d4
R1a2
Bg2xc8#
Rcc4#
Ba3xh8
Qe6a1+
Be5xe6#
Ne4xf5
Ra3xg2#
Bb4h1#
B5f6+
Qaxd6#
Nh7xb6+
Ngxg5+
Qh4xg5+
Qc2h8#
N1xf7+
Ne6xh2
Qh3d1#
Rf8f2
Qg8b6+
Bg8e7+
Bb4d1#
Bc8g8+
Nf8xc8#
Rb5xb2#
Be6xc6#
R7g6
Ra4xa8+
Qb4xf1+
Q6xf7
Ne1a7+
Qe3xh2
Ne3g6+
Bb7h5+
Rf8xe4
Rb2xf8
Qa2xf2#
Nc1xe7+
Q3d6
Qf8a8
Rd8f2+
Qe5xf7
Be2e5+
Na3c7+
Ne4a6#
Rb5xf3#
Bc4xg2
Rb4xh6
Qf2f7+
Bf3xc4
B3f1#
Bh3f1
Rh2f2
Bc5e2+
N8xa7
Nh1xe7+
Nh1xg2+
Rb8xd7+
Rec3#
Rxg8
Nbc4#
Rh8xa7
Qc5xh5+
Nc3xd5
Nb7b3#
Bxe8+
Re8c5+
Nh3xe7#
Ra5xd5#
Ra3xh7+
Be8xe5+
Nb3xg6+
Ra5xh1#
Rd6xb2#
Bbg1
Ng4c8+
Rb1e7#
Raxc2#
Ra8xh5#
Nda4
Bhb7
Be1b2#
Ng8xa4+
Qa8f2#
Nf6b5+
Qg7d3#
Bd8xd2+
Bc6b1
Be2xg6#
Qa7xe5#
Nh2xg3+
Q3c8#
Ra1d1+
Ba1xb3#
Q8xb7
Na6xa1#
Qg8b2#
Qd6xh4
Qc7xb5
Ba4xa6#
Qdg5
Qe1xb1#
cxd6+
Rc1g4#
Q8f6#
Qe8xf7
Bg4xh8
Rd6xd5#
Rd8xf6
Nhh2+
Bc7c7#
Ng5c3
Ba8b3+
Bb8d2
Q4g8#
Be1a8+
Qh1xc4+
Qd6h3#
Rc3c1
Bce4+
Ngc1
Kxc1
Q6b2+
B1xa5+
Bc2xf6+
Qf8xb7+
Re1d4
Ba4a7
Nbxb4+
Bf7d5#
Bf5f5
Ncxd1
Re1b1
Rc2xe1#
Bg6xh2
Ng3xc6#
Ba4h6
Rg4xb8+
Na2d7
Bd6xf2
Qb5a8#
Nad8
Ngd8+
Ndd3+
Rc2f5#
Rcxd5#
Ra5h2
Nh5xe7+
Rh6xd8
Ne8xg6+
Na4xg3+
Rd7xe7+
Qd5xg5
B6h7+
Qh3xc1+
Re5c4
Rd1d7#
Nd6xb7
Rd6xc3+
Q2d5+
R1xb4+
R5xg5+
Bec3#
Ra2xc7
Nd6xd1#
Q4xd5+
B6xd8+
Rc6d3+
Re8xf2
Rf5xa2
Rh5b8#
Rd6xd5+
Qd5f6
Qa5xe7
Ba8a5#
Nd5g6#
Rg5xf8
Rd5b7+
Rb1xa2+
Qg8b5
Na1h1#
Be2g3+
Nh3+
Bfc6#
B8xf8+
Nc4c5+
R3h3+
Be5xb2+
N3xc8
Qb7a4
Bh6xd3#
Qd5xd6#
Ba8xe4
Na7xa4
Q8f3
Ng4g8#
Ra6xc7+
B3xb8+
Qh4f1+
Nb1xc8+
Bdxh5
Nb8xh2
Rf8xc4+
Qf6xg5+
Nexh8+
Bd5xe4#
Bg7xb3+
Na5a8#
N4f5+
Qa3f6+
Qf1d3
Rdg1
Nc5xb3+
Nh6b4+
Qh1g8
R7c1+
Bb7f7+
Ng2g5#
Nd8d5+
Be5f7+
Rc8d4#
Qg4xf4
Bg7e2
Qb2xb4#
Qe7g5
Rf3+
Qe4xa7#
Raxe5#
Rg1d5+
R4xb1+
Bfb3#
Na6xf2#
Ba3xd4#
Rc3f1
Bf4d6#
Be6xd5+
Ne3c7+
Nh5d4#
Qc6h3
R6xe5#
Ba1b8
Be2xd4
Bd6e3
Nc8d8#
R1xd5
Rc2g3#
Bc6xc4
Qd1e2+
Nc4h2
Ne3f1
Ng3xf6#
R2b4
Qb2h4
Nc8xc5
Rd7a3+
R2h2#
Re3f1+
Rg6g3
Bbe5+
N5xh8
R6h3#
Bd6b8#
Qf2xa5
Rf8e1+
Nd3e5
Be7b7+
Bb3b8
Qa3xg6
Rh4a8#
Qe3a2+
Nb3xh8+
Kxd3#
Qa8xe4+
Nd5h8
Nc2e1
Bg4f4
Bf5xh1#
Qc3d7+
Nh6xe2+
Bh5xb1#
Nb2xf8#
Rh2g8
Nh6h5+
Rf6xh1
Qa5b8#
Qb8f5#
Rf4c3
Qbxb6#
Qf6xg3
Re8d5
Rf4xf4#
Rh5xf8#
Bd5e2+
Bg5xb1+
Nd4f6
Nf7a7
Nb3xh8
Qc8xe6
Ba7h5+
N7h3#
Nb8xb1+
Ng4e6#
Bb5xc8+
Be5g2
Rc1c5
Qe8xg7
B1xb1#
Rb6xb1
Bh4g7+
Rg4a4#
N2g8+
Ng3c5
Nc4xg7#
Rh5c5
N5e2
Bc7a8+
Na2h6#
N5xa7+
Nc4xd3
B1d5
Re4xe4
Qf4f1
Bf2xf3#
Na5a3
Nxc4+
Ne3d1
Rb3xh1#
Nfe6+
R8xc8
Nh3f3
Nh5xg2
Qf3g1+
Nb7a3#
Bd3xe3+
Bexb2+
R2xd3+
Bh1xb8
Bg6xc1#
Bc4h4
Rh8xc2+
Rf1xc5+
Qf2e4#
Qb6h6+
Qf4g7#
Bd7b8+
Nc6xg8
R6h5+
R6xh8+
Rf4xf2
Nd7e6
Na7
Nd6d7#
R3xd4
Qcd8
N5g3+
Rfh2
R3g4+
Ba1xg7
Raxh2#
Rxd4
Bb6xa5#
Bc3d1
Qb6xf8+
Bc4xg4+
Nbxc5+
Q2f2+
Bg3c7+
Qf6#
Bh6h4+
Bf5xh6
Ra8xf3+
Rdg6#
Nh5xa6+
Qg2a1+
Bg1xd2
Rf3e1
Rb2xh3+
Qba1#
Nb6h6#
Bb7xc2+
R7g1+
Nc2xa3
Rdxf1#
Nf1g5+
Rf6h3
Bh6e6+
Qe2xg1
Qxg5+
Rxd3+
Nb3b4
Rf3d6+
Be6xa5#
Re6xe4#
Bb7xa6
Bh2c8#
Na5xc6
Qd1d1#
Ra7a8#
Qc8f7+
Be8g2+
Nee5#
Nc8e8
Nf8g1
Ba5g5#
Ng6h7#
Na1xd1#
Rg2c8
Ba8d3+
Rh6f5
Qf6xb1+
Nxg6+
Nh7xe3#
Qde2+
Ra2xd7+
Nah2#
Bc1e8
Qd1d3
Nd1xg8#
B8c8+
Bd4h4#
Bg7xc7
Ra1xf1#
Qf8e2+
Qh7f5#
Rge3#
Rg3xa7+
Rf7f8+
Bh2a7+
Nb7g7+
Qh6xb3
R6xa3#
Rf6xd5
Rg4f8#
Ng5b2
Bb7xd2#
Qg6e6+
Rf7xc6
Qf5xa4#
Rf2xa4+
Rb4xa4
Rcg8#
Qe5xa7+
Q8xb2#
Nb1xd4+
Qcg6#
Nh1f1#
Qc8g7+
Bh4d5+
Bd8a6
N5xg5
Nh4xb4+
Qg2xh5#
Rf5f3+
Na2xh8#
Qf7d3
R8h2+
Qdxh4
Ba3xb1+
Ba4g1#
Be1g2
Qb1g3#
Rc5xg6+
R6d3
Qg7d1+
Rf1e6+
Rd5xh6
Bh5xb6
Bh2h6
Qh3xe7+
Nh2xc2+
Na5c4#
Re8h3+
Qd6xh1
Ba5d5+
Nd3g7#
Qh1xf7#
Rg5b6#
Qc8a6
Rd7b2
Bg7xh2
Qf3xa1#
N1c6+
Rc7xd5
Bc4h8+
Ng7c2+
Kd2
B3e6
R6c5+
Qe5xb7#
Bf6xf2
Nf2xc6+
Q2xe7#
Ra8xa8
Rf8c1+
Bb1xd7
Rd4g4#
Rf5xe7#
Rc4h3
Qc1xb5+
Bhb6#
Ra3f4+
Ng1xb4
Qh1a4+
Qf3a3#
Rb3xa5
Ng7c8
Nb4d4
Qa7xh3
R2xc4#
Rb3xe5#
Qe2xg2
Rb4xg7+
Nc3xe3+
Qb5b4+
Ra8xa8#
Na1xf8+
Rb8b6
Bb8a8+
Qe5xg8#
Be4a6#
Nd1xg5#
N2xg3#
Qd3xh1
Nh6xd8
Rfxd1#
Rh4xg7#
Nh2xh8+
Bc5xc6#
Rg8g8#
Bb3xd8
Qg5xe3#
Rc3xb6#
Qf7xa1#
Qb6g3#
Rh1c3
Rad3+
Bg1xa4+
Qa7xb3+
Qg8e6#
Beh6
N2xh7#
Qh5b5+
Bd6b1+
Nb4xd7#
Qb4c4#
Bfxa3#
Bf6c4
B2xc4
Bf8xg1+
Rd2xd2
Re6g2
R3b5#
Rd8f4+
Nb4xg4
Nd4g6#
Bf4e2+
Nd2xb6
Qaxh7#
Rd2xa6+
Qa5c2
Bgg8#
Rb7b5
Nf3e3
Rb7c4#
Qc8a4#
N2h5#
Nae3#
Ra1f5+
Nc4a8+
Ba5xg5#
Nh6xg4#
Qb3xf1#
Bg6xh5+
Kxd4+
Qfe2#
Bd7h6
Bd7xf1+
Qf6a4+
Ba6xg1
Bag5
Nc3xb3#
Nh5c6
Rhg2+
B4e8
Nb2xa8
Qhxg7#
Nh5b4
Rd5b6#
Qa2xf3
Qg7xf7
Bb2xb3#
Nh8xc5+
Bf7xh2
Qf2d6
R4h7+
Be7d4#
Nc1xf3+
Bg6a8+
Qd6xe5+
Nf2xe6#
Ne6xf8
Ncxc3
Rb2xb8
B2xc2#
Nexe1#
Qhxf3+
Na2d3
Qc4xg1#
Qb2e4+
Qb2c1
Nf2f1#
Bh1a8+
B6f4#
Qf4f6
Qb8xb5#
Qc1xh6+
Nh6xf4#
Bf2xf6+
R4xb7#
Qc4d3#
Nb7c5#
Bg8xb3+
Nb4f1+
Bh2g2
Qgxe1
Bh1xd6#
B8xe7#
Nh8xd7#
Bh2g2+
Nb5xa1
Nb4b4
Bf1h7#
R3e2
Qc8h4
Ba5xb6+
Qg4xh2+
Ng5xg6
Rh5xb2#
Ra3h2
Rd6xh2
Q2e7#
Nd6xa1
Qg2xg6+
Qc8xg6#
Ne1d2
Qexd5+
Ra6f7#
Rc2f4
Qff1
Be7a1
Nf4xc4+
Nfa5+
B8xf2+
Bb8xb1
Qg2b1#
Qf8a5+
N5b3#
Re8g2
Rf1f3#
Bd4a1#
Rc8xc6#
Nb2c5
Rc7d3+
Rf5xg6
B1xh5
Rdxf7
Qc7xc1#
Nf8xf1#
Ra6xe5+
Rf8d8
B6a1
Ra3xh4
Re7xe6#
Qg6xg5
Be8xh3+
Bd3xf3
Qhxh6+
Qh6xd4+
Qa6c3#
Nexc5#
Ng4xh6#
Nb4f2
Ra6b2
Qac7#
Bb2xh7#
Rf1xf2+
Bd3xg5#
Qa6e1
Nhxe3
Ra3h8+
Ra1xe6
Nf3g7
Qg6xb7+
Qa8d2#
Rd3d1+
Bc7xc8+
Ra1xd8
Ne6b1+
Bc4xa4+
Rc7a2
Q4xg1
Bbe8
Ng6e5+
Rf3a6#
Q2b1#
Rb2c7+
Nb5xe3
Re6xf3
B2e1#
Rf7xg3
R1a6+
Bh1xe3+
Q1b6#
Nf1xf2
Rb5xe8
Qa6f4#
Rh4xa5#
Qa5xa5+
Nb7c3#
Qg7b3#
Qh6xh3+
Ba8xc8
Nb1xc3#
Ra3a6#
Rdxd8+
Nf4xc2
Qe3b5
Be7d7+
Nbd2
Nh1f3#
B4d1+
Rc3g2
B2xb4+
Qd1xa3
Bf7xd6#
Rb7e7+
N6xc5
Ra7xd7+
Rh8xh7
Ne3xd5
Bb1xb7#
Bc8xh2+
R3d1#
Bb4xf4+
Qh8f3+
Qa3xb1+
Na5xf3
Qg4g7+
Nc4xe1+
Rb6f7
Nxb7#
Qb2xg8+
Ng1f6+
Bg3h4
Qe5xd3+
Ng3xd5
Rc5b7#
Rb7xb5
Rb4g1
R8xh3
Nh3a2+
Be4e3+
Rb5xa4#
Nd6g8+
Ncxe6
Kxd7
Qcxh8
Qc7g4+
B6xf6+
Qg3a5#
Qe8xh1+
Rexe1
Rg6xc8
N6xe6
R2xe7
Ra5xb8#
Bd7xb6#
Bd1xf2#
Bg1xe1
Rc8xa2+
Ne4d5#
Bg7g2+
N7h8#
Bc6xd8#
Nd3a8
Q1f1
Bh7xf3+
Rg4xg1#
Rc3xh7
Qe2b2#
Bb6xh5#
Rc7xb4#
Be7f1#
Ra5xe2#
Rf7g6#
Na4xe7
Rh1c5#
R8d7#
Rh4e3#
Na5h2+
Bb5xg4
Na2g8#
