Qe1xd7
Ra4h8
Qa3h7
Nb3c2
Qb7c3
B7c2
Rh3xa8
Nc8b5
Ba2xa2
Qfe6
Na6xb3
Ng8g3
Rd7h8
Rb8xc2
R4b1
Na5xe2
Bg6xf7
Qh2xc8
Ra8h3
Qa1xc1
Na1g5
Bd3xb3
Bc8xa1
Qg5xg8
Re7a8
Qg3xc5
Ndxa3
Rb4xh6
R3xd3
Qf4xb8
Rd2xg2
Rxf2
Rh2a7
Bexb4
Ba5xa1
Bh5xf2
Rb6e8
Bh5xe6
Qh1xe4
Rxa6
Rc5g1
Qe6d1
Ba6a5
Qa6xh5
Qb4xc7
Nb1c7
Re4b2
Bf5xa3
Bc2xa5
Ng6c2
Nf1xa4
Bd8e5
Nh6xc6
Bd4h6
Rc5xh3
Bh2a7
Q3e3
Na8f7
R7xd7
Qch8
Qc6e5
Ne2g5
N5xa4
Be2xg1
Bh7e1
Bc3e7
Qc7xe2
Bc8xb8
Ba3f5
Be8g5
Rd7d1
Bg6b8
Re4c6
Rb1xg3
Qc1xc8
Re5c2
Nb8xd2
Q6xc2
Kf7
B3xb4
B2e1
Qc1g4
Nc7c5
Nd6xd5
Ng2b8
Be2xa2
Bb8xb2
Nh1f3
Rc4b6
Qa6b6
Bc7f1
Bc3xd2
N5xb3
Qab6
Rf3xg6
Nb7c7
Nh4h4
Bh6xb1
Bg4xb5
Qb5d7
Rb8xf8
Rf1d2
Na8h3
Rc2d5
Rc5e4
Qc2f2
Qhxe5
Qf7xf8
B8h3
Bd1xb1
Qd7g3
Be3g4
Ra6e1
Bfxd1
Ba8xd4
Nb6h1
Bd3xd2
Ba7g1
Rd6xd4
Qfxh1
Rb3xf1
Rf7g3
Ra2g3
Qb3f1
Ng4d8
Bc6xe8
Rf1xe1
Qc1h5
Rgxf6
Bda3
Bb2xc2
Rf4xg1
Rc5xc4
Bbc3
Nf7xg5
Rf7f2
Bg1xa6
Qg7xh2
Ngb4
Rf2f6
B7d3
Be8xb4
Na7a2
Ncc2
Ndxh3
Re4xg7
Ng5c1
Bg8xd5
Rc5xh1
Qf4h2
Nc2d6
Qh1g5
N5xh4
Qe5xg2
Rc7e4
Be7e3
Rh6xf4
Be8xe7
Rb6c4
Nh3h6
N5xe2
Nb8b2
Bgxd8
Na5f6
Qg6xh2
Rf5d6
Ng8g4
Na5xh1
Qxf2
B7xg5
Bh2g1
Bf5f1
Qh2xh2
Nc7xd6
Rb4xf1
Rc2xb4
Nc5xa1
Qh3xe7
Rf2a3
Bg8xc1
Qexh5
Qe6a5
Rf5e1
O-O
Qa4xg6
Bb4a2
Bh8h7
Qa6xe2
Qc8xg7
Qe8xb8
Rxd5
Q3xh4
Nf3xe5
Bf8xa4
Ba6c5
Ng5xb2
Qc8c6
Ned5
Bbf4
Qf7d6
Qf7e5
Qf1d7
Nd4xg8
Qh8xd2
Bc6h6
Rhxg4
Nb2xg1
Rf6xb7
Qe5c7
Re4c5
g4
Rg5xd8
Bh1xh1
Nb1xd8
Bf6xe7
Kc1
B2h7
Kd7
Nh2xb7
Qb8xb7
Rf6xe6
Ra6xf6
Q6h1
N2xe1
Qg3xf6
Rg7xe7
Bh7xf7
Na6d7
Nd4xh4
Bb4xa4
Be1e5
Bf2h4
Re8xe3
Qaxa3
Bb6xe8
Qh6xb3
Qd5xf2
Rgb7
Rdb8
Na8h4
Qc1xh5
Qg2xc8
Ng3e7
Qb3xg1
Qgc6
Qe6xh3
Nb8f7
Na4xc7
Qa1xh1
Bd1xe3
Naf7
Bg6xa6
Nf4xh3
fx1=B
Nf1a8
Q5xb8
N8xd8
Rc7xh7
Be3xh6
Nb5c1
Naf8
Qg2b5
Rg3xc2
Nbxf5
Nc7h5
R5a2
Be7xf7
Bb8c7
Rh7xa2
Nh1xg3
Q3f2
Ra4c1
Qg4xa7
Bb4xf2
Nh1c4
Qfc1
Qa1b2
Qh4g3
Rfxf4
Nb3a3
Qa8e3
Qf7xf3
B7g8
N5xa2
Qa2c7
Nf7xa6
Qe8a7
Ng1xb6
Qg2xa2
Qag6
Ba5g5
Ne3
Rfa3
Rg7f5
Bbd7
B4xg7
Na5d6
Nh1e5
Rbxg5
Qaa3
Nf3c4
Qfxg5
Q8c4
Bhg5
Nexg3
Qcxd4
Bh3c7
Nf8xg2
Q8e6
Bh2xf4
Rc2f3
Nd3xg6
B1xe3
Ra6xa6
Qxd4
B3xc7
Qa6f4
Qg7xd4
Nc2xf1
Nd7xh2
Rba2
Rg3e4
Bf4xa8
Rd8d3
Bf8xh3
Qb8xg2
Be5a8
B5xd8
Rd3b8
Rh3b3
Re5xh6
Nb1xe4
Nc6xd3
Qf3xa3
R6xd5
Qf7d2
Nf5h3
Bf3xe5
Bd2xh2
Ng6d4
Qd3xd3
Nb1xd3
Ba3xc8
Ne7a6
Rh7xc4
Rb3xg7
Nh5h1
Bd6xg7
Qb3
Be2
Rh3h2
Rxd1
Rf6c7
Rd4xa5
Qe1b1
Bc8xa5
Bd8b7
Rc3xd7
Nfxg6
Nff7
Ne8xa8
Rg7d2
Nc5xe3
Qh8xc3
Qd1h2
Rb4d7
Ng7b3
Naxc4
Na7b7
Ra8a5
Be6f4
Bb2xf1
Nb1xa8
R4d1
Rb6xc7
Bc6xc5
Qgg1
Rc2g8
Ne1xd5
Qe4a6
Qh2xd5
Nd8c2
Ne6e3
Qd5xg2
Qb6a8
Nh5d1
Rh7d1
Qh8e4
Qe8xd8
Bc6c1
N4xc1
R1f2
Rh1h3
Nf1b5
Qc2xc8
Rag5
Nfxd2
Re1xf7
Qc6h6
Qd3e4
Q6g1
Nc7xa4
Qd7xc4
Rdxb1
Raxe8
Nd6
Ba7f7
Bb3xd8
Nfxd8
Baa3
Rh2xa1
N6b6
Bg5d6
Bg5xb1
Ne1xh1
Nc7xe4
Qe7e1
Nf7h6
Be8xc7
Rf3xb5
Rd8c6
R8a5
Bb2xf4
N7xh3
Nd2xa2
R2xa7
Ng5xc4
Bb6e2
Qh7e7
Bc5f3
Qb3xe7
Qc3g3
Bc7d2
Qe1d2
Ng8g6
Bb6xa5
Qd1f1
Bd1h8
Rb3xa3
Qb2f8
Nh2e2
Rh4xg7
Nh1
Naa7
Rhxe4
Bb7a6
R5xg5
Bh4xe6
Bh5xe1
B7f3
Ng8f5
Rf6xe4
Qd4xd4
Qa3xd2
Rc2b7
Rb6f5
Rd8g8
Qd7e4
Qb3xc7
R5xh4
Re7xf6
Qh6xa1
Q2xa3
Q6xh8
Bb2xc1
Nb4xg3
Rb6h3
Nh6xg1
Rf2h8
Bf5d1
Na4a7
Na3g8
Bb2xg2
Qfa7
Nge2
Qe1c8
Bg7e1
Qh4xd8
Ba4xg5
Nd1f5
Ra2d1
Nc7xd1
Ne1xf8
Nf4a6
Bgxg7
Qh8xa2
Re4a7
Q8a1
Be8e2
Bf1g6
Ra8f6
Qb3xc6
Nh2g6
Nc7xd3
Q2e8
Qc1e1
Bf3xc3
Qhxf6
Qg2xh6
Bcf2
Qd2xc7
Nh1d1
Ra3xb5
Rg8b1
Q3h5
Qgxa1
N5c8
Ne2xd5
Qe8xc7
Nc2xg1
Ng2xf4
Rb2xd4
Nc7xf4
Qh7xh1
Qh5xb7
Qa8xd6
Qc7xd1
Rcxa1
Qg1g7
Raxg5
Nc1xe5
Ne4xc7
Bh5b7
Ra6xh8
Bg3xf4
Bc1c7
Nexf4
Qd8g3
Qd4a1
Rg5xe1
B3d4
Re3b7
N6a6
Ra3g5
Bh7xf8
Nf4xd7
Bg2xf2
Bd6xg3
Nd2xb6
Bh2d8
Qf8xh3
R7g2
Rb6xh8
Bg1xb4
Nh1xc7
Nf4c1
Rg4f5
Qd2xf2
bx1=N
Bfa3
Qh8xd4
Rb2xh8
Bd6d7
Qa4xd2
Rd3b7
N7xe3
Nf3d5
Bc1h6
N3xb8
Rd4xh1
Ra2xg1
Be4d7
Bf3h3
Qd4xb5
Ne6e2
Qd4b2
Bd3xa7
Re4d3
Bg6c1
R8xh8
Rb7xg8
Ba6g4
Bd1xa1
Nf2xa5
R8f3
Qd8f8
N4xh8
Nc8xa3
R6e4
Ba7xf1
Nh3xh8
R6g3
Bd5xb5
B4xc8
Bd2a2
Nf5xa3
Rc3h8
Rd8xb6
R4g8
Qe6h5
Ra4xe2
Rb7xg2
N4f4
Ba7xf7
Qb7b5
Rc7xb8
Bc8b1
Qf7xh7
Nb4xc3
B2xg6
Nh2d1
Re5b3
Ne5xd2
Ng6f1
Qf7a3
Be6f6
R3xc7
Ne3xf4
Qbg4
Qhxa7
R5f8
Rg3xe5
Bc2xg7
Rd2xf3
Ba5xa4
Rh7xa3
Nb4xe5
Rg5xc1
Qc8h1
Ra6xf3
Ng7h1
Baxc4
Nc8f4
N4b2
Nf2h7
Qb6xb8
Nc7xa1
Qa4xb8
Na4xe6
Nd6xg6
Ba8xb6
Ng4xc1
Rc6xh1
Nh2xe8
Bg2xa3
Rb5f1
Nc7xc5
Bh2c6
Q1xa3
Bc1xe3
Bh1e3
Red2
Na6a1
R5h1
Bd3b7
Na3xh7
Q8xg1
Rc2b4
Nb5b7
Q5d7
R1a2
Rd6xe8
R1xa1
Nd7a2
Qf8xa5
Qc4b4
Nc3xb1
Nb7xg6
Qa3xb8
Qb6f2
Nb2b8
R5b8
Rc6b4
Nf2c3
Bh8g2
N7c3
Qa7xe5
Rf1a8
B5a5
Ba8xh5
Qbxf7
Ba2xh7
Bc1g3
Rb7c1
N2xa2
Qh6c1
Nf2xb6
Re8c4
Ba5h5
Q1g7
Be6e4
Qh6c7
Bg2c2
Bf4d8
Qf5f5
Bea6
Rb4a1
Rd6xg5
Na4a2
Na6g6
B8d8
Ra5xb1
Nh8a1
Qa6b3
Rh7h6
Qd3xf7
Bd7xe6
Ng6c8
Rc7a3
Bh3b8
Bb4f4
Rf5xb5
N4f7
Rc7xe5
Bc6xc2
Qh3xb4
Na1a5
Qc2xc7
Qf8xh1
Bfxb7
Ra7xg6
Nb6xh4
Qe7a7
Nf5xc7
Na3c1
Bb1xf4
Bc3g3
Rg6xe7
Qc8xh6
Rh8e8
Qf5f3
Be2d2
Nb2xe3
Rf6c2
Qa2a2
Qe7d1
Ra1d1
Nf6b4
Rh2d5
Neg3
N7d8
Rh6xa8
Qbxe5
Qd3d6
Qb8f2
Rf3xf1
Qfxd4
Bc8h2
Kxe5
Bgxc7
Qe5b5
Qb2xa8
Ng5xf6
Bh7a8
Bf4e5
Rc8f6
Nc1b8
Qa7xg2
Rg8xh4
Reb6
B2a8
Qb2xf6
Qb8xc5
Ng2xg3
B6a1
Nc2xa3
Na6f8
Bc5xf1
Rd3g8
Qd7d6
Rg1f5
Rb8xg4
Qd7xb7
Rg8xd6
Nge6
Qf4xd1
Rh1xe3
Be1d3
Be1e3
Nc7xc4
Qh6xe5
Ra3xa7
Ba2d6
Nb4xb3
Qa5xe1
Rc8xa8
N5xb7
Nd3xg8
Nc1xf6
Qc7g7
Bb3g3
Rg4xd5
Ba2e1
R5xb1
Qb5xd7
Ba1xc2
Bb1c7
Rh5b1
B4xh2
Rh6xd7
Nc3d7
Bd6e2
Qc2b2
Rg7b7
Ne4a3
Qg1xf4
Rg7c8
Bb2xc4
Rd6e2
Rh3xd8
Qe3xc3
Nb2xh2
Qg5xc1
Ng8g1
Qg2d1
Nh8c7
Nc4f7
Qf6h2
Bb8xb7
Bdc4
Bc7xc2
Rd3xf1
Qf8e1
Bb8xb6
Q6xf3
Qd2c3
Rf4e3
Qg8g6
Rd3xb3
Bb8xf8
Ra7xe1
Nhxg8
Nb2xb2
B3xa2
Bf5a7
Rd4xb4
Ng2e3
Na3b3
Qdxe2
Naxb8
Bdd4
Be5e5
Nd7e6
B6xe5
R3xg1
Bd4a4
Qd5xb4
N2f3
Nge5
Rb7c7
Ra8c4
B8c6
Qf8xb6
Re4h6
Rc3f7
Rd6e7
Bg2a1
Qh3a5
Qf6xg6
R4xa8
Rb5c2
Bf7xc6
Nd7f7
Qe8e8
Nad2
R5xb7
Be6xd8
Ba1h7
Q6f6
Nd8b5
Nhe8
Qe2c2
Rc5h8
Qf3xf7
B6g5
Nb4d3
Rf7d2
Bd1xa7
Na4xf8
Rexf7
Qg3xf8
Ba5xg3
Qe7a8
Qe2
Ra1d7
Ne3a1
Bc3xd6
Ra3xd6
Nd1f2
Nc5g4
Rb4c8
Rg6f1
Ra6xb5
B2c6
Nf2e6
Bd1xg8
Bg3b2
Rf2xh1
R2xg8
Nd8xg8
Rh8g8
Bb2xc7
Qd7b2
Qe4xg5
Ng7f5
R2xe8
Qf1xb5
Qe4c5
Ne8d6
Qe7b2
Qd1c1
Rh1xg8
Na4xg3
Rh5
Bd3f2
Bg6xb1
Bh7h6
N6xe5
Qde7
Rd7xb6
Raxh7
Be3xf8
R3g7
Bh1d1
Nd4xe5
Bbxc2
Rgd7
Nh4xh1
Ng8xe4
Bd5xc7
Nh4xb1
Bha7
Nda6
Qxc3
Ba4xa2
Qexe4
Rh3g2
Na3h4
Qg4xf7
Qac2
Nb6c4
Qa2xg7
Bg4xf1
Be6h4
Rd8a7
Bh3a1
Rh5h8
Bb5xf2
Bhxg3
Qcxc7
Q2g7
Nh3e6
Qh7xc3
Bc7xa4
Nh1xb6
B6xe4
Re6xb6
Ne2g7
Qb3xf8
Qd3xf5
Ra5xe4
Rbxa2
Rd8xc1
Rc8xe4
Bh8xg7
Nc8xd3
N4xh4
Qcxa8
Qb2xc6
Bh5e7
Nc5a1
R5xa1
Bf7xd3
Rf1b6
Nc5xc1
Rg7g6
Nd8b1
Rh7xc7
Bc4xb8
Qc1c2
Qb7xc3
Bf6g2
Qhxh8
Bh7xh6
Qcxe3
Qc4a4
Ne1xb5
Bh5xh6
Bc3xd8
Be4c2
Nb6f1
Bc7xd3
Qba1
Qcxg7
Qd6xh8
Qd7h5
Nh8b3
Bg4xa7
Nd2xf4
Rb4f3
Rcxe6
Nb5b6
Nc3xf3
Nc4g7
Q1xb5
Qa3d1
Nf6xf4
Bc2f7
R6xc7
Bhxf8
Bf3xh4
Re3xg2
Qb5xd2
Q2xg1
Nh5a5
Ng2xf5
Baxd5
Bh5xf7
Na4h6
Baxc8
Re4d2
Nb7d1
Nh2xh8
Qf8xe8
Nbxb7
Qa7xc1
Qc5d8
Nd2xc3
Bfxb4
Re1c7
Na1xh5
Bh2e7
Rh1b3
Bf5b7
Qc6xd2
Bf7xf3
Nh4e7
Rf8xe1
Bc5xe2
R8xb4
Nd8xb6
N5xd6
Re2b6
Re6xe6
Qa2xd4
Bc6g3
Qd8xe3
Ndxc2
Qc3a2
Raxa2
Qa6c3
Ne3xc8
Be6xa6
Rc5xd4
Bd6g8
Re3xg5
Q2h4
Rf4f2
Rd4b8
Bdb1
Ng7xg1
Nb1g4
Rc2xe1
Qb6h8
Nh7xc1
Nc8xh7
Bd1b8
Ne4xg6
Rd1e1
Nc1c8
Bfc1
Na8xg6
Qf2c8
B8xb4
Be1g2
Qf3xb3
Be6c5
Re4a4
Rg3xb7
Rb2xd2
Ng6f5
N4f5
Qf3xh8
Bf2h5
B5xf6
Bh4xe8
Bg3xb3
Ne4xf1
Qc3xa1
Rb4d3
Nexf7
Bgxf6
Ra7xf5
Rd7xf3
Nc4xa6
Nf6g6
Rb3b4
Nc4d1
Qe7xf6
Bh2xg4
Nhxf7
Ne8xg3
Nf1a2
Rh4e2
Qd6xg5
Rc6xa7
Rf5e2
Bf4xg7
Qe1xe3
Qh8xh3
Qfxf2
Qe1h1
Bb8a5
a1=Q
Nfxd5
Bb1xg8
Re5xa5
Nf4xh6
Bcxg5
Qe4xc6
Qb1d2
Qa5xf1
Bg3g6
Ba5xc1
Rf4xe2
Ba2
Bh7xb2
Na5xa8
Re3xf1
B8a8
Bh7xc5
Rg3xh5
Rf1xe7
Ra4f2
Bf4xe4
Nc1f2
Bd3xf2
Nd4f2
Bg4d7
Ne3xh8
Bf2xd2
Nc8d8
Rg1h7
Qd5xf7
Qexg8
Rf7a7
Nh1f4
Nf7b4
Be3d4
Bb1xf5
Nh7a3
Ne5xb7
Na2e8
Qe8xa7
Nd5xd1
N3xh4
Ba3g5
Ng5xe2
Bb6xh2
Nf7h3
Rh8h5
B1d6
Ba2c1
Qd8g6
Rh2e2
Rf6h7
Qc4e4
Qbd6
Ba2xc4
Bg6f7
Ne3g2
Re7h4
Rc3h4
Be4xb4
N7b4
Baxg5
Qh3e4
Bg5xh6
Qf8a2
Bf5f2
N8g5
Nf2xf8
N7f7
Ne6xa7
Nc1xh3
Na2h3
Rd8xb5
Na4d2
Ne3xc3
Qa6e3
Be3h1
Rcxd7
Ncxh4
Rfb2
Nc7b5
Nd5f8
Qf2a6
N3xg4
Na1xd2
Rd1xg5
Be1e6
Ngxb1
Qdh6
Bh4h7
Rb8xh8
Ng7xg2
Be6h1
Bfxd8
Nc1c1
Ne7xa8
Bcxh3
Qa8a6
Bd7xf3
Nhxb4
Bg4xg6
Rxd6
Nc2xa8
Bf1xh3
Bg4xb7
Qcb8
B6xf3
Q2xf5
Ra1xg1
Nb4h8
Nc7xf8
B3xd8
Qxe2
Ra3xb4
Qh6xe2
Rf1xb3
Bf3xe3
Q3xd3
Raa7
N5xg2
Ra4xg8
B5g6
Rhb1
N6xa6
Rf1xd6
Nf5b7
Nf5xf3
Ncxd7
Qf2xe3
Bdxb3
Ng4a1
R6xg3
Na6xe8
Nh5xa2
Bg4xc1
Re7d8
Qg7xb1
Q1xf3
Qh7h6
Nf7a1
Qg2c2
Nd2e6
Bh3d8
Qb5xf1
Qh6f1
Qa4a8
Bf1c8
Bc5h4
Nc1xf1
B1xa8
Qd7a5
Rh7xe2
Ba3xc3
B1c2
Qe7xe7
Re6b1
Rg5d6
Ba2f6
Qh8d7
Qa1b3
Rf8xh8
Rg6xh5
Qb3e4
Rh3xh8
Ba2xb3
Qdxh2
Rg5xe4
Ra2c4
Na8xe1
Qg2e4
Qa4xa1
Qd5xg7
Qe4b8
Ra7f5
Ba1xh8
Nh5g4
Nb6xg4
Qf7f5
Ng1g2
Nd7a3
Nd3c5
Rf5xh5
Nh3xb8
Qg8g8
Na2f5
Qc1xa1
Rb3a5
Bd3xf4
Bc2f6
Ndxa1
R1xh7
Qb4d1
Rd3f3
Qf6b3
Qc6b7
Nh7xg4
Qe7xg6
R8xc3
Ra6h3
Baxa8
B8e6
N8b8
Rf2c3
N7e1
Ne4xf5
Qb5xc8
B6xa7
Bh4e5
Re2g7
Rd3xe4
Ne7e5
Nd7f2
Bg1h7
Ra6c8
Nc2e7
Bh7g4
Qa3f2
Bh5g7
Qe7xb4
Rb4xe5
Rc6b2
Qh5xf7
Rc7xa6
Qg7xf7
Rexa2
Qh5a8
Be2b3
Qe7xb5
Bhxh8
Qg2b4
a6
Qb4xf5
Qhxf8
Ndc8
Bf8xe6
Ng5b7
Rea4
Qh7xd7
Qa4xe4
Qe4xc5
Bh2h7
Re7xh4
Rc1
Nf5h8
Ng4d2
B1b5
Qd7b1
Bh2xg2
Qa7g7
Nh6d8
Nda4
Bd2h8
Qe2c5
N3g2
Qb4f8
Qg5xf5
Na2d1
Qb4xh2
Qe6xc3
Qaxc3
Rb2xd1
Ng7xb6
Ne4xc2
Ba1xh3
Rc7xg4
Q1xe1
Rb5g2
Rg2f1
Nb3xd2
Nh6xh3
Qb8xc1
Ng5c2
Qa2xc8
Qd6h5
Qg5d3
Nh4d3
Q6b7
Qc6b4
Re7f5
Bhxe5
Nc6
Ne5f4
Rd3xf5
Nh7xc7
Nh6a7
Q2e6
Rh2d4
Q7b8
Qf5c1
Rf5xe8
Bc5xg3
Rh5b6
Rg4f1
B5h8
Qg7xc6
Qa3xh4
Be3xh2
Qfd1
Bh2c2
Qf2xg6
Bf2g5
Qc8a4
Bc4xc6
Nh8xg5
Nb7a6
Nc5h4
Rd8xb8
Bd4xd1
Be2xh1
Qab1
Ng4d7
Na3c5
Bg3c8
Na3xb1
Bh8d2
Bexb3
Bg3xb4
Be2d1
Ne8b3
Nb6h5
Re6d7
Ne4xc3
Qb6h6
Rd4h4
Rd5e7
Qg4xf4
Qg4xb2
Rg3d7
Rg6c1
Rb8b7
Bh2a6
Raxh1
Rf8xe5
Rfa1
Ba4h4
Qh5e4
Qf1xc8
Rb5c1
Bab5
Re6xe2
Nh1d7
Nh7xg6
Qf5a6
Nb3e1
Nd7h7
Bb4g7
Na7h3
Q6c4
Nb6f5
Nh6xd7
Qd7xb8
Nb3g4
Naa1
Qh5b4
Ba6c4
Nc2xe6
Rh6xe4
Nd6xe8
Rh2a2
Bc4xa2
Nc8xh5
Bb1e6
Bh1h8
Bc5xb1
Nb1xh2
Bb1h7
Bb2c2
Bec1
Nc2xe7
Ng2e2
Be2d4
B2xf4
Ng6e5
R7xf6
Qf5xf1
Qd7c8
Rb5xa2
Qhxg6
Be6c6
Qd8xe7
b6
Qh3g2
Rb6d7
Qa4h6
Nd7xd2
Qd8xc6
Nc1h6
Q6xb3
Bg4xd1
Nd6xg1
Rd3c2
Rcxc1
Nxg8
Re8b4
Bb4c2
Bb6a8
Nc6d3
Nbb2
Bh1a8
Re6xb3
Q7f4
Nh8xf2
Ne7e4
Re5g4
Qc6h4
Nh7xe4
Nf5xf4
Bd5a5
Nd1b6
Bc6f8
Rg4xb3
Nb8xd1
Qxf5
N2xf3
Qh3xe3
Re7a5
Qg7xf2
Nc8g5
Bc2xf1
Rc4h5
Rf3a2
Bf2f5
R2xb7
Rh3a6
Raxd7
N7xf2
Qd4c7
Qh6xa5
Qf7a1
Be6a2
Na5d4
fxg4
Nf7f8
Bh3c5
Qd3d2
Bbxc1
Rbe1
Rf3f2
Bd2xh1
Rh6xe1
Bah1
Nhxh1
Ne1f8
Ra6a1
Qe6g5
Qa4e1
Qc1xf1
R4g7
Nd1xf1
Qexf3
R6e8
Be5xd2
Qd4xb8
Nb7xc5
Ra8xg5
Bg6c4
Bg2xg6
Qc3xe3
Nc4xf3
Qd5c5
Qexg2
Rf6xa6
Qc5a4
Nd4d2
Qe8xb4
N6b3
Bc7xb7
Rhb3
Q5xc5
Qbxa4
Qdxc6
Bb4e7
Nd1xa4
Rgxg3
Rhd5
Nb4xa6
Na8xe3
Nf6d8
Nb2xd1
Rg7xf7
Bf8xa6
Qb3g1
Bh8b1
Nh4h7
Bdc1
Qe2e8
Na1d2
Nd7xg4
exd2
Bf6xd3
Bg7c3
Qe8g3
B6e8
Qf5e2
Nb5a4
Qf8h7
Qb5e8
Qc1a6
Bb4xg1
Ra8c7
Qc7d1
Qe5d7
Bb3xf5
Rgxa4
Rb7b1
Rc3xg5
Nh2xb5
Qc1f1
Rc6xh7
Nc3g5
N7xd2
Qe7xh1
Qd1g8
Nf5e3
Nf8xe1
Bc2xb4
Re8d5
Bd3e7
Ra3h8
Nh1xh1
Bf4xg1
Rb3xb6
Rg6xb1
Qd6xc5
Bf6h7
Nc6e8
Qb4xd7
Nf6e3
Nb1h1
Qc4h1
Bg1xd1
Q7d6
Qc3g8
Rc7g7
Qf8d1
Rg2xc8
Bg3xa6
Bc8d5
Qe5xe2
Qh6c6
Rc5d2
Qd1f8
Qh3xf6
Rb1b3
Rf1xf7
Rh7c6
Bg7c2
Qb4xf6
Nb4h7
Qa3e4
Rcxf5
Bb8h8
Be1xe8
Qf2xb2
Nc6xd8
Qf1a7
Rb5b5
Qg3xa8
Qg1c4
Bc5g3
Qf5xh2
Rd7xe8
Rd7c7
Rf4h6
b5
Re2xd6
B8g3
Bg8xf4
Qg6a8
Nf5c1
B2h6
Q7g4
Rbxg2
B3f1
Qe8xd5
Bb2a6
Bh8xc7
Qb5c5
Rc2xe2
R4xb4
Ba6xf7
Ba4d4
Qhxd8
Rc5xb6
Rc7xg2
Ng6c5
Ba5xe8
N3xa1
Qb2xb5
Bb5f2
Rc3h7
Be2c4
Qb8xd7
Qf1e3
Rg8h1
Q3xf2
Naxe6
Qf4e6
Qd7b6
Ne2xd3
Q2xh7
Qd2a4
Qe7a5
Re4b7
Qf5a8
Q3xb7
Nc5xc3
Bc8a5
Rb1xc2
Qe5xf2
Rd7xh2
Bh4g4
Ra8xc5
Bd7e7
Na5a4
Bg8xg8
Rd6xh7
Ra7xg8
Ng3xa4
Bb4h5
Bf6c2
Bg6xh8
Rd3a5
Nf5b8
Bh8xg5
Qgf1
Nd6e5
Raxe2
Baxe6
Be4xe4
Bc7xg6
Bdxf2
Rd2xb8
Na2a8
Nf2xf5
Qah3
Qa3c7
Rd7xe5
Nf2xb4
Rb4xb1
Qd3f1
Na2f4
B1xg3
Nb7d3
Ndd1
Qh8xa4
Qf2b7
Qd8f2
Rg3a7
B7b5
Q3c1
Rd3f8
R4d3
Nc4xa8
Nc8a3
Ba2xe5
Bf1xd3
Bb8xd5
Ne6g1
Naxh6
Qb7xe8
Nb4xe4
Rb4g2
Qeb4
Na3c6
Ba2xc1
Nh3d2
Ra3xf2
Qb6xc6
Qfc8
Rd8xh3
Ra6xc1
Rg4xf2
B5g1
Nah2
Nf6xd1
Qf5xc2
Qh2a3
Rb6g4
exf6
Qa1h1
Rf1a4
Ng2xb4
Nc2b7
Rb2d1
Bexe7
Na7xh6
Bc5c8
Naxh2
Bf6h8
Rh2xh6
Bf4g7
Na2xg7
Rf8xh3
Nf5xg3
B4a6
B2xd3
Rdxg6
Bc8a1
Qc7xb8
Bhh4
Qh4a6
Na6e4
B2h2
Re8f3
Nd6xh7
Rbg4
Rc1xg7
Bf5xh7
Bg7xb3
Qd6b7
Bh7h2
Bb7xg3
Bd1xh4
B2xb4
Rh4xf3
Ng1c1
Rcxd5
Ra2xh4
Qf5c2
Nd3f7
Rc7g3
Qbb1
Qc3a6
Qf8xb5
Rb1xa2
Bc7xf3
Re4xh5
Bc5xh1
Rbxg8
Rg6f8
Rb1g1
Be5h4
Qc5a7
Kg3
Rg7xg2
Bh4xb2
Qh6a5
R5e1
Rb7xe7
Qf4xc7
N1xg3
Nf4e1
Nd6a1
Qa5xf8
Bb2g1
Qe5h8
Ne3b5
Rh4h7
Qg7xb8
Nd4g4
Qa3xe3
Qe1xd6
Re7d1
Bc2b8
Qgxd6
N1xc4
R8g6
Nh1xb4
Rh3e7
Qg7c8
Rg4xh8
Rd4d1
Ne7b1
B2f1
Ra3xe5
N1b4
Bb2f3
Qd4c5
Ng2xb7
Qb2xe4
Bd4xg2
Nd7xg5
Bd5f7
Rhc2
Ra3xd3
Nd4g6
Qh3xd2
Qc5d3
Kb5
Bga1
Na5xc1
N5xc6
Nxh5
Nf6
Qg7f6
Nhg2
Ng1xh7
Q5d2
Qb3c3
N3xf7
Be7d2
Qb5xa8
Rg4b5
B5xc8
Rfxe6
B1e6
Ng7d6
Rg7h8
Ba7xe2
Qb1b3
Bh2b8
Be6f8
Bh5xb8
Rf8xa5
Ra7g2
Be7a3
Re8g1
Nf4xh2
Qg3xe4
Bc3xa1
Ba4e8
Rf3d3
Nf7g4
Qf7e8
Qexb1
Ra3h6
Rf7d4
Qd6e8
Ra2c2
Qe4xa5
Bh4c8
Ba7xa8
Bf2c5
Qg4xf6
Q8xc4
Re6xd6
Rg7b6
B2xe4
Rc7g5
Qa5xf3
Bcxc8
Be1xe3
Bc7b8
Ra1h4
Qc1h6
Re1c6
Rd1a1
Q5d8
Qb1xh4
Ra8xc2
Nf8xg7
Bg7d6
Nf2xe4
R3d4
B8h5
Qb3f4
Bg3xe7
Ng1xf2
Rc6f8
Nf5xd5
Nb8d8
Be4g2
Rb1xa6
Bd2xg2
Bd7f2
Nd5d8
Qb7
Rc8xg7
Rxe1
Bf1c3
Nc5d7
Bd7xe4
Bf2e5
Rc1h1
Re4xf8
Nba1
Qb3d6
Bgxd7
Ra2xc1
Qd1xb7
Rd5h6
Qa1a1
Qc7e8
R1e7
Rc8xd4
Rgc5
Rd7xf8
Qe4c1
Re4xa4
Qad6
Bh3xa8
Qc3xe2
Bb1b6
Re7xa4
Qf4xh6
Rb5e8
Rc6xg6
Ba4d2
dx1=Q
Qaxc6
Rb6d4
Rb7h2
Qaxe7
Be3xg5
Ng3c4
Qg4xe8
Bg8xc5
Qd5xg5
Rg6xd7
Nd4xd8
Qd8a2
Qh6xd2
Naxb1
Q4xa2
Bf4xa5
Be2g3
Be2xh2
Nd4d7
Rh8b3
Rg7d6
Qb8xh6
Nec6
Bf2xd8
Qc6xc7
Rb6b6
Nb2xe2
B8d2
Bb6xc6
Qg1xc1
Nf8xe7
N2xe6
B4f7
Rg2xe6
Nb7h6
Nf7xf4
Rc6g3
Be3xb5
Qh8g6
Nd4xb4
Bf6e8
Qh8d1
Bd5xd2
Na5e1
N1xe7
Be5xa6
Bf3c2
Ba1d4
Rh6xg1
Bexc6
Qf1b2
Bg4d5
Rg2g5
Na3xc3
Ne5xc2
Qc6g8
Rb6g2
Ndxc7
Qcd8
Nc3xf5
Nc3xd4
Ba6h1
Rf1xc7
Bh6e6
Q3xe2
Qd4xb7
Qg6f1
R5g5
Re2xd3
Bd5xc1
Nb5c5
Bf6xe5
Nd2g6
Nh4xe8
Qe3xa6
Nd2b1
Qc8d2
Nfe4
Rdd2
Rh4xb5
Rf2xa7
Q4xd4
Nc2xh7
Qg4xe3
B3xa3
Nh7f8
R1xb6
Bb6xc5
Rf6xb3
c4
Bg1xf8
Re4xf7
Rf3g2
Bg7b3
Q3h1
Naxh3
Q2e7
Nd1g1
Ba7e6
Qd2xe1
B7xf5
Nh1g5
Rf3xb6
Qg7d6
Bb3e3
Q1e2
Nc1b5
Nb6f2
Ra1c5
Qh3b8
Ne3a2
Bf5c8
Bg2xe6
N6f4
Be5xb7
Qh1f3
B3e5
N8xa7
Qe4xb8
Nf8a2
R7a3
Bf1xb6
Qd1xb4
Re8xb8
B5g2
Qc6a2
Na2xg1
Rg6xd1
Ra6xc5
Bfxg7
Nd8xa1
R6xb2
Be2g5
Qh5xe2
Qhg8
Bb5e4
Rf7f8
N5g6
Baxf3
Ne5xg2
Rd2f3
Qh1e5
Rb4e1
R8xg2
Re1xg2
Rc1h3
Bhg6
Bb3xa7
Nh2h8
Ng7xb7
Rc1c8
Ngxd1
Rh1xa2
Qd6xe8
Qd4e5
Re1c4
Rf6f3
Rd2f5
Ne4h1
Qh7xd4
Qbxa3
B6f4
Qh1xf1
Re5xd7
d1=R
Bh5a1
Q7xf2
Ng4c2
Rb4xe2
Nc8xd1
Nda1
Nf5xd4
Rg5xc7
Nh3xe7
Nc6xh4
Nh1a2
Nb3xe3
Nf4xh8
Qf5d2
Bf4xd1
Nc5b1
Bb7xf7
Ba4c7
Qa2xd6
Ra8xg7
Rb1f6
Qf5b4
Qe3xc1
Bb1xd5
Bd1f5
Bc8a2
Qea7
Be4h7
R2xg5
Bg2xb4
Q2f6
Rd8xg2
Qh4xf2
Rf4h4
Qgb8
Qa5c4
B6xc5
Bf3xf7
Nb8xa1
Bb6xb8
Rd6xa6
Qh2xd3
Nb1h2
Bh1xg4
Rh3xd1
Qf8xe2
Bg6xe4
Qh6xg1
Ne2xf6
Qf4xa8
Be6xa7
Bc5e1
Ngxg7
B8xh4
N6c1
Qc3f3
Rg2xb7
R6xa6
Bd8b8
Ra4e7
Bc7xb8
Nd5b1
Re7xe8
Rc7d5
Ne1c7
Qfxc6
Naxa7
Re5b7
Rf2xh3
Qbxb3
Nb7xd8
Qc6xg4
Qg1
Na1f2
Nd5h4
Rb5c3
Nb7e7
Rhe5
Rg6h4
Rhxa4
Nf2a3
Qc6xc8
Re6f1
Qb1e6
Ba1f1
Qd6xg7
Bg6xe3
Ba7xb5
Nb4e2
Re4c8
Qh3g3
Ra2b7
Qaxg8
Rb3g8
Bf2xb5
N5xg8
Nd4xg1
Bf5d2
Bfe6
Ra3e5
Rc4b1
Rb2e2
Nd3xb5
Qg6xa3
Bda5
Qa8xb8
Re4xb6
Q5h7
Bg3d3
Nh3xh1
Nc5f3
Rc2xb6
Ra2d3
Rc1xh6
Qg7xa8
Nf4h7
Bc3xf2
Qb3c6
Bh3xd4
N6xg3
Nf7c7
Qa5xa8
Ba8xb2
B5xg8
Qg4d8
Bc7xb4
Rc5a3
Bgxb5
Bb2d2
Ng7c2
R7h5
R4xf7
Ne3e7
Bc5d2
Bb1xe7
Qb7g7
Qg8b2
Qgf7
Bf1xe7
Qhxb2
Nee3
Qcxe7
Bb2g5
Rd5c3
Qeb8
Na3e5
Re6xe8
Qh3xa8
Nf6a7
Ng4xb5
Rh1e7
Qa8a8
Qh2xg3
Nd3h8
Nh6b6
Rd3xh4
Bh1xd8
Rd3xa3
Rgh7
Re3xh6
Nf7h8
Bc5xg6
N1f7
Rdf7
Qc1xd2
Qc6xf6
Qb1d4
Ra7d6
Rb8xe1
Qf2
Nd2h6
Bb4xa7
Nd6a5
Qe1xc7
Na2xh6
Qe7d5
Be4a6
Nf4c8
Bh7xb4
Qd7f1
R6a4
Nc1g3
Qb6xa4
Nd8d7
Qd2a1
Ne1b8
Ng3c8
Ng1xg4
Bc8c7
Qef6
Bd6xd4
Ba1xc3
Qb1xe6
Bg3xh6
Rd5d6
Qb3xd5
Qd4xa5
Bg5xa3
Ne1g1
Qe2xh1
R6xf6
Bc8xa2
Qd6xh2
Qb8a7
Nb1b1
Qd2xb7
Rh8xf7
Bb6xf4
Bb2xf7
Bc3xe1
Kg6
Qa2c8
Qh7d7
Nfa4
Rfa7
Bf8e7
Bb7g5
Qf5h5
Qc6a7
Ng3xe2
Qh7xb6
Rg3xd2
Na4a8
Ba6e7
Nf7f3
R2xd1
B1e4
Ba2xc3
Qg4xg4
N7xg3
Bh5xf5
Rc7xc3
Qc4xe5
Q6c8
axb2
Ng3xd7
Be5b8
Nd5b5
B5xc2
Rg2h5
Ne7xd1
Bc1g1
Naa2
Rc7xb3
Rh8f2
Bg4xg5
Qc7e2
Bf2xe8
Nb4b1
Q2xc8
Qh1b1
Na3xe8
Ne4xf7
Rf5f4
Nc5xh3
Ba8xe2
Rh4h3
Rgh5
R6xg7
Qd4xd8
Bb2g3
Nc7xe1
Qa4xg3
Qa7xh5
Nh8xh5
Nd3g1
Nf6a2
Ne7e1
Qg7g3
Bf4a7
Nhe3
Qe3xe7
Qe3a5
Be8xd8
Rb8xd4
Qxf6
Qc3e5
Ra6g3
Ng4xd6
Bh3a7
Qd6f4
Qd5xe3
Qe5f6
Na6h4
Rf1d6
Rb6xh6
N6xa4
Re3h2
Re3xc5
Rde5
Rg5xe8
Rd1b8
Qg5xd8
Q3d3
Qbe1
Rf6g3
Bb8xe1
Bh5xd3
Bb7xc3
Rhxa5
Na7xc1
Ba1h6
Qb6xf3
Qe5b8
R4xh1
Rb3b2
Bg4xc2
Nfxc7
Bg5xf6
Qga3
B8xd1
Bf8xd3
Rd6d1
Bd8d4
Rg5xa8
Ne5e2
Re6b4
Qd8h2
Rh4xc5
Bf5g8
Bhe4
Qf2f4
B4xe5
Rgf3
Rc2xe7
N5h7
Qa2xg2
Re3f6
Qg2b2
Ng1xd7
Nd6xc3
Bbxd4
Rd2g6
Rb6xd2
Qfxc2
Qc3h7
Nc5xc2
Bb6xc2
Qxa7
Qb1h5
Rxe3
Qh4xd6
Rb1xb6
Nf6xf2
Rf3b6
Qg5xh7
Q4c8
Bh1xd2
B2xh3
N2h2
Ra2xf8
Ba7xd1
Na5xc5
Qb3xf3
Qh5f5
Rg4b4
Qh6d7
Bb1g8
Rd3xa2
Q3b1
Nc4xc1
Qe1b6
Na7d5
Na3xa8
Rb3xa2
Q7b3
Qf1h2
Ng5d6
Qb1b5
Ng6xh6
Bf4g6
Ra8c5
Bg1xa3
Bh3b5
Re2xd2
Rcd2
Nd2a8
Ba5c7
Rh3xe7
Rc3xb8
Ne4xe4
Q5xc8
Ne5h5
Qb7d6
Rb3d7
B1b8
Ref1
Qb5xh7
Bh7g2
Rb8d4
Rd1xb2
Bcxf5
Ra3xe4
Bc1d4
B4xe6
Qd3e6
R2c5
Rh8xg4
Qg3xf3
Rg3c1
Qb1xa7
Qc3xe1
Na7xe4
Rd4xd3
Bg3xf7
Nexc6
Bg6b4
Rg4xc3
Nexh3
Ndxf1
Bd6b1
Nh6xb7
Rf8b3
N7xc5
Re2f5
Bb3xd1
Rg6xb2
Nb2e7
Nd4xb8
Nd5xc2
N7xh1
Qa8xf8
Rh2
Rbxd5
Nh5e4
Rfd4
R6xh8
Ra1xc2
Qc6xg7
Ne7d2
Qdxb6
Nd3xh1
Bg3xf5
Bg6xc5
Re3f3
Re2xh7
Qa6f1
Rh3xf2
Be6xf6
Nf4a4
N7xb2
Rg7c3
Bb3a2
Ng1h6
Bb5xa4
N6b7
Nhxf4
Bb4xc4
Bgxe6
Qa8xd8
Na2xa7
Ra7xb7
Bc3xc8
Ne1c3
Qaxg4
Rb3xh5
Qc7xd4
Bcd6
Qg3g1
Qh1c5
Rhd2
Nf5a8
Qb4b6
Ra8xg3
Nb3e2
Ba4xh4
Rea5
Bc5xh3
Rb1xc4
Nh4xa8
Qc1xa2
Bb2f8
Re5xc6
Bd2xb7
Bd4g3
Nd6c2
Bg8d8
Rf4xd1
Nd6b7
Nce2
Rxc3
Ne4xe8
Bd5xc6
Qd1xd5
Rd8xe5
Rc2xd3
Qe3c1
Rb5g6
Ng1xh5
Rh4xb8
Nb5xc4
Nf2e2
Qe5xf3
Bc3b1
Ra2b6
Nf2g8
Ra4c2
Na4f2
Bh1xd1
Bg5xe8
Ra3xg7
Nf2g5
Rg3a2
Bd1h6
Qc4b6
R7xb8
Rb2
Qc6f4
Qb7xd5
N1xh5
Bdxd1
Qf5xe5
N2g7
N4xb6
Rh5xc7
Qc7h6
Rc6xf8
Ra8h6
Nc8xa6
Rb3xc6
Rc3f3
Qe8g4
Rd8a1
Bh6xf4
Qg7xc7
Nc5g3
Nh4a5
N1f1
Ncf2
Bc2f2
Rg3g4
Nf3d2
Bha1
Nff6
Q8xf3
Nea4
Bd4xf1
Rb4xb3
Qf6xh7
B6xa1
Rf6e3
Na7xb3
Qa2b6
Nc2a4
Qa1xb4
B6a8
Rg1xb8
Ne4a1
Bg6g7
R6xd1
Ba6f2
Rf8xf1
Bg7xf3
Rb2xe8
Qa2c1
Ndxh1
Rc4xa1
Nb3f2
Ne5xd3
Bc1xg3
Bg8xa1
Ba6h6
Re7xf1
Qc8xe7
N7b8
Na6xc3
Qd5xc2
Nd8g3
Bf3xa8
Qhxd2
Nb2xd3
Bg6b5
Rh5e7
Ne1xh3
Rh8h3
Nd7a1
Qh2xb3
Ra3xb2
Bb1h3
Ref5
Qe4f5
Nh8xf6
Q4f1
Qb1xe4
Qa3h6
Qg3xg7
Qd3xh2
R5h4
Be2xb8
Rg1xg3
Re1a8
Re5xc1
Ba5xc3
Na7xb6
Bh7g8
Bh1a2
Rg1e8
Ng5e5
R4e7
Qg1d6
Qd1xd6
Na2xb2
Nbxd7
Qh5h2
Ba6xa3
Bc2xd5
Rh3xh3
Rb4xg8
Rb8xb5
Bd3xg6
Qd3xg1
Rgxg1
Nb6xa6
Ne8xd6
Ne6xd6
Qa4xh3
Ne7g8
Nf5c5
Qh6e8
Bc3xg5
Na4xg7
Qb1g2
Q7d8
Ng7f8
B6f1
Q3xc8
Ba7g5
Rd8xc5
Qa1xh6
Q1h1
Rc8xe2
Qd8g2
Rh5xc1
Qc1xb5
B3f6
Nb3a8
Qd2f5
Bb2c4
Na1c3
Q1g5
Bd7xa8
Nd8d4
Qa8c8
Bh7xb8
Rhxh7
Qb8xe4
Rdxd7
Nf2xe8
Qc7xa4
Qe6xh7
Bhxg4
Qxh5
Qg7a6
Bb1xe1
Qg6f7
Bf7xh3
Q1b2
Be8h6
Qdxe3
Rd6xd5
Rch6
Rh8xa3
Rb3xg8
Rc3
N2d1
Be2xa5
Qc8g2
Qd7xh4
Nd1f4
Rd7xe1
B3f4
Rh8xa7
Bf3xe7
Nd8xe8
Bab7
Qb4h5
Bg5c5
Bxh5
Qc4f3
Qh2e1
B2xb2
Re6xd5
Rha5
Bg1f2
Nd8xc4
Nh4xd5
Qd1xb3
N1h7
Qc5g7
Rc8c7
Rh5xc6
Na2xf8
Re8b1
Be2xa8
Bd1c4
Nh1h5
Qg6h7
Bd5a8
Bc4xa1
Be8a3
Nh8xd8
R3e7
Nb2xd4
Rc6d4
Bcxa4
Na2b6
Qgxc6
Rg8b7
Bf6xe3
Nh4xc4
Rdxg7
Qe2e5
Rf6a8
Nh5e8
Qgg6
Nbxc6
Rh6xd4
Be2a1
Bc4xh3
Ra2f5
Bgxh5
Rd8f3
Re6b7
Re2xe1
Re5c5
Nh2b7
Rda8
Ra2xd7
Bf3d7
Rd4c3
Nc1xg8
Nb7xb2
Ba2e8
Ra7d8
Rh6xh2
Rh1xa4
B7xb5
dxc5
Rb3xh2
Na8f5
Qd8xh8
Rf8xd4
Qc8xe2
R7xc2
Nexb8
Re7xg8
Re5xf5
Kxh6
Nf8a8
Rh5b8
Bhb4
Rd5xh4
B5a1
Ra5xf5
Qc2h8
Nh8xe1
B1xb4
Qb5f6
Qg3xb2
Qf2h3
Rc1e6
Rg1a2
Rf5c7
Bh2e3
Rg3e5
Rfxg6
Rc3g1
Qf2xg3
Nf7b1
Nxa8
Bc7xg8
Nc4xd2
Nh3xd8
Qa5b8
R1xb8
Bf6f3
Q7a3
Qf8xa3
Nb6xd3
Qee6
Rg6xh8
Kxd2
N3xf2
Ng5f3
Bd7d3
Nba6
Nh2h3
Ng5xf7
Qh5xb8
Nh2a2
Nf5xh2
Qb5g6
Qe4xb3
Bh5xd4
B4xf5
Bd7xd6
Na5xa4
Qc6xe7
R3c1
Ra5xf7
Rf3e7
Nh4xf4
Rf3xb7
Nf3a7
N8c3
Qcg5
Bd2a5
Nb1d8
Rd8b1
Ra3xe6
Nf4xe2
Rf2xc4
Naxg8
Bc6xa8
Re7c4
Bg5h6
Qb7xb2
Qc4g1
R6xg4
Ndxa7
Bf6xd7
Bd4c8
Nc8b1
Re1xe8
Qe4xg8
Na7xa1
Qg8xb8
Qg6h3
Be8xc1
Nf7e7
Rc3e1
Rc6a1
Qbc7
Re6xf2
N1e3
Bc8h1
Rb8h4
Re7xd7
R2f1
N7xb6
Bb2xd5
Rf5xg2
Bd5h8
B2g4
Qf5xf2
Be7xe7
Rcxh2
Ngh6
Rb2b4
Ba1xc6
Qf5xg1
Qg6d4
Ng8xd5
Nb5c8
Rf5xh3
Na4e1
Nd2g3
Ng4xe1
Rg2xe7
Re1h8
Q4xg1
Qf7a5
Qg1xh7
Ng3xc2
R1xf2
Qg7b2
Qa2e4
Bh1xh8
Qh3b6
Bg7xa4
Ndxg3
Nh2xf8
Qc4xe3
Rf8xf6
Ba7xd2
Nb6g7
Bb3xb1
Nb8xg3
Qa8h3
Rd7d6
Be4h4
Nf1d6
Qf3xg2
Qf5xe8
Nd7xb3
Nf7xh3
Rh8g1
Na1f5
Bh2xb3
Rc2a1
Bd2xg5
Ba3xe7
Ndf3
Nb5e3
Nh1f2
R7a8
Nh3f3
Rb2a5
R8xg8
Bg5a6
B5h4
Bh5xd2
Nc8c8
Na2xd7
Bd6e1
Rg7xa6
Qc6e7
Bh3xd8
Nb8xb5
R5h7
Qb8xc4
Ng5xe6
Qh6f8
Bf8e8
R8c7
Qd5xc1
R4xb1
Rg3a4
Bb2xe4
R1xd6
Rb5xe1
Rd8xc8
Qd8xf8
Bb7
Rc8b3
Nb2a4
Qe5
Rb1xf8
Qa6d6
Bc3h5
B6xc2
Qh1xb1
Rf6xe7
Qb1xh3
R7c3
Ng6a4
Bd2e3
Nf4f4
Bexe5
B3xc8
Bd1xg2
Rg5xf6
Rf4d8
Ng2xd1
Qc4xa5
Rd7g5
Qd8xc8
Rgxc4
Bdxd2
Na7xd8
Rg4xb4
Rg1xf3
Ng8xb8
Qcxa7
Qhb3
Nhc4
Na1a3
Rh1b4
Bh6g5
Qg7h4
N7xg1
Nf8h5
Rd1xa7
Ba3xb8
Q7c4
Re1xf1
Rh4b6
Qc4a8
Nb8c5
Qh2xf3
Bb2a2
Ng5b1
Bfb1
B5xh4
Nf1xc2
Bc4xh2
Bd6c6
Bb7h6
Qf4c7
Qh6xh3
Na6e7
Bc4h7
R5xd5
Ng2xg1
Qhxb1
Qc6xb8
Rfh1
Bc2b5
B5g4
Rb8xb3
N2xh8
Qe1xa4
Rg4e3
Nxh3
Qe4e4
B1xh2
Qd5d8
Qf1c3
Nd8g7
Rf7e2
Rd8xg8
Rh6xa5
Q7h5
Bh1a4
Bc2c3
Bfxf4
Qd5xe6
Qa4a2
Rf5f1
Qh2b5
Bh1h6
Qf2f6
Nf8xd7
Nc2xc5
Ra1c4
Ne1xe7
Nh2xe1
Baxa6
Qd1b2
Bh5f3
Bgxf4
Bb5g5
Rb7b8
Bg3xb1
Bf6b1
R1e6
Ra1f1
Rg3c3
Bd1xc4
Nh5a8
Qc2g6
Qg4xe6
Ne5xe5
Nbd8
Bf3a2
B3xc4
Qa2b8
Rf6d6
Rb6xd3
Qa2xc1
R6g7
Re2h4
Bh1xe7
Rxg6
Qd8xd5
Rb3e2
Qb2xg8
Ba8xh8
Q8xd8
Ne3xf1
Qb2h6
Qb5xe1
Bh3e7
N2h7
Ng5xg4
Qa1xe4
Bd3f8
Nhh2
Ba2xf8
Qg2xh1
Ndxb7
Rf6xf4
Nb6xc5
Nh8xa4
Rg6c3
Qh7g2
Rf7f4
cx1=N
B6xd4
Nf8c1
B8c5
Nd7h5
Rd8xf2
Qd3xf8
Bh1b5
Ra3xg2
Ba3xh3
Ba2d7
Ra1xb8
Qg6e2
Rcxg5
Qh5xg3
Q2g3
Qf4xd6
Bb2xb6
dxe3
B8b8
B5xd1
Nc5xf4
Qe7c3
N8d4
Bd3
Q5xd8
Rf5xb3
Rd8xh2
Rhc8
Qh1e4
Nf5xg2
Ba2c8
Rc2d1
Ra1a2
R6xh7
Nd4a2
Bg5xd6
Qa3g2
Qd5xh3
Bb1xb6
Nc7c1
Ba2xe4
Bb6a5
Rd1g6
Qe8b7
Qd6xb1
Rg3xh6
Rh2g8
Nb3d8
Rd2xg8
Rbxd7
Rh4xa6
Bh5h4
R2xd5
Qf3b6
Raxd3
Rh8g7
Qa4g2
Ra8xh4
Rd1d7
Qg8f8
Qb8xh8
Rg7xg5
Qh1d7
Qa3xh6
B6xb2
Nh8e7
Rh8c8
Bh1d4
Qce5
Ne8g3
Rc5g8
Bf2c1
Rbf3
Qg6xg6
Nxa5
Na5f5
B3e6
Nc2xg4
Qe2xf7
Nfxa3
Qh8c1
Qe7g3
R8f5
Ba3xh5
Qh4xa8
Bg2a8
Ng2h6
Rf3xe6
Rg7xd6
Bb2e5
Qa7xe8
Reg8
Qh4xc7
Nd6xc7
Qa3c1
Qg6xe7
Nb1c2
Rb1c2
Rd7h5
Rd1xa6
Qh7h2
Qbxd5
Bhd5
Nb3d4
Qf3xc4
R7e8
Bd5g3
Qd5h2
Rf8xb1
Be2xa1
Bb2xf6
Ra2d5
Bc6xh4
Rg7xb8
Qc1xd4
R1xb4
Qf1g6
Qh7d3
Rb8h1
Qac4
Rh4h8
Rh5a7
Nd5c8
Qe1d5
Bc7g5
R4xh6
B7xh5
Rg6e1
N6a3
Re3f5
N6d8
Qc2h2
Rc3xf7
Rc6xd8
Nf1g1
Qe3xa4
R5xh2
Na3g4
Nh6b1
Rf1g1
Bd4f7
Re3xb6
Ng2xa8
Rgh1
Bd4xh6
axb4
Bc5a4
Nh2e3
Qh1h4
Rh5xa4
Qg2g3
Qc3xf2
Nb4xc6
N1xf4
Nc1xb3
Nh8e6
Rhg1
Ng7xf1
Be6xb1
Qa4xa5
Ngxd4
Qa6xa2
N3xa6
Nhb8
B2f4
Nd1xh2
Bg7xc6
Bb2xh5
Qg2c6
Ra6xa7
Bfd5
Bd1g4
Ng7xf5
Nf7xf3
Rh8c5
Ba7d8
Qf6c4
Nae1
Q2h3
Nd7c1
Nf3d1
Rg3xc7
Bd7xh4
R5e8
Bg7b1
Rg2e4
Bh3h2
Ra7xe6
Bb5xb6
Nfxd4
N3xg5
Bf4xc2
Rb8xc4
Qg2a5
Re4f3
Na8b7
Bd5xg8
Nf7e4
Nf2xb2
Qe3xf6
Ra8a6
Rb2xd3
Ng1xa6
Q3c5
Nf6xf7
Rh7xe8
Bg2xc3
Bb7xb4
Ng5xg7
Rg3h5
Ng7xe2
Bh5e3
Nd6xf1
Re2e1
Qg3xb3
Rda3
Qd4c6
Rh5a2
Nf8b7
Qg4a1
Bhd3
R8h2
Rc3b5
Rd5b6
cxd4
Rh6xd2
Nc2xb5
g3
Q4xa8
Rd8xa5
Bfxf1
Ng5g4
Qd4xb3
B8e8
R2xe7
Ne3b6
Nc1h1
Bd1a7
Ra6g8
B5e2
Q1a1
Qe4xd1
Nb6xd8
Bab2
Ra6xf1
Nd6e7
Rg3xe6
N5h1
Qaxd3
Na1xa2
Qf6xa2
Nd8xb1
Q5xd5
Qc6c8
Nc4xb8
Qg1xg6
Qe1e4
Baa6
Na1xa7
Qf4xf3
Bb4xd7
Qf1h4
Na1b5
Rf4e4
Nd1xg2
Be7
Qdxa6
Q2xd4
Bg5xh4
Bc2a2
Qb3a3
Qe7e6
Qg4d3
Nf1xc3
Bh3h4
Nc1e4
Q3a2
Q5d4
Ra7b7
Qe2xa8
Ba5xf1
Qg7xf6
Nh4xb2
Bf4b4
axb1=B
B8h2
Qf3xd1
Bcc6
Qd8a5
Qg4xe2
Qf7xg6
Ba5d8
Bf8d8
Be4xh8
Nc4h2
Rb3xg4
Rf1xd7
Qd8h1
Q5d3
Bg8xg2
Nc7xe8
Ba6xh3
Qa4c7
Ncb1
Qc6xe6
R4xh4
Bcd2
Nbh5
Nf8xd6
Nf5h4
Ra2a4
Bb3e2
Bh1g8
Bh1e8
Kb2
Bb5b4
Nd8e4
Bd8xf7
Kxg6
Bh1xh7
Bg8d3
Rb6g6
Rb2xh7
Rh2xc2
Nb7d5
R1xa7
Rb6h2
Bf2xb2
cxb3
R8xd2
Ba3xg5
B5xh5
Re1xc8
Nb6e5
Qd3b3
Qdd2
N1b2
Nf8f2
Bc4e5
Rh8g3
Ra4a1
Bf8a8
Nf5f2
B3g6
Rf7xa3
Rexg3
Qe5c4
Rb2xa4
Qfxc1
Bb2xd2
Bb6xg2
Bf6xf5
Qe2xf6
Qh5a2
Bxf2
Rd1g4
Rb1xb1
Qf6xa5
Qxb4
Rg2xe8
Qa1h2
Q7g3
Ra8d8
Qb1f8
Rd1f4
Bb5d2
Bbxg1
Ra2xa8
Rc2xh8
Nd2xb3
Qd1e8
Bd4xb4
Qc6b3
B5a2
Qh7xe1
Rde8
Nd7h4
Qe7e3
Qf2xc1
Bh8xe5
Nac5
Qga8
Nh4f8
R4g1
Rf1g6
Be3e7
Bf8xe1
Qe1e5
Rf2a6
Nba4
Nc3e6
Bg7xf1
Nb6xa2
Ra7h1
Qd7e7
Bc6e8
Ncxa8
Nc7xb1
B2a1
Ba8d3
Nf7xe4
Bh1xc4
Rg1h8
Ne2b1
Q2d5
Ra7h2
B4xe1
Na1xe1
Qf4xa2
Qe8xb2
Ra3xg1
Rf2xa4
Rbxb3
Qbxh4
Re8c5
Qb5xd6
Qf3xh7
N1b8
Ne1xh5
Rb3h3
Be6xh4
N5xf7
Rce1
Qh4xa1
Rf2e4
Qc4xd2
Q5c7
Rca2
Ngh2
R4xd8
Nb3xg5
Bd4a2
B6c2
Qg1xf7
Qa2xg8
Q4c7
Nfxc2
Bg4g6
Nd8c5
Qh2c3
Rc3c2
Qb2e3
Qd3xb2
Qb3d1
Bb8f1
Re5xf7
Qg6xb4
Qe2xc5
Nh4e3
Bd7c8
Ra1c7
Qe1d6
Bd5b1
Bf4b3
Qc8h5
Qc6c7
Neg2
Q4xh8
N8g1
Nf1xd3
Q2h2
B8xe6
Nd3xd8
Rc7xc5
Bdd8
Bc6xb1
Re2xg2
Q3g3
N7xf3
Bbxf8
Nb7xa1
B5xh1
Rd8xb7
Nb3xg4
Rg8xe8
Ne2c6
Bcxa3
Bb3h8
Na4c3
Ra3xh2
Qe7xg4
Ra7c4
Bg5g2
Rh8xh3
Bf3xc4
Bc3c7
Rb6f8
Bbxf1
Rf7e5
R4a5
Bg5g1
B8b3
Nd8c3
Bc8xb7
Qfh3
Qe7g6
Rf8b2
Qf1f8
Nb5h5
Nf1xa5
Nfe3
Qa1xb7
Rh1xc5
Be2c1
Qg2f4
Qh4f2
Ne7xb8
Bb4d3
Nc8xb8
Q1xf2
Rh3b8
Na6e8
Re1xb4
Bb3xg1
Bh3xe4
Bh8xe8
Bh6xh5
Qb2xe1
Neb8
Qf5d3
N2xg4
Rg7xb3
Rd7xe2
Bd2xd6
Qc1e6
Qf6d8
Nf7b8
Rd3xc6
Ng7g8
Nbc8
Qh4xc6
Be4xe2
Bb6xb2
Rc2a6
Be7xh4
Rbxe8
Nd4e3
Rf5c1
Rc8xc4
Rg8f5
Nb6d8
Bc2xb5
Nh4f4
Qc5xh3
Q1d6
Rbxg6
Nfc6
Ba5c1
Rh6xf3
Qe7xh2
B5f8
Qde5
Bh4xc4
Rh1xg4
Nd3f3
Qf5xa6
Bd2xe3
Qf6xb7
Rf2b5
N4c3
Qed6
B7xf7
Bb3xc8
Qb8xh2
Rhxd7
Be1xf1
Ba5xe7
Qaxe5
Qc7xd5
Nexd4
Ncxh7
Rg3d4
Ndd4
Na4xd3
Ngxc8
Nd1e5
Bd2xg1
Rf5xe5
Bb4g8
Q3xh2
Rf5g1
Rf7c5
Ba3b4
Qa2e8
Rba7
Qc7xc5
Bc5f4
Bg2xg5
Nf8xg5
Re3xf5
Qa6xa1
Q2xh4
R5xg2
Bg3e7
Ra4c3
Ng8h3
Ngb8
Qh6c5
Bd7b4
Rg5xg6
Nf8e8
Qb5e6
b1=Q
Rd3b1
Ng1xd8
Rb7g2
B7a2
Bc2g6
Nf6g4
Rg1xg1
R1xg4
Qe3xh4
Qg8a8
Na1b6
Rc4xh4
Qh3d5
Nc6e5
Bf3a8
Bb4a8
Bc8a6
Rb5c6
Rexd3
Nfa3
Nf8c3
Qc8xb2
N4xd1
Nf3xb2
Nh8xb7
Rb8xc7
Rae2
Qh2d4
Qbxf3
Rf4f7
Qe5xe1
Q2a5
Bb1xf3
Rfg4
Qe1c2
Re7b8
Bd5xh1
B5c6
Bf7xf5
Nd6d6
Raxg4
Qbe3
Qa8e8
Rg8xf8
Ba7e3
Qd7xe1
Qa2xe4
Rcxc5
B7h7
Rh6xg6
Rg2xc1
Qg7h2
Ne2xe1
Rf5b7
Bcxf4
Qa6xc1
Nh8xg3
Bb8xa2
Ra1xh8
Bg2xc7
Bh1d2
Qg4c6
Rd2xe7
Nbh6
Nh8xb3
Ba7xb1
Naxc7
Nd1xa6
Q4xf4
Rh8xe2
Ba2b6
Qa1g3
Bf1xf5
B2b4
Bg3xg3
Qb3xf2
Nb6d2
N3xd7
Qe1h3
Nh3e7
R4c6
Bg5xh5
Rexh3
Rc2xd4
Qh5xc7
Bbe6
Rh3b4
Qf3xa2
Na2xa3
Bg8f5
Nb5xa5
Nh6xe7
Nd5xh3
Rg8a7
Bf4b8
Na1e6
Bf5e4
B8g8
R2d7
Rh6xh1
Ra7e5
Qe6xb7
Ndxc8
Rc3xh3
Bh8xd5
R7xh4
B1h4
Q4xa1
Nd7a8
Bd2xh7
Bh7f1
Nh3xd2
Qd8h6
Qb8xf6
Bb6xf3
Na1xb6
Ba1f2
Rb8f5
R6c1
Na5xe5
Bh7xf2
Qa5f2
Ba7e5
Bhc6
R8f7
Bd3xa5
Nb1xc8
Ng3xh5
Nf3xf1
Re6xb7
Rf3a5
Bca8
Rg4d6
Rd1xh7
Qea1
Qd6xe1
Nh4xh6
Qaxg2
Nc1xa5
Rg8e4
Rg1b6
Nc1xd6
Qh6xf2
Qa3g5
R4xe4
Rhxh5
Qd1b4
Bb7g1
Nh5b2
Nh4b6
Nc3a4
Qg8e7
Bb5xd2
Rf7c6
Qcxh5
Rg6xe4
Nf1g3
Nf5d6
Rb8c5
Na3xd3
Bc3c6
R5d6
Qd5a6
Qf5a2
Qa8g6
Qc1b7
Rb5e2
Bg4g5
Bd8xh2
Nc7e4
Rd8h1
Rb3e1
Qe7xe4
Qf2e7
Nb5d1
Nd5d4
Qf4xc6
Nh4f2
Rc5h3
Rd4xe1
Bg1b2
Ba6f4
Qg1b5
Qf5xh8
Rb1xh4
Nb8e4
Nb2f4
Bf3a1
Qb8e4
Naxe2
Qc6d2
Bb3xh8
Be6xa8
Bd6xa4
Nb6a8
Bb8c1
Qfxg1
Re6xc6
Rd2h5
Qa4d3
R2e1
Qf8b7
Qf2xb8
Bb1xd7
Bd1xa8
Rh6h2
R1xb7
Nf3xd5
Rd3xa4
Rf5xa8
Qa5d5
Be1h5
B6xd5
Bb7xf8
Rh2a5
Qe2xf1
Nh4b3
Bc5xd1
Qe3xg1
Re1xh8
Ng7e3
B8h1
Nd3h7
Na2h6
Ngb7
Ra8xb2
Rg1xf1
Rd6d3
Nd3h5
Re4xd6
Qc5b8
Nd1g8
Nh5xa4
Ne5b6
R6xe8
B4xa8
Re1b2
Qbxh1
Qb2xb1
Qc5xh1
Ba3b3
Rc2xa5
Rc3f6
Bd8a5
Q7xg7
Ra1g1
B1xc6
R1xg1
Rh2b3
Qc7xh2
Bb3g5
Bd2g1
Qfb2
Bdxe4
Red7
Rh2c8
Nhxa7
Rd7g8
Be1xg8
Qd2b3
Qf6xb6
Bbc5
Nh4xh4
Na6xh8
Qaxf6
Be3xa3
Rb2xh5
Re4e7
Q6h7
Nd7xg8
Na2f2
Bc5xc8
Rh6f6
Rd3xe5
Rb3a1
Ba3xb7
Bb2xh1
Rg6e2
Nd1h1
Rah2
Bh4xd7
Nf1f5
R8a7
Ba1xe1
Bf5b3
Ba8xf3
Nd4e2
Qb3xc3
Qe2h8
Qba4
hxg2
R7d8
Rf5xd2
Rg8xc5
Qdd1
Qg8c4
Nc6e2
Nd2f8
Ng5xe5
Qg7xa6
Re8xc6
Qa4c3
Ndb7
Bh7e8
Rf1xg5
Bc7xe6
Bf3xa2
Ra8c3
Rf8xc3
Ngxf5
Nb5g7
Re7c6
Rf5xh2
Nb7d7
Q3e8
Rgxa2
Q1c4
Nf3h5
Ne3a4
Bd6xg2
Ra6d3
Rb8xa6
Rc5xb8
Qg5h5
Bb4e3
Nc5xe6
Bh3b6
Qh2xb1
Bd1c1
Ba7a3
Qe6xd3
Bg3g1
Nc6b8
N3a2
Qa2xd3
Qf1xg3
Kxg3
Nh8f6
Na4e8
Nf5xf5
Qh5xe4
Ng7d7
Qg3xb6
Bg3xd2
Nd4c3
Re4xc7
Qa6h3
Rd5xa2
Ba8xf1
Rb2xc5
Qe2xg6
Nd2xe4
Rc3b7
Qf4c6
Bh3xe7
Ra1xb2
Qd5xc5
Rb2g5
Re3xh1
B2g1
Bg8xh1
Re6c7
Bf7xd6
Rd5d5
Nc5h3
Qa4xa2
Bg1g4
Bg2h2
Nc4xc5
Qb4c5
Nc6xc6
Rb7xb4
Qa2d5
Nc2xf2
Rb4g8
Qaxf5
Rh4c7
Qe2xb4
Na2a4
Nhc5
N7xb8
Nd5xd3
Rf1xb7
Bc8c5
B1h3
Qb8e5
R3f1
Nd6xg5
Rb3c1
Be7c7
Bh4a6
Ne7xd2
Bdg7
Bf2xc6
Rh7e1
Rg7xc2
Rf2a7
Nf4h5
Na5xf2
N5c4
N7f4
Bd5e2
Rd2h1
Qc7d2
Baxg2
R6e7
Qc7a3
Naxh5
Ned3
Re1e4
Rd8xh1
Bc7g8
Qb3e2
Nh8f4
Be5c4
Bd6xg1
Bh1xd7
Nh7b7
Rf4xh8
Ba7xd5
Bg2h1
Ng2xd5
Q1f7
R4g2
Qh4xe3
B1h6
Nb4c4
B3e3
Ne1f1
Q8xg6
Qb4xh7
Bh4f4
Na7f8
Qb2e6
R3xg5
Rc8xg8
Na7f6
Qf8xb4
Ra8h7
Be3xe3
Ng3xh1
Nb8f6
Rc1d5
Qe1xc2
Nb3d1
B4xc7
Bb2xb4
Qa7xc7
Rg5d4
Bh8b2
Rh2b6
Qd5xd1
Re5xc8
Ba4xg8
Rf8a3
Be6xc7
N4xg6
Qfxg8
Qa3xg2
Qa2f7
Qe3g6
Rb4c7
Qe5e2
Ngf1
Rh4
Rf7b2
Be6xd2
Rf8xb7
Bbh2
Be6xc6
Bbg4
Bh8c7
Bd8xa1
Bh4b2
Rh3a1
Be3b1
Bxd6
Bd3xe8
Qh6xh2
B7xc8
Qg1xe6
Nfg1
Bh1g5
Qh2xb5
Nd8xb3
Ng8f2
Qg8xd8
Rh6xa3
Na8xf3
Qd4d5
Bf2c3
Rd6xg2
Ne4xd6
Nde2
Nc2c4
Rf7xc2
Qg1xf3
Bb4xf5
Reh1
Rd8c8
Be6xc4
Na8xe5
Rh2xf4
Q4xd7
Q8xb6
Qc7xf6
Qd5xb3
Na2xh4
Nb7xh7
Rd8xb2
Na2d8
Nd1xe6
Nf5f6
Rc1xg2
Qb3c8
Nbxe3
Qc8c7
Qc3a3
Ngxh1
Nc7xa8
Rf7xa4
Qh4xa3
Qg1xf8
Re6xg4
Nh6e5
Nh6g5
Qg5d1
Ng6xg4
Qf5xd4
Qf2f8
B5xd5
Qf5
B3xf4
Qg5xb8
Qh1xf8
Qh5h1
Ba1b4
Qd1xh7
Qa3f3
Rc2h2
Bf6b6
Qa2e3
Qf4xe1
Ba4c6
Q5g2
Qe3xc4
Ng2xc3
Ba8xh2
Bb1xf6
Bfb4
Nd7g2
Bb6xe7
Bg7xa6
Q4f4
Rd8b8
Bh1a3
Rh6xb4
Rg3xd3
B3f5
Qh4xh7
Nbd3
Bg8xe8
Rh8xd2
Rf6xc7
Ra7xf4
Qh1xc7
Ng8xb4
Qa6e5
Rc8e1
Nc8d6
Qa4a1
Q6e1
Qd2xe4
Rbxd2
Na8xe2
Be5h7
Rh5xf6
Ba4xf5
Nc7xe6
Rf2f8
Be5xd6
Bg8a4
Nh4b5
Qhb2
Be3f3
Rh6a1
Ba3c7
Rh8xh6
Rdxg3
N7h4
Nh1c3
Qc1xg3
B8g1
Nc7xa3
Qd6xb4
Rb3xg1
Ng2xc1
Rgc8
Ngxh7
Nf5d8
B1xb2
Bh2xa5
Na2a6
Qg1xa2
Qgxg3
Ne3e5
Qxd7
B7a7
Rc3c1
Nh2xe5
Rh2xb7
Ngd6
B5a6
Ba1f8
Bg7xa7
R8xa2
Qh2f2
Qh7e4
Rb1a2
Ne7xg4
Qb6h3
Re5xe5
Bg8xh6
Qf8xc4
Bd2h7
Rd6xf5
Rg1xd4
Bc6xc3
Rf7d8
Na1d4
Nf5h5
Naxe4
Ne8h1
Qf4xe2
Nf6c2
Ra7b5
Ng7e6
Ba6xc2
Nh3d1
Rh2xd3
Bc7xd6
Bf8xd4
Qb3g7
Qf3xb7
Qd1xf4
Rf8b7
Nd7d5
Qc8xf3
Ng8h4
Ndxe5
Q8c1
Nf7xe3
Nd2b2
Bgb3
Nbxf3
Bff3
Rf6b5
Rda2
Nb2xc8
Bh3f6
Ne1xe1
Rga5
Nc4d8
Nb7d6
Bc6xf5
Rd7f7
Bf2h2
Bh8g1
Ned1
Bb8d3
Bg2xa7
Nexc8
Rc2xa4
Qe7xf1
R2xh5
Nd4xa6
Qg7xh4
Bb6f5
Rc6g1
Ra5f1
Qf2xe8
Na1xh6
Qa7xd5
Bg3g8
Rd1xe8
Ba5xd1
Nd5xc5
Na7h8
Nd3c7
Qa4h2
N4g8
Bgxa3
Nc7xe3
Qfe4
Qa7xa8
Nh5xf4
Ncxf5
Q8xd6
Kxa3
N6xa3
Bh2xh2
Bb3h2
Bg7xb6
Qd5a5
Qf8xc2
Bbxh6
Qe7a3
Rg2xb4
Rc3h3
Qf7b2
Nd1xf6
Re8h4
Qf4xb7
Rf5h7
Re1a5
Bc1f2
Bf7xa5
Nh6xf7
Nf2xg2
Bh8g4
Ng8xf6
Bb3xc7
Qh6d5
Rc6xf4
Nb1a5
Nd8xg7
Rc8xh6
Na7xa4
Be5xc2
Qc8a5
Qh2xc1
Ra3b8
R2f2
Qh1xd5
Nc5xf3
Bf7h2
Bhxg7
Rf4xa1
Bf8xa2
Qe6b5
Qb7a8
Bg5f2
Bc1xd4
Nc6xc1
Q4h2
Bg8b5
Rb3f1
Ba6xe5
Qg2xd2
Bd5xh4
dxc4
R2xh8
Bf2xa7
Qg1xd5
Qc7f4
Qcxb1
Nh7xb5
Na1d1
Rd1xd2
Bah6
Qf3xh3
Qf1xc2
Rh3xe8
Qa4xb7
Ba2h6
Qf1xh2
Rh8f4
B3b7
Rb6b5
Ng8xd2
Re2xd4
Nb8xf5
Bcf4
Rc6f5
Qe2d2
Bh5c6
R8xh7
Kd4
Qf7g1
Ne3c1
Nf4xb3
Nb5xc3
Bb6c7
Na6xd5
Qg2xf1
Rfg8
Rh7c8
Rb8c7
Nf2e8
Nh4xf3
Ng5d1
Ne4xb4
R7xb2
B3xh3
Ne2xa5
Rg2g8
Rf6xc4
Bd3xd6
N1h4
Qhxg2
Rg8d8
Be2f3
Ng3f6
Q4h7
N5xd5
Qc4xb6
Bexe8
Qexg4
Ne6e1
Ba4xd4
Ng1f8
Be7xg6
Bdd6
Rg2xf6
Bd4xg5
Ngf6
Rg1a5
Ra5xa6
Nh8a8
Rb2h1
Rb6xe1
Ra7f7
Nhf5
Qb4c4
Re7xh3
Qc5d4
Bgf7
Qdxg1
Qe7xd4
Qa7xg8
Ndc6
N3h8
Qc5xb1
Rhxh4
B7xc7
Qg1xf1
Rf7xh1
Qa6xg4
Bh6d8
Bb8f2
Rh8h8
Ne1c1
Bxd3
Qf1xh4
Nb1h7
Na1f8
Bb7d4
Be4d6
Qh2xb4
Rg1h4
B7b8
Rc8c5
Nf6xd6
Re6f6
R3xe5
Rd7xg8
Bfb3
Rf4xf3
Qa1f8
Nd2xg8
Qbxc8
Qa7xf6
Rh2e6
Qa8xc1
Re1xa4
Raxf3
R1xf6
Nb6h3
Qc1xc2
Nb3xc8
N5xc2
Na6xb4
Be4f5
Ba7f1
Qh4
Rh5g4
Bcxe2
Nf1xg6
Nc8xa2
Qd2d5
Be3g5
Rc1f8
Rf6f1
Bf6a4
Qbh5
Rh4c5
Bf8xf6
Nd8xb4
B1g4
Bd1xc5
Bc1xf2
Rb8xa4
Rd6xd6
Rf8xd7
N4e2
Qd6xg1
Nfh4
Ne8b5
Raa2
Qexd5
B3h6
Rg8c7
Na4c5
Qf4xd8
Qdxh5
Nf8b4
Rf3xd7
B8xf2
Qb1e3
Be2xc8
Qb7xc5
cxb2
Rg4b6
Qe6c2
Nb3xc4
Rc5f3
Qaxf2
Rh4xa2
Qg4h5
Qd8xg7
Re2xc8
Rh8c2
Bfh7
Qf7d1
Na4xc3
Bg3xc2
Nb8xd6
Rc7h2
Bb5g8
Nb5xa6
Ra7xf7
Bb8xa3
R2h1
Qe4a5
Bg4a8
Re8g8
Qg1h1
Bc5xb3
Bf4xh8
Bg7xa3
Qa2xh3
Bg5f4
Bb7c5
Baa7
Rd3xb8
Qc4xd6
Rd2xf2
Qc5xf5
Qe4xa7
Q1b1
Rg8e8
Nh4xe3
Rc8xe6
Bfh2
Qd8a6
Re6b2
Qb7c7
Nf2xd6
Rxf7
Be5xe1
Bh5xg1
N6xc7
Qh7h1
Qd7e6
Qf7xg7
Nh5xc2
Qd8d6
Nh7e1
Nf7xc8
Bh2xc3
Rc8d8
Bb5xh3
Bd6h4
Bh1h2
Ba2h4
Nb5c6
Ne6xb7
Qg7xg7
Qd4xg7
Nd6c4
Ng8xc3
Qd2xb1
Qg8xf8
Qf1xg4
Qh2g5
Bd3xc2
Rb7xb5
Rb7xe2
Qd8xh1
Nd6d4
Rc3xb7
Rg1xb3
Qbg3
Rf6xf7
Re1xc4
Bh6xa3
Qd3d8
Rhxe2
B6xe6
Rc5b7
Nd8h1
Ng7xd2
Bf8xb2
Bf3xb3
Bh3xh1
Nc4h3
Rh7xc1
Rd2xb1
Qf8d5
Rcf6
Qh3f1
R2xf7
Nh8f7
Bdxa2
B5xh7
Qb7c2
Na5d5
Nc4xh2
Bh8e5
Bd1xb5
Nbxb3
Bh4g6
Bc8xh2
Neh5
Re8xh4
Nf5b4
Qc8xe4
Bb8b7
Nd8c8
Rb3xd4
Bc2xc4
Nf3d8
Rf5e3
Nd5xa4
Qc8f3
Ne2a7
Qb8a8
N3xh2
Na8xg1
Be2xg2
Re2xc7
Bh7xg2
Bf5h8
Re2b8
Bb8xb8
Ba3xb1
B5b2
Bd8a6
Rd6xf4
Re7xc8
Ng7b8
Q5e5
Ncxc7
Qa3xb3
Qhxc7
Bea4
Bd4xg4
R5a4
Ng4f1
Bgd1
Ng2b4
Qa1b8
Rc2c4
Qd3a7
Nb7xh5
Bc5xc4
Ra4h6
Q6xf6
Qc8c5
Qe5h4
Qh1xa6
Qd7xf3
Be2xe5
Nd5h3
Bg3e4
Ne1xc7
Q3xb3
Qb5xg1
Rh1h7
Nd8e5
Q5a2
Ngf4
Qc5xa3
Ne2xd8
Bf6f2
Ng5xb6
Bb4xg4
Rc2xd8
Qa5e7
Bxg7
Qc8xg8
Rf4xe7
Bc5xg2
gxf4
Rg8xf6
Bdd2
Bc3f5
Rb8xg1
Rf1f7
Nce1
B5xf7
Ba2xe1
Bh1g1
Bh2xh3
Ba5e1
Bh3xh5
Bc6
Rc5xf7
Qg2e1
Rcf7
Qf2xd1
Bc5xf8
Qd6xg8
B6b4
Ng5xc1
Qf8f2
Qe6b1
Bb8xg4
Bh7h5
Qh6h7
Qa5xe5
dxc6
Rd3xb7
Qa6g8
Nc4xh7
Rc6h6
Ndc5
Rb6c2
Bc1b3
Qb4xa4
Ng2e4
Qb7xc4
Qb1xh1
Ra7xe3
Qh5xd4
Re8d7
Qexd7
Qa5xb6
Qc1xg7
Bb4xa2
R3xa3
Re3c5
Qe2xd7
Rc5xe8
Nd5xb5
Nf2xa7
Bg7xe4
Bexf5
Rc8xe5
Bd8c8
Rg1xg2
Qa5xd7
N7g3
Qb8
Bd3b3
Q4xe4
Rf8c2
Rf5a8
Na5xd2
Qf1f3
Nb6a4
Nb2a1
Rb7xa6
Nb6xc8
Qh7f4
Rc8e3
Rd2a5
Nd2b5
Rb2e3
Ng2f6
Q7g8
Rf3f6
R3a1
Bb7d6
Qe8xg7
Ng5xa2
R7a2
Rd2xh8
Qa7xe3
Nh6h4
Rh6xb7
Qc1xb7
Nh6e2
Qg2c1
Ne7a5
Qg1xb5
Nd7xg7
Rcd4
Nf1d5
Na3e7
Bh7xa3
Rg1f4
Nh5xa5
N2f8
Bh6xe8
Bd7e6
Q3xd6
Rb4f7
Nh3g4
Qg4e7
Rc6xg5
Qe7xb3
Nhxh4
Bb4xb1
Ba5xb8
Nh1c6
Ra5xb6
Bb4g1
Rd4xa4
Bdxd4
Qg4c2
Rh1xd4
Qfxf5
Rf8xa3
Qf1a4
Re4c1
Qg7h7
Nh5e3
Bg6e8
Ree3
Re3e7
Nh1b7
Rg1f7
Qa1xa7
Bc3xa3
Qd8e7
Qc1xg8
Qe4
Qf4c8
Bc4xe2
Qb8xg8
Ba5f5
Rh1d3
Qh4xf1
Qh8xf2
Nd1xh8
Bexh1
Qh7g3
Bg3h7
Kxb4
Ng8b5
Bg6d4
Qb2xf8
Qf7c2
Bf8b6
Na8b3
Rh1a2
Qd2xg3
R7f6
Qf2d1
Rb8xc5
Rf4xa5
Qe3c5
Bac7
Ra5h3
Rc6xb3
Qb6xb7
Rg6xd8
Nc8h8
Qc7h4
Qb8xh7
N8xf2
Q7xh1
Qc3xc6
Ng8d6
Rf3c3
Rf8xh7
Nc5xa8
Rg1xh1
Na2e4
Qf7c8
N8f8
Nh8xe6
Qd6h2
Bbxc6
Raxd2
Bg1d8
Rg5xf8
Rd5f2
Rh2xd1
Bf7b3
Bh5b3
Nf5xa6
Rg4xa4
Be5xd4
Ra6b7
Na2xd2
Bh3xa4
Nd8xb7
Nd7xg6
Ne8c5
Bc1c3
R8h1
Bf3xd8
Qg7b5
Rhg7
Nb2xg3
Qf8xe6
Be5c2
Qc8xb6
Rh2xe3
Qbxf1
Bh2f5
Bd3xd4
Ne6xf8
Nf8xc7
Na1c5
Bh7h1
Bf2a5
Qxb7
N8xd3
Nh6xa5
Rb3xd1
Rb2d8
Rf7xe2
B4g7
Nfxc1
Be4xa8
Bb4b2
Re1h1
Nf7xh1
Bb1c6
Rf6c1
Ne2b5
Rf6f2
Re8xa4
Rf8h6
Re3xe5
Nf3xa6
Nf8e4
Re5a4
Qh6g8
Rd4h7
Bd7f4
Bh3a6
Bb8e3
Rh3c6
Rc1xe2
Rb3b1
Rh8e2
Bab4
Qd5xd4
Nd6e6
Bcc8
Rg8xd7
Bb4g2
Bh5b4
Bbxa2
Ra4xf5
Rae3
Ng7xh7
Nf2xg7
Rb4c1
Be8c5
Ng6b1
N4xb1
Qb7xf8
Ba1xa3
Qf3c5
Bah8
Nf3c3
Qd8xf5
Na1xc5
Rg5a4
Ba6b4
Re3a4
Rg8xb6
Bg5xh1
Nd6xf5
Bc6g4
Nh1xe7
Na7f5
Rh3xg3
Na4xh4
N7d4
Ba7f2
B4xc6
Rd7xg3
R3xg7
N6xa8
Nc1xa7
Nc5xf7
Nd5xa8
Nd2xc2
Nxe4
Be7g7
Na7xa3
Be1e7
Rd8d7
Rbxh1
Na1xc7
Rf2c1
N7xh2
Rf2d1
Nc8h2
Nd8xh3
N1xg6
Bc4xc8
Rh5xg2
Rh2xe1
Ra6h2
Ne8f2
Qg4a2
Nd3xd2
Rh7xe6
Nc4xc4
Nf3g2
Qa2xd8
Ra2e8
Bg2d8
Qd8c4
Bg1b1
Bd1xh1
Nb2c7
Be2h6
Nb6a1
Rbc6
B6xc7
Qa2a1
Rc3xe5
Qa4c1
Qe4e5
Ba6xa2
Qd4g5
Bb8xd8
Bb6xh5
B2xf1
Rc5xf5
Qe3xf2
Qd4xb1
Rdxc4
Qg4xe5
Nhxa4
Q4xb4
Rc8d1
Ne5d1
Rc7c7
Ba8h3
Bg1xg8
Nb1f3
Nb2xg2
Re8xc7
Bd3xc8
Bb6xa6
Ra3c3
Nf2h6
Nh2h5
Rd6xe7
Bc8c3
Qe7xd5
Qg3b2
Rb1a4
Qg3xh6
Qa2xe6
Qcg2
Bf1d7
Qdxh7
Rd6xh4
Qh6d6
Nf4c6
Qh7xg3
Qd2e5
Q6xd2
Nc1g5
Bg5h8
Bd1xf8
Qe1h8
Re8xh3
Nfd8
bxc7
Nf4e4
Qh1xe3
Rb4h6
Ng4a8
Qg1a2
Bba4
Qc2d8
Bc8c6
Bb7xc6
Qd8xe8
Qa2xh8
N2a7
Bd2c2
Qc3xb3
Rg5xh6
Nd1xe8
Nf7xd8
Nc1xc6
Be7f2
Qb1h1
Rxh8
N1d3
Ra7g5
Rf7xa1
Nf2b3
Ncc3
Rf7xe3
Bb4b1
Rf3xh3
Qh1a4
Rf7g1
Bfxa2
N2xb1
Qa2xf6
Rf8g6
Qe5b7
Ng8xg6
Rh1e8
Nc7a6
Qfxa8
Qh1f4
Ne8a8
Nh3xd5
Qah5
Qf6xe2
Ng6
Bf5xc2
Bca6
Bhxd6
Nd2g4
R8h3
Qbxa2
Rb6h5
Nf2f7
Qa3xh8
Bge8
Rd1e2
Bb2xf5
Be6xa1
Qd8xc7
Qf2xd2
Rcf2
Nd6d3
Nh3xd1
Qe8xb3
Naxf8
Rf1xf2
Nbh2
Ne6xc7
Naxb7
Bd2e5
Qb7e4
Ne1xf1
Bd2b7
Bg5xc8
Nf3f6
Bg6xb8
Bh6h7
B3a8
Qh3xg7
Ng2xb2
Rdxc7
Ra8xh1
Qf7xa7
Nd2e4
Ke1
Ne4g7
Rg2xc4
Rb6xe6
Bdf8
Be1h2
Rf1b7
Nc6h2
Bd1xg6
Bg7xh2
Qg1xb6
Rb8a5
Qc6b8
Bd3e8
Rhf8
Rg4a8
Qcc2
Rb5a8
Ba3g2
Nh1xe4
Rg5a5
Qd7a2
Bd8xg8
Ra4xh8
B1xe7
Bd1a1
Bf4xd5
Rgc1
Rf7b8
B3d3
Rd7xc4
Qdxd6
Qh4h5
Nh3xd3
Bg4xh6
Bb3d5
Rf4xb4
Na6xf3
Rd2xg5
Rc6xc5
Ra5h8
Be5xc3
Nf4xf2
Kxg7
Nab1
Rd8h8
Rc8xa1
Rg4xd7
Qh3xg8
Qe2xa5
Nd7xb6
Bd8e3
Qd4h2
Nf1g5
Nff5
Nh5xb8
Nh6xe5
Bc5a6
Qb7c4
Rh5e8
Ne2c2
Bb6xg5
Re6h3
Bb7b5
Be7xa8
Bb1xa7
Bd2f6
Qe5a6
Nde8
Qc5g3
Rd4d5
Re6xa8
Qd5b5
Q7f1
R8g5
N8d1
Na5f8
Nf8xb4
Nd3f8
Be1xh3
Qe5xc1
Bg5xb8
Nd2b4
Bb1xd2
Qab4
B8xb2
Rh1e2
Ba5d4
Ne4xh1
Bd3xa2
Qf5d8
Nd4xd2
Qb2xd7
Rf4b3
Rc3a1
Bh8
Ne5
Bh4c2
Nd5a4
Nh4xc8
Rd6c5
Nf6f2
Qb6a4
Qb1xd2
Qc7c2
Bdg8
Ba7xe7
Rg3xa2
Nc2c2
Rh1xe7
R8xf2
Bd4d7
Qh1a5
Qd6xa2
Qfh6
B8xe1
Ba3xc1
Q1g3
R8xe7
Bh7xh5
Nd5a2
Ng1a8
Bd6xd8
Nc7xd5
Qd4xg3
Rb1xe6
Qh8xg2
Ba3xb5
Rf8xd8
Nfd5
Bf2xb8
Q7xg6
Nh3xh5
Raxf5
Qg2h2
Re5a8
Qe1xf5
Qa2xd5
Ra3h1
Ncxb8
Rb6xg1
Be7a8
Re2a2
Rf1f2
Ng5xa7
Qh4e2
Re5xa2
Nb8xc3
Nd5xf1
Bg6xf5
Rd1xf8
Ba6c3
Na6c3
Nd7xb4
Be3xe2
Qgg5
Bd3e4
Rg1e1
Bc1xg8
Ra5xc3
Qb4xh8
R4xe7
Re8f7
Rh5xd4
Qd5xf3
Ng3c6
Qd6c4
Rf7h3
Rb2e1
Rxe6
Qh8d8
Bg3xa7
Nd8a1
Bg6a4
Rc2xh4
Ng4a4
Na2xc3
Nfxh8
Qb1f6
Nb2h6
Qg1h6
Rcxh5
Qf5xf3
Rgb4
Ng3d4
Ne8xh6
Ne1xd1
Rb3xb5
Bh8xh8
Bd1xa4
Nc2xb7
Bh5xf1
Qf5xb8
Qb8xc2
Ng5h3
Ba8xa7
Qd3b6
Na1a7
Bc7f8
Rc3f4
Qa7xd3
Qg1d3
Qf2xc2
Nf7xb6
Qa7xd8
Qe5e5
Bd6xc6
Ng3e5
Rc8g8
Bd7a8
Rexf4
Nf5f8
Nd7xb1
Qb2a2
Nf6xc7
Rf3xh2
Bf3xb6
Qf7c6
Rh1xd1
Nh6xb8
Bg3a1
Rg6c8
Bh8xc2
Nd7xe3
Nhxh2
Nb5xb5
Nh5d4
Nc2xh1
Bd6f6
Qee4
Qf8b4
Qg4xc5
N3xe6
Qb4g3
Bdxb2
Qa1xg4
Nc4xa1
Nc8xa5
Be8c1
Qb4xg7
Rb2a7
Bc1xf7
Rd2xh7
Qf6xd1
Qg6xd5
Ng7g5
Na7xe8
Rb7xf5
Nb6xh5
Ndxg4
Qb4xg8
Rc7d1
Ng4xe8
Qge5
Qd8h4
Qc8g7
Qd4xg8
Nha1
Nd4xf1
Bb1f1
Nc4xg4
Nd8d2
Rb1a1
N4xc3
Rhf3
B2xg5
Ne1d1
Qg3e4
R5xf4
Na7g2
Rc2c2
Na7xg1
Bc8a8
Nc4xd3
Na5d7
Qe6d2
Kxb7
Qh4xc1
Nb8xa2
Re5d3
Nd8d1
Rc5f2
Nd6xa1
Rb1b5
Qa2xg6
e4
Na7g3
Bc1d5
Bc8b5
Rd6xf6
Re2xh3
Qc6xc6
Rh7xd7
Nb2a2
Raa1
Re3xd8
Rh5xe4
Nh7g5
Rb8xh4
Re4a8
Rc1c6
Rf6xe1
Rf8c8
N4xd5
Raxe3
Qf1xb1
Qe6g4
Be1xh6
Be1h8
Rd7
N8xb7
Qa6e1
Qe1xa3
Qe1a8
Qb3a7
Bh1xb2
Rg5f3
N6g1
N3xb1
R8xf3
Qd5
Nd2xf3
N4xd6
Rf6xh3
Nc1xf3
Bfxg8
Qg8f5
Qd5xe8
R1xf5
N2g4
Bd4e3
Bg7g7
Qh1xg5
Be2xh7
Qc2xc3
Ba3f8
Rg5xc6
Q6xe7
Nh5xb7
Rg3a8
Nc6b3
Be2xc5
Bh3d2
Rb8c8
Qa8h4
Bc3xa2
Nc7d7
R5xc8
Bf7xc4
Qf2xg5
Bg4c4
B1g5
Be3b4
Bh4xf4
R8h5
Rc5e3
Bg5g4
Bg3c2
Qh3xg3
Na1h8
N5b7
Rgf8
Qf1e5
Qg8xc6
Nh3b3
Bc8f7
Rc4f4
Bexa3
Be8b8
Ne2xb2
Bg7xh3
Bb3xh6
Qe7d7
Qa4xg8
Ne2b7
Na6xe5
Rh1a1
N6xg8
Nh7xb2
Re7xg6
Bh8e1
Rf8h4
Na4c8
Bf1xc8
Be6a5
Qg4xb3
Re3xe6
Nb2f5
Nh8xe2
Qa3xc6
Nf7xb3
Qbxd6
Qec8
Q5a8
Nbe7
Nxd6
Nb6xe5
Na6xb7
Nf4d2
N2xc7
Nd1xh4
Be2xh3
Rb6xg3
Nb5xe2
Nd2xb2
Bc7h3
Qg3xb8
Q8c3
Rh6xa2
Nh7d6
Bbxc7
Bg4h4
Nh3xd7
Bh6xd4
Qa6xb5
Qe8f2
Qh1
Qb8xe5
Bc6xh8
Re5h1
Qd3xe4
Q4xh1
Rg7b8
Bg6xe5
Ne7b5
Qf5e1
Qa4f1
Rg1a6
Qhb1
Q6c6
Qb4b4
Bf3f3
Nb7a8
Bd8h6
Ne8h7
Na3xd7
Qhxd7
N8xd2
Q2xh8
Ng2xc7
Qg1b6
Bg7b6
Rh2xh4
Qg4xf8
Bd8h2
Rh8h1
Qg8xb4
Bbb7
Rb8xb7
Bg3xd8
Rg4xe3
Ng6xg3
Rbh2
Bg3xa5
Nb2xe4
Rh1d1
Rh5xc8
Nf7xc3
Rdxb6
Rf2f3
Ree4
Qg5xd4
R1b1
Re2b3
Bh4h2
Rcxa2
Bf5c4
Rg7e7
Re2xg7
Be2c8
Nd3xc3
Nd3xb3
Ba8c2
Bexh7
Q2xf1
Nc5xf8
Be5c7
e2
Qh4xa6
Qb2a7
Be6xh3
Qfxe4
Qf7xc7
Ng4xc6
Nc2xd5
Qe3g8
Ne8e3
Qa7xh4
Bg2h3
Na3xg4
Ba1xg5
Bb8xa6
Bb8h1
Qbe7
Q3xb8
Rc3xa2
Nch8
Be6g6
Na6xa8
B4d7
Be4e8
Qgxh7
Be2f4
Nh7xh1
Re6
Na1e8
Nh3xa4
Qe1g6
Bg3xb5
Ra5xc2
N8e5
Bxe6
Ba8f7
R4xb7
B5xd2
Qbxb6
Ne3c7
Nd2xa8
Nd3h1
Nfxf8
Nc5xh5
Re1f7
Qd4xg4
Qd3xc5
Rca3
Qh7a2
Re1xa7
Nd8b3
Nf7xa3
Qf6c5
R7xh1
Nc2a3
Bg1xf1
Be5g8
Bg3xc3
Qh5xd2
Bg4f3
Ng5b4
Q4xf2
Q4g8
Qg5b3
Rh3b5
Bfh6
Bad5
Qe4xh1
Re8c7
Nb1xa6
Qa2c2
Ne2h3
Ng4c8
Rc3g2
Be2xd2
Rc2xf5
Qc7xb3
Ra6xe8
Qf5xb1
Rc5xf2
Nhd6
Bb4g6
Qh8e2
Qa3c4
Bd7xe8
Ne5xa4
Ng5xg8
R7xa5
Nd1xc2
Be6xg6
Qd7xc5
Bdxa4
Na5h3
Nc5a8
Qc2xd4
Nf2xa3
Rc4g4
Nd4xd7
Nh1xb2
Qd2xe6
Bcxb2
Bah7
R2xg4
Rc4f8
Q1f3
Bh1b4
Ng8xa2
Bf2a8
Rd6xg3
Rd5xc8
Qexd4
B6b3
Rh1c7
Rc4a7
R4xh5
Rcxf8
Nd1xg7
Rd5xg8
Nc6e3
Qd5e8
Qh5xg1
Qf6xe8
Rf5c2
Rc4xd3
Bf5h6
R5e5
Nf5xf7
Na3xh2
Ne3d7
Rc6h7
Bf5xf1
Nh2b5
Nc1xb1
Qc1xc6
Qf2g6
Nc1h4
Qd6d4
Rb7f1
Nh7xd7
Nb5xd8
Qb3xc4
Bf4xh5
Rd8xh4
Bb4xg6
Qg4xc3
Bd2d1
Nc5xb8
Rf3a6
Qb2e8
Bf8xd7
Ng2d4
Re7a3
Bc7e4
Qa2xf7
B6d8
Qa7b8
Be2a6
Qe4d2
B4xh7
Qb3h4
Qh8xd3
Q1c1
Rg5e8
Rg4h1
Rc7b7
Qe6xd1
Qa8xf2
Ne3d4
Qb2xd2
Rg7xe3
Na6h6
Ngd3
Ne2h7
Ne1e2
R2xf1
Qc2b8
Nc3xh3
Rxb2
Re1xf5
Qa6xc6
Qb1xc3
Bg8a8
Be5xf1
Nh3a3
Qe3xf7
Nd8xh6
Rgd6
R6xf8
Rd2xg6
Nb3d5
Ng1xf8
Qh5xg5
N7xg5
Qb5f3
Nb3d7
Be7xh2
Nh1xh4
Rh2g2
Qa6d7
Nb5e7
Nf8c6
Rc7a5
Bf5xa4
Qe1a4
Rexe6
Rc7b6
Nhg7
Qc1f5
Qgxb6
Rc8d2
Bb1xd3
R3e2
Nf2h8
Nc5xg1
Rf1b2
Rf8xb3
Rg3a3
Bdxc5
Nf8xe2
Rb1f7
Nfxe5
N6e8
Bg3e3
Bf5xe5
Qd8xf4
Qe4f6
Be2f1
Bd4e8
Bc6e2
Rc7xf8
Bf8b2
Qaxd5
N8h2
Rb4xd7
Rg4xe8
Rf6c5
Ne4f5
Qh6g6
Nf6xb4
Qhb8
Qg4b1
Nc1f7
Bd8c3
Bd2b5
Nd5xc6
Ra2e6
Rb8g2
Rd4xb7
Qb1xg3
Rh1xb6
R2g2
Rd6xa4
Bf5xd1
Rc8a1
Nf7xh7
Be1b2
Kb3
Rc4b4
Qc6b1
Bg2xd5
Qb8b3
Bf7e3
N3xb5
Rf6xg5
Qg4g6
Nc2
Rg3xg6
Bgc4
Nd8xg5
Bf4xc4
Ba4h2
Ng8b6
Be6b7
Ng8c6
Qb4
Q4e4
Ne5xg4
Be4f7
Rb4xe3
Bb1e5
Be1g3
Qh7f1
Ng1c2
Qe5xh6
Rh4xe6
Baa5
Bd6b8
Rd4g7
Qe1xb8
Qc4xd7
Rf4xc2
Rb1h4
Rg4b3
Rf8xc6
Bg3c6
Nh2g2
Qxb5
Qae7
Qc8xf4
Na8a5
Be8xe8
Re4xc8
Ng1d7
Qge7
Qg8e5
Nc4a3
Bc6xd1
Bf3b4
Qb6xd2
Re4xg1
Nh7xf1
N8f2
Qa3g8
Rd8d8
Q2xb2
Bd2h3
Bd5a2
Ra4b1
Rd6c3
B3g5
Qb2b3
Bb5xg2
Rf7a4
Rxg1
Ng5f5
Rc1c3
Rd8b3
Be6f5
Nf7xf1
Nhb6
Be7d4
Ra8f8
Ra2xd5
Q1e3
Nd1a5
Qf4xe8
Rb5f6
Qd1xa2
Bg7xf5
Qc8xb1
B3xa5
R4xa6
B8xd4
Bb8c2
Ra8h1
Bb2d8
Rb6a7
Ba8xe7
Ra3xd8
Rc6xe2
Re2e8
Rf2d8
Ba1xc5
Ba1xh5
B2b2
Nbh7
Qh7f3
Qc6xg1
Qa2xh5
Ng8h5
Qe1e6
Qa4xd5
Nh5b5
Bh7xg8
Bh8g3
Qe3xd2
N8b2
Nd7b5
N6g3
Nexe7
Nb8h6
Nfxg7
Nc5d6
Qa1c7
Bb3e5
Qa2h5
Na8h2
Qg1xa4
Nh1xe8
Qb4e3
Be1f4
Na7xg4
Na1xg6
Bf4a6
Bh1xb1
Nb4g2
Nb4xf8
Ng1g6
Qbf6
Qe2xh8
Bb8f4
Bexg3
Rc7xa3
Bc5e5
Qh4xe6
Rg6c6
Bc1xe7
Nb4b5
Nc7b8
Bb8xh4
Rb8xf7
Rc5xh7
Qh1xf2
Qc2b1
Nd5xd7
Rfb8
Nf5xe7
Bd4xe1
Bd2a3
Na6xf1
Qd1f6
Rh5xd1
Bb6g4
B8g7
Rg7xb1
Nde6
Nh3f4
Bg5h7
Bxg8
Bg4xh2
Qf7c1
Nb2g1
Be5g3
Na7b3
Qb2e2
Nf4d8
Nc6xa8
Ra1xe2
Bb2d7
Rgxh1
Bfxh8
B2a7
Rdg2
B6b8
Ne5d3
Qc4xb8
Nc7h1
Rxh5
Rb3xe1
Bh2xa8
R6h5
N6c7
Ng8e1
Rb4xc2
Rfc1
N4g7
Qa5h6
Bd7f6
Qe5xb1
Bb8a8
Kxb2
Qd8g5
Qg7e6
Rcc8
Qe8xc8
Qe8xf8
Q2c7
Re1h4
R6g6
Ng3xd4
Nb6xg1
Nb2xe7
Rf8xd3
Nb2c8
Nc3xc2
Nc7b7
Qff8
Na6g8
Rf7xb3
Rg1a7
Ne2h6
Rcxb3
Qb7xg6
Qg8xg6
Qcf7
Rh7xa7
Re6xa3
Bb8d8
Nb3d2
Rc1h7
Ne2xe3
Be6a8
Qh2xa6
Nf4xd4
Qa5f6
Bh3xd3
N3xg6
Qb6xd5
Ba6f6
Rc4xa2
Qg6a5
Qf3a8
Re2xf3
Rc5xc3
Qd2xe2
Rc6xf2
N7xd7
Qd8c6
Bh7c6
Nh4xb6
Ng5h1
Qb3xf7
Qe3xh8
Rhg5
Rh6b6
Ra5xa7
Nch5
Rc1e5
Qa1g4
Bg5f1
Qc1xd6
Q4xf8
N2a5
Nah3
Qg3xh3
N2xg1
Rb8xa2
Rd1xh6
Ba8xe5
Rc2xe5
Be8e6
Qa7c7
Qh1xh1
Rd8f5
Ba2xd3
Nb7f7
Qfa3
Na1h2
Ra2xh2
Rb8f4
Rd3e8
Ng1e8
Beb6
Rd6xc1
Qd4a6
Qg8d1
Ngc8
Qg5f4
Rg2b4
Qa5
Ne1a4
Rd7f5
Re1g8
Qe4xg6
Bb1a1
Nb5xf2
Ba6e6
Bh3xb3
R6xe5
Qc4xc3
Ba3xd2
Ne4xf6
Bb5xb5
Bd7xb3
Bca1
Rf7xg1
Rb4g5
Na4xd2
Nexb4
Bh2xf2
Qa1b4
Bd2xa8
Rd6xc5
Rd6d7
Ng7h6
Bf7xb5
Qb8xe3
Rb3g7
Bg7g4
Qf2xe7
Nd4xb1
Qe2a6
Rf8b8
Qb7xf5
Ba5a3
Qdxa7
Na7d1
Qa3f4
Ne2h4
Ne4xg5
Qe3g3
Rb3d8
Qd5g8
Bf1xc1
Qg8xd5
Rd4xh6
a1=B
Nf2d6
Qh6d8
Bf1d3
Rh8c6
Qd2xf3
Rb2xh1
Nb6g3
Rh8f8
Ng6e4
Qa4b8
Ba8xe3
Qg5xc5
Bb4b6
Bh1h5
Qb1d5
Rf6xf6
Na4xg8
Rb7a5
Nh5e1
Re3xd7
Qc7e5
Qh8xa6
Qf1xf1
Bf1e1
Ba4b6
Rcxe3
Nf2xg4
Qf4a4
Nde3
Qg1xd1
Rf1h7
Rd1b7
Qdxh3
Q8xf4
Ne7xc5
Bbh3
Bha3
Ba3xh8
Bb7xa7
Bh8c1
Nc2b5
Nh7xb7
Q5xe5
Bf7xb2
Bd5xg3
Ra8xa7
Rd5h7
Nb2xa3
Bh8xb7
Ra6xc3
R5xf7
Rf4xf2
Qg3c4
Qf1xh1
N2h8
Bfc6
Bb1a8
Bdxb5
Ra6xg8
Re2xb2
Qh4xf8
Qe7f7
Ba5h4
Qb5g8
Be7h7
Nb1a2
Rf5d4
Bf2xg5
Bg1xa7
Nd1xb5
Qa7h3
Ng8a7
N8a3
Rd6a3
Nh4xf8
Bf8b4
Re5xe8
Rc1xc7
Rf6a7
R3xc1
Bxd4
Re7xb1
Rf5a7
Rd5xg5
Nf7xd3
Nd8e6
B5xf4
Ne3xe6
Rd2xh3
Rb8xh7
Bf8xh7
Nh6h7
Qd7xd5
Rf3xd8
Qdxf5
Rf2xe8
Bc1xa1
Nb2xg5
Qd8xg3
Bg8xh4
Qe3xa3
Ne7xf7
Rdg4
Q1e7
Ra5d1
Nd3xe2
Ne2xb5
Qa1g6
Ng3xa3
Nb7xf5
Qg3xd3
Nf6xe2
Qe7xg7
B1xg1
B3c5
Bh7a3
Qcxa3
Bc7xa8
Bc2xb6
Be7xf6
Rg2xa8
Nf1xd2
Rf7xb4
Ne5a6
Rf1xa6
Bc5e3
Nb2xb6
Bf3f2
Qb5xe3
Qg3g4
Rf8xf8
Qg4d5
N5xg3
Rc7xd4
Rh5e1
Be1h1
Rd5xf2
Rc4e7
Ng3xg6
Qa2xe8
Bexg2
B7e3
Rc6xd7
Qd4xh7
Bc5xd6
Qd4xc6
Bexh3
N3xa8
Rf1d1
Nd4f3
Bf3xe4
Bh8xf5
R2d3
Qh7d5
Rh6g6
Rh3xa6
Re4xe2
R7xb6
Qef7
Qhf3
Rd3a3
Bf1xc3
Rc7xa1
Qh1xa3
Qfxh6
Bc4d8
Bd5a7
Bd3xh1
Nc4xa2
f6
Nb3b1
Rb3xd3
B2xc3
Bg7xc2
Ne5xg6
Re8h2
Bhf6
Ba3g6
Qda5
Qe6xa1
Bd8b4
Rh1b1
Nc5xb4
Rg6a3
Be1xc5
R2xe4
Re1c5
Qb3d3
Re1b1
Na1a2
Ba2xd6
Bg4h7
Nh4xh2
Ra3f5
Q5e6
Ra7f6
Rg3d2
Qdf6
Re8xb7
Qc5e4
Qf3xh1
Rf5xg4
Ne3xb4
Bf5h3
N4g1
R5xc1
Qf7f3
Qh1f1
Rf4xf8
Nf6g7
Qd8d3
Qf5h1
Nf7xa4
Q5a1
R6xh6
Qe2xg5
Bhxd5
Na6xa2
Bg6xd1
Bc8e2
Rf1e3
Na6a8
Rd4h6
N4f3
Bd7xg8
Qg8xc1
R3xh3
Re3b3
Bf7xd4
Ba4xh5
Bh1c1
Rf8c4
Ra1xg3
Ng4xd7
Qaf5
Qc6e3
Rf3xc7
Bc2b6
Rd5a1
Qhxc4
N2xf2
Qa2xc7
Be2xf3
Re6xf4
Ng4d1
Qa4xg2
N7d6
Qd8f4
Bc7xh8
Nd1b5
Qd6xa5
Qd1e7
Na5xa7
Nd7c6
Qb5c4
Bd8xd2
Nf2e4
Nf4xe1
Bh7e5
Reg7
Bd1h7
Re5e2
Rg3b6
Qeg6
Bf1
Na7xb4
Na2xe3
Bf5xg8
Ne3xb7
Bd5xd6
Qh8g1
Ne4c1
Qfe1
Rg8xc4
Be8f3
Bh7b2
Ra6f6
Qc1xc1
Bf5xc8
Nc4h1
Bc4xc1
Rc4a6
Bc2c7
Re7h7
Nc3f7
Qg8b1
Be3xa8
N1xh7
Nd7c2
Na4xf1
Ne5c2
Qh4d1
Rb7
Ra3d3
Qd6xh6
Rhd8
Bb1xc8
Nc2xe4
Qg2xa8
Baxe7
Nb4xd8
B8xf5
Bb3xf6
Na6d5
Rh3h7
Nc8xc6
Qf7xa4
Q7a8
Nb1xc5
Ref3
Q8c8
Ra4e3
Raxd1
B1xb5
N5xc4
Nb1f4
Q6g6
Be1c7
Bf3xg8
Nf4xa4
Rd3xg4
Rf6xd7
Nc8xc1
Bd6c3
Bh3xd6
Ndxe2
N8xc1
Ngd2
Rf2d6
Bg7g3
Nh7d3
B7b6
Rcc3
R4e8
Bc5xe3
Qf3xc8
Ba5xb2
Rh4c3
Bd5b7
N3b2
Q8b4
Nd1xe1
Bba5
Nb6xc4
Qfxe6
Be4xf8
Nh3f6
Nb2h1
Be3xe7
Nc7f3
Qc4a2
Nf3b3
Nh3c1
Rf6d8
Qd1e5
Rf4xa2
Nf7d4
Bf3
Rh3xh4
Bg8c2
Rf4xf6
Rd8xe3
Qbe6
Nc5xh2
Ne3h7
Bgxc3
Bh4a3
Na8f8
Qd1xf3
B7b7
Qc4xf3
Re7h8
Bc7xh2
Rf7xd3
Bh3xc4
Rb4xa1
Qc4xe4
Bh5xc7
Nbf4
Qd5a2
Rb7xc3
Beg3
Rb1c3
Qh1f5
Be1xa3
Rc1g4
Bb8a2
Rh4xd6
Ng1b3
Qf1xg1
Rh5xa6
N8b6
Rb3xg6
Qc5xh2
Bc8xa8
Qh6xb6
Qd4e8
Bf5g7
Ba3xd6
B8c4
Re3xc6
Qd5xf4
Bg2xf6
Qf5f6
Qe6xa7
Nxb5
Rh6c6
Qd2h4
Ba1xh6
Rf5e6
Qa3c8
Qc8xc4
Nb4xh5
Bf4xe6
Rh6xd1
Qe4xb6
Qg7xf4
Qf8a5
Qh4b8
Nc3xe8
Rd1xd4
Nb5xa8
Rfxa1
R7g7
Rf3xg5
Na2xb8
Nd7g7
Qa6xe8
N1xa7
Bh4xb5
N6d3
Nc6xh2
Rh8xe7
Qh6xa2
Bca2
Rf5xb8
Qc2xg4
Rf3f8
Kxa1
Bxe3
Ne7c5
Nb4f6
Ng1h1
Qf8b2
Bd3xg2
Bha4
Qf2h6
Qg5g3
Na4xf5
Qf5xg4
Nxd8
Rf8h1
Qb3e5
Bd3xc5
Nhxg5
Ba6xd4
N7xe1
Ne1f4
Nc8xe8
Nc4c2
Q6xf7
Ne8xc1
Bg5c4
Rh4xg3
Qb6d7
Rb7xh4
Nc4b8
Nh4xb4
Ba8f6
Qe8xh1
N6c2
Qc1b6
Ng4xg6
Nb3xb5
Bb8a4
Qh6f5
Bg4c7
Nfxd3
Ba5xg6
Bd3d2
Qd2xd3
Qc7xa3
Nbb7
Rh7xc5
Nh5xb5
Bh5xf4
Bb7h5
Rd7xh4
Na5d8
Be2b1
Q3d1
Nc8g4
Nc1a4
Nc2xb3
Qbf3
Na1c8
B1xd6
Bg8b7
Rac7
Ba7h4
Rh4xa7
Nh1c5
Rg7xh5
Rd2xb4
Qh7xd3
Qc3xg3
Rh7c3
Bg5c2
Nd1h3
Nf2f6
Qgh2
Rc1e8
Bd7b5
Rg8f8
Nc2xe1
Bf3xf3
Nh6f7
Bfxd7
Qc7xa2
Qh8f5
Ba2g4
Re6a4
Bg8d7
R4h3
Nc8c1
Qd1xc7
Ncb4
Qe6f5
Rb8xe5
Ne5h7
Qga2
Nd1f1
Rhh8
Nd7g4
Qc7b6
Qe7xf7
N7h6
Rhxd5
Na3b7
Qb6b5
Nea8
Bb1xh6
Qg2a4
Nc5xe4
Qh6xf8
N7d5
Ng8xf1
Qc2xa1
Rd4c7
Rc5xe3
Qh1xh3
R5xh5
Rfd3
Q3xf6
Q2xd8
Qc3xe8
Rea2
Qhxf5
Q7xa7
Rf7g8
Ra5g1
Bc3xg3
Ng3d2
Qc4xa2
Qc8xg4
Nb2b6
Ng6g8
Ra6e6
Rd3g6
Bd7b6
Nd8xd8
Ra7xc7
Qg2g2
Qc2d5
Rf5xg7
Qc8g5
Bh4xa7
Nd1xc8
Rea8
R8xh1
Qb4xd5
N6xd4
Qc3xd6
Bd5b5
Rxf3
Qag4
Bc8g4
Ba8d2
Q2xe1
Qxe3
Na2d7
R3xa5
Rb8xb8
Bc3xb1
Nf5c6
Bf6xf1
Rf4xh2
Bb6e1
Bf2xg6
Qc6h5
Qa1d4
R8f8
Nh7xf7
Bc7xc5
Bf8xh5
Rc8b7
Rf8d3
Qh4c7
Qh4xb2
Bc8f6
Nc5xd6
Ba5g6
N5a2
Na3xf2
Qb3xh1
Qc8xa5
Rg3g6
Q4f6
Rf2xe4
R2d1
Rb4xg5
Nb8xh6
Qfxb3
Ra2e3
B5c1
Rg5f1
B5xc3
Ba3a3
Bd1xd8
Bb2b5
Bd6xe5
Bg6xd4
Rd3xd3
Nc6c1
Ne4xh5
Be7xd8
Be7h5
Q6xf8
Bd3c2
Na4xb7
Bb1xb7
Na2xe1
Qg6a3
Nd7xd1
Qc4b1
Rg6xa6
Rgxe6
Nf6b5
Ra8f2
Rh1xh2
Qf8h5
Bg5b5
Rgc6
Ne6xa2
N8g6
Q6f2
Rd5xa3
Nf4xa3
Bf2a3
Bb5xh6
Qc7xg6
Qc4b5
Qg4xc8
Ng6e1
Bg1f7
Be5xh7
Rf2xb2
Nb3xa8
Bc2xg3
Rg1xc4
Be6xf7
Q8g4
Ng1xd6
Qb7xc6
Bb5xa6
Rd5xg2
Ba4d8
Bce6
Re1h6
Qhb4
Qa1xd7
Bh3xg4
Na7f1
Bf2xa2
Nhf6
Nf5h1
Na1xd5
Rh4a7
Ng4xf8
Rf6xa4
Rh4h4
Qa4a4
Qe5e4
Rh7h2
Na2c7
Qe1xg8
Bg7xc8
Bh6f2
Bf7xe7
Q4a3
Na7h4
B8xc4
Rd6xh1
Nb6xb5
Bf7b7
Rf3xe2
Bad4
Kg4
Re8f8
Nf8xa5
Bc3h8
Bh4xd5
Q1e1
Qh2xh1
Bhxh2
Ba3xf7
Qg2a7
Qcxf4
Be1xg5
Nb1d2
Ba6xc7
Bb1xh1
Ng8a6
Nb3b4
Bg1f3
Qh6h8
Bh1xf3
R6c2
Qdf2
Qe6f1
Ne6xe1
Rexh6
Rbc7
Nd1xe7
Bcb8
Bb3xg5
Na4xe2
Na5c8
Ne2xa2
Rgc4
Qa3xe2
Rh2f2
Qb8xg3
Bh6xf5
Nd6xe5
Nc4e7
R5g1
Qg5xh8
Bc1xd5
Qf2h4
Bg2xe1
Qe8f7
Be1g8
Ba2f1
Rd7xh3
Qc5a2
Ng6xg2
Qh2b8
Bd4f8
Bh6a1
Bfb5
Qd3xh7
Qa4xb4
Be8a7
Rh1g8
Qc6e1
Qg5d7
Qg1xb1
Qb4xc3
Bf2b4
Nd8b4
Re6xe3
Ba4f2
Bg3xg4
Nh6xd5
Ra3xd7
Re2xa8
N4xf5
Nd1d2
Na3g2
Qg8xe8
Qh7c1
Nb5xf7
Qbxd3
Qf3xg4
N1a5
Rd8xh6
Rc3xf1
Bh8b8
Ra2xc5
Rd1xg1
Q7e1
Qb5xe5
Qd5d4
Rg1xb2
Qd3a3
Nc8c7
Rc2xf7
Ng2c1
Rh5a1
R6f4
Bd4d4
Qd5a1
Nc5c2
N8xa8
Rg4xf4
R6xc3
Ng7xb4
Qa6c8
Qb5xa6
Nf5a2
Nb6xg5
Rh3g5
Qh8xh8
bx1=Q
N8b5
Bd7a3
Re7d4
Rh4g8
Rh1c3
N3e6
Be5f1
Bg7xe2
Re3xd2
Bb5d4
Bb7g8
Rb7xd8
Ne1xh7
R2h3
R3xc8
Rh4d4
Bf3g6
Nf4c2
Ra2g2
Bf7h1
Ra5xc8
Rc5c4
Qf4xh3
Bd7c1
Kh7
Qg1xg8
Qg8xc8
Rc8b6
R5g8
Bg2c1
Ba5a2
Rh6xh6
Qe7xb2
Qc2e3
Qf5g4
Bb3f8
Q3d2
Bg4xh5
Qf6xe4
Qh7xa1
Na4xe7
Qe4e6
Rc6xh2
Re8xg7
Nh4g4
N6e1
Ne5c8
Qh8xb7
f1=R
Q1xc2
Rf2
Qh3a6
Qc7xe7
Bb2d5
Qcxf2
Rf7xh5
Qd8xe1
Qa8xb6
Be5e4
Ne8xg5
Nca7
Qa7xg1
Na2xg4
Be6xa2
Re8g2
Bf8c5
Rf6xh5
Qb1xc1
Rh6f8
Qd3xd4
Qa6d3
Qf8xa6
Ba5xa3
Qd4xc5
Qe2xh5
Nh8a6
Rf7xd7
Qe3xb5
Ba2xe7
Re6h2
Bf3f7
Ba4c1
Rc6g4
Rg5xd3
Na6xe6
R5f7
Rhf4
Qh8xa8
Ng4e3
Ng6xf5
c5
Qa5xh2
Ne1h2
Ra7xg1
Ndd2
Nh6xg6
Rh1b6
Rf7h6
Nc4g3
Qb8xg1
Rf8xh4
Rb4f5
Nb8a8
Nb3xg2
Nb1d7
Qc3xb4
Ra1f6
Bb1xd4
Nc3e4
Rd7xa4
Qc4a1
Bc7d8
Nh1xg4
Naxh7
Nd6xc1
Re8c3
Rf4xc4
Nc6e6
Rh2b8
Ne5c4
Bd1g5
Ne7xh6
Ra1xb6
Q6d1
Qg4h1
Nh2c1
Qa7xh1
Ra8xc6
Rg5xa5
N8d5
Rc3xd5
Ngxb3
Nd1d5
Nxf3
Nf1c8
Na3a8
Rf6xd2
Qh8f4
Qf8xc7
Nh1xh6
Be6d4
Rh2xf2
Bf8xh4
Nd3d5
B4e5
Qg2xc7
Bh8g6
Qf5xe4
Bd1a2
Baxb6
Ra1xf3
Nh2f1
Ne8xd7
Qh2xa4
Rh2h7
Nd8xg2
Ne3g1
Rc4xc8
Bb2xe6
Ba5a1
Bc6b3
Qd3xb1
Rd5g6
Bg1g3
Nd2xe5
Qd8xf6
Bb3b6
Nc3e3
Ba5d6
Nh4xd8
Rg4a7
Na4h2
B6f3
Ng7e2
Bd8b2
R7xg8
Rb5h1
Nf7xd4
Nf3xd3
Qh5xg4
N4xf6
Nh1xh5
Bd2xh8
Bf8xa8
Nd1xd2
Ba8xe8
Rg2xh1
Ra5xd1
Re6xc3
Bf8g6
Rc8e7
Rb1d3
Qh5a3
Qd5f5
Be3xb2
Nd4xa7
Rh3c3
Ne2xb6
Bab8
Bg7d4
Be3xc3
Nd2xc1
Bf3e3
fxe6
N3xb7
Be1xf3
Qe8f1
Nh3xg7
Nf2
Nh6g4
Ra5xh2
Qf4xc4
Rc1xb2
Bb2d4
Rh6xe7
Ba4d3
Bgg4
Bc2e4
Qf7xc3
Bg4e3
Nf7f1
Rg1xg7
B4xb1
Qe5h1
Bg7h4
Qb1xh2
Re1d1
Qf5xg8
Qh7f7
Bfxb8
Bb7xa8
Bf8xc3
Bg4b5
Bf1xa4
R5xh8
Ne8xe8
Rf1xf8
Bd1xc6
Q2b8
R8a2
Bdc5
Qb1
Nb6xd2
Re1xh6
Rg4c1
Re8xb2
Re3c8
Rd6b7
Bf3d3
Ne2xc6
Bh4xd4
Na2xb6
Rhc4
Bg7xe5
Nd5f3
Nd6xe6
Rf4xe5
Qh6c4
R5c7
Bd7xf6
N7xh4
Qa4d1
B3b1
R1d3
R7xf8
Rd4xc6
Nf4g2
Be2xh6
Rh8xd3
Na3xc1
Rd6xf1
Q8xc3
Bfxd3
Bf6a1
Qg1h4
Qc4xg2
Nb1xb2
Bg5xb6
Bgxf1
N5xg7
R2g5
Nd5xf6
Ra8a1
Qdxd8
Naxe5
Bg4c5
Qf5xd6
Qc4b3
Nh8f1
Qb3xb2
Bc6xg8
Bb8xc2
Qg8xh8
N7h5
Rh5xb4
Qe5xb5
Ndxd3
Bh8c3
Rexd1
Qb4xb7
Bg5xc2
Re5e8
Qb1xc4
Qh8xf8
Qg4h7
Qd4xd6
Bg3xg8
Nxb3
Qc5e8
Nd8xc3
Rc4a4
Qab8
Rg5
Rc6xb8
Qf1e2
Bg6h5
Rb5xe8
Ng8d2
Qb5a3
Qh6xb2
Bde7
Qb6xb1
Qe3b1
Ra1g6
Na8xa8
Nhxb2
Ng3a8
Rd2f6
Nf8xb6
Rh2xc3
Rb2xa8
Qa1xf3
Qhxd5
Rc4c3
Na1e1
Rh7a2
Qa4e8
Nh3xg6
Bb5f1
Rd3f5
Qaxh3
Nf1xh4
Rac5
Ncxg2
Qe6b6
Rc3xd4
Qc7xg8
Rc6xg1
Rd6b3
Qg5xc4
Re6h5
Rd7g7
Qch1
Rc7a2
Bc2e6
Qd7c5
R3d2
B1xa5
Bhh5
Q8xh4
Ng4c4
Nb7xa8
Ne7xd8
Rh6g8
Q1xc8
Qg2h5
Qha7
Rf3xe8
Nh5d5
Bb1f6
Bcxb4
Qa6xe1
Bc5e2
Nf7xa8
Rh2f1
Rf5f3
Nf2a7
Ng1d3
Ba2f7
Rg6xe6
Bg6xc3
Qd1g1
Rg7f1
Nc8d5
Nexf2
Qa8a4
Qg8xb3
Q5c1
Ng7xc3
Qca6
Nd2a3
Bb4e4
Re3xa5
Bd2f8
Nb4xh2
Ba5b1
Ra7xa4
Ba8g5
Ng8h6
Ra2xb8
Nh3xh6
Qg5b2
Nga1
Nf3xc2
Bb6xg6
Qaa5
Nf7xc2
Ra7xg5
Qa6d8
Qc8xg5
Bd6xd6
Qb6e3
Rc5xe6
Na4xc6
Rf4xg3
Rh4d5
Rf8xc2
Rh8xe5
Bf1xd1
Ne6xg7
Rd5xe8
Qc8xh8
Q5xh2
Bd3d3
Nd7d3
B8xa4
Nb2xf5
Q4d7
Bg4xh4
Ne5xa2
Qh2xa7
Ne1b7
Ba5xd4
Re5a6
Ne8a2
Qc1xd1
Bb5xd5
Rd2a3
Rf4e2
Qb8xd6
Ra8xa5
Qg4xb6
Ne7c1
Ba2e7
Qh5h4
Rd4b5
Ra4e2
Rb8d2
Rg8xg2
Qa5b3
Na6b7
Rd4a2
Bf7g2
Bb4xh5
B2f7
Bh7d2
Qb1a2
Qd7xe6
Rb1xg2
Rh6xh3
Qfb8
Qg2xc3
Bdh8
Rh4xd8
Na3f5
Qg4c8
Rf2g5
Q8d2
Qa1xa6
Qa1a3
Rf5c4
Rb4b4
N6xc2
Nb1xg3
Nb7a1
B8f5
Nf7xb1
Q1xg7
Nf3xc4
Rb5a4
Bexf1
Ba4a7
Rg7f7
Bea7
Qe7xf5
B5c2
Bcxe8
Qf3xe3
Qe6xe1
Ba6f7
Bb3c7
Nd6a2
Ncxe3
Bg3g5
Nexf3
Bh8xa7
Qf8xf1
Rd8xd8
Nd6g8
Ngxa8
Bb7xe7
Bh5b5
Nc2xh3
Bh7b3
Nf4a3
Q6e6
Bbg6
Rd8xf6
N8xe6
Qh8xf6
Rbxe4
Qb5c6
Be2xg7
Qc8g8
Qg8e6
Rc7xd8
Bf7f4
Qg7xa2
Qg4g1
Qa4g6
Qd1g2
Bh1xc7
Rd7xh6
Rc1xb4
Rh5xc2
Rg3xg5
Be5c8
Rf4xe8
N2xf1
Qc2xf3
Ne1d7
Ng6h6
Qhxe6
Qf7f8
Ne8xg6
Rb3xa1
Ne3a8
Qa3c2
Nh5xg5
Ne3xg6
Bc4xf5
Nh7c4
Qa7
Bh4e1
Ne6xc3
Bd6f2
Rc3h6
Qc7b4
Qf7xg1
Nca8
Qhe1
B3xb5
Be1c8
Bb4g5
Qa7xd7
Bf8xh1
Ra7h4
Qg2xc1
N4d6
N3f3
Qg7xe6
N3xb3
Qh5g4
Qge4
Be3g7
Qf3xb4
Rd7xd3
B7f5
R8a6
Rd1xb7
Bb1c8
R7g3
Qf1f4
Nd2f4
Be4d8
N1d8
Bexd4
Qa1c6
Qf2xc6
Rf8a4
Nb2xb1
Qe2xc7
Qf6xg5
Bbxg8
Ba3xb6
Qg8c8
Qg8xb6
Bc5g2
Qf1xa2
Bf6xa7
Qh2xg7
Rh8xd6
Bc7xa2
Rd3xf8
Rh6f5
Rb4xf2
Bf2f1
Nf6xf3
Nh8b1
Rd1xf3
Bg1xe1
N2xe5
Qg6e4
Na7b4
Nf1f6
Rg6e8
Qe8xh3
Nh8xb2
Bh8xh3
Qg2xe2
Rg8xc1
Nh3xc1
Ba7xc3
Bc1xg2
N3d6
Qg2f7
Nh8xb6
Nhxb5
Rg6xd5
Rc3xh8
Bg1b8
Q8e8
Bb1xh3
Na5b3
Qa1c2
Bd7g7
Na3h8
Rh1xh7
Bg4b8
Rg1g6
Qb4xg3
Bc5xb5
Bg5xd7
Ra7b6
Bg3d6
Nh4
Ba7xh1
Bd1a6
Bf6xg4
Rb3xf5
Ng5d8
Ncg3
Qdxd5
Nb2xg6
Rh3g6
Ne5xe2
Rg7h6
Rh1xa3
Rb6c1
Rh4xe1
Qb3e7
Rg2c2
Na2xd3
Qb5xf2
Rc6h8
Bh4xh4
Rdxh5
Be4f8
Bc5d7
Qb3xf4
Ra8xd6
Nc5xe8
Rf7xe4
Rd7b8
Qe6g8
Ba6xa4
Qe5xg5
Rb3c7
Raxc7
Nf4xf8
Rg8a1
Re8e1
Qa7g1
Qb2c1
Qg2xd1
Bf3xf8
Nd2xd3
Nc4xh1
Rg5xg8
Qf1xf2
Q3e5
Nb7h3
d1=N
Qf2xa1
Qh3a4
Qb8xf5
Nf5e1
Rd4xc5
Rexb4
Rh5f4
Qa1xc6
Rh2b1
Qg7xb4
Qf7c5
Qc7g3
Qh7c4
Nf4a7
Rg3a6
Na7xa6
N7xf1
g5
Ng2xg6
Rf6xd5
Nh2d2
Na1xe7
Ba4d1
